MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: CCP8CAP
#define CCP8CAP CCP8CAP
extern volatile unsigned char           CCP8CAP             __at(0x314);
#ifndef _LIB_BUILD
asm("CCP8CAP equ 0314h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
    };
    struct {
        unsigned CCP8CTS                :8;
    };
    struct {
        unsigned CCP8CTS0               :1;
        unsigned CCP8CTS1               :1;
        unsigned CCP8CTS2               :1;
        unsigned CCP8CTS3               :1;
    };
} CCP8CAPbits_t;
extern volatile CCP8CAPbits_t CCP8CAPbits __at(0x314);
// bitfield macros
#define _CCP8CAP_CTS_POSN                                   0x0
#define _CCP8CAP_CTS_POSITION                               0x0
#define _CCP8CAP_CTS_SIZE                                   0x8
#define _CCP8CAP_CTS_LENGTH                                 0x8
#define _CCP8CAP_CTS_MASK                                   0xFF
#define _CCP8CAP_CTS0_POSN                                  0x0
#define _CCP8CAP_CTS0_POSITION                              0x0
#define _CCP8CAP_CTS0_SIZE                                  0x1
#define _CCP8CAP_CTS0_LENGTH                                0x1
#define _CCP8CAP_CTS0_MASK                                  0x1
#define _CCP8CAP_CTS1_POSN                                  0x1
#define _CCP8CAP_CTS1_POSITION                              0x1
#define _CCP8CAP_CTS1_SIZE                                  0x1
#define _CCP8CAP_CTS1_LENGTH                                0x1
#define _CCP8CAP_CTS1_MASK                                  0x2
#define _CCP8CAP_CTS2_POSN                                  0x2
#define _CCP8CAP_CTS2_POSITION                              0x2
#define _CCP8CAP_CTS2_SIZE                                  0x1
#define _CCP8CAP_CTS2_LENGTH                                0x1
#define _CCP8CAP_CTS2_MASK                                  0x4
#define _CCP8CAP_CTS3_POSN                                  0x3
#define _CCP8CAP_CTS3_POSITION                              0x3
#define _CCP8CAP_CTS3_SIZE                                  0x1
#define _CCP8CAP_CTS3_LENGTH                                0x1
#define _CCP8CAP_CTS3_MASK                                  0x8
#define _CCP8CAP_CCP8CTS_POSN                               0x0
#define _CCP8CAP_CCP8CTS_POSITION                           0x0
#define _CCP8CAP_CCP8CTS_SIZE                               0x8
#define _CCP8CAP_CCP8CTS_LENGTH                             0x8
#define _CCP8CAP_CCP8CTS_MASK                               0xFF
#define _CCP8CAP_CCP8CTS0_POSN                              0x0
#define _CCP8CAP_CCP8CTS0_POSITION                          0x0
#define _CCP8CAP_CCP8CTS0_SIZE                              0x1
#define _CCP8CAP_CCP8CTS0_LENGTH                            0x1
#define _CCP8CAP_CCP8CTS0_MASK                              0x1
#define _CCP8CAP_CCP8CTS1_POSN                              0x1
#define _CCP8CAP_CCP8CTS1_POSITION                          0x1
#define _CCP8CAP_CCP8CTS1_SIZE                              0x1
#define _CCP8CAP_CCP8CTS1_LENGTH                            0x1
#define _CCP8CAP_CCP8CTS1_MASK                              0x2
#define _CCP8CAP_CCP8CTS2_POSN                              0x2
#define _CCP8CAP_CCP8CTS2_POSITION                          0x2
#define _CCP8CAP_CCP8CTS2_SIZE                              0x1
#define _CCP8CAP_CCP8CTS2_LENGTH                            0x1
#define _CCP8CAP_CCP8CTS2_MASK                              0x4
#define _CCP8CAP_CCP8CTS3_POSN                              0x3
#define _CCP8CAP_CCP8CTS3_POSITION                          0x3
#define _CCP8CAP_CCP8CTS3_SIZE                              0x1
#define _CCP8CAP_CCP8CTS3_LENGTH                            0x1
#define _CCP8CAP_CCP8CTS3_MASK                              0x8

// Register: MD1CON0
#define MD1CON0 MD1CON0
extern volatile unsigned char           MD1CON0             __at(0x315);
#ifndef _LIB_BUILD
asm("MD1CON0 equ 0315h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIT                    :1;
        unsigned                        :3;
        unsigned OPOL                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD1BIT                 :1;
        unsigned                        :3;
        unsigned MD1OPOL                :1;
        unsigned MD1OUT                 :1;
        unsigned                        :1;
        unsigned MD1EN                  :1;
    };
} MD1CON0bits_t;
extern volatile MD1CON0bits_t MD1CON0bits __at(0x315);
// bitfield macros
#define _MD1CON0_BIT_POSN                                   0x0
#define _MD1CON0_BIT_POSITION                               0x0
#define _MD1CON0_BIT_SIZE                                   0x1
#define _MD1CON0_BIT_LENGTH                                 0x1
#define _MD1CON0_BIT_MASK                                   0x1
#define _MD1CON0_OPOL_POSN                                  0x4
#define _MD1CON0_OPOL_POSITION                              0x4
#define _MD1CON0_OPOL_SIZE                                  0x1
#define _MD1CON0_OPOL_LENGTH                                0x1
#define _MD1CON0_OPOL_MASK                                  0x10
#define _MD1CON0_OUT_POSN                                   0x5
#define _MD1CON0_OUT_POSITION                               0x5
#define _MD1CON0_OUT_SIZE                                   0x1
#define _MD1CON0_OUT_LENGTH                                 0x1
#define _MD1CON0_OUT_MASK                                   0x20
#define _MD1CON0_EN_POSN                                    0x7
#define _MD1CON0_EN_POSITION                                0x7
#define _MD1CON0_EN_SIZE                                    0x1
#define _MD1CON0_EN_LENGTH                                  0x1
#define _MD1CON0_EN_MASK                                    0x80
#define _MD1CON0_MD1BIT_POSN                                0x0
#define _MD1CON0_MD1BIT_POSITION                            0x0
#define _MD1CON0_MD1BIT_SIZE                                0x1
#define _MD1CON0_MD1BIT_LENGTH                              0x1
#define _MD1CON0_MD1BIT_MASK                                0x1
#define _MD1CON0_MD1OPOL_POSN                               0x4
#define _MD1CON0_MD1OPOL_POSITION                           0x4
#define _MD1CON0_MD1OPOL_SIZE                               0x1
#define _MD1CON0_MD1OPOL_LENGTH                             0x1
#define _MD1CON0_MD1OPOL_MASK                               0x10
#define _MD1CON0_MD1OUT_POSN                                0x5
#define _MD1CON0_MD1OUT_POSITION                            0x5
#define _MD1CON0_MD1OUT_SIZE                                0x1
#define _MD1CON0_MD1OUT_LENGTH                              0x1
#define _MD1CON0_MD1OUT_MASK                                0x20
#define _MD1CON0_MD1EN_POSN                                 0x7
#define _MD1CON0_MD1EN_POSITION                             0x7
#define _MD1CON0_MD1EN_SIZE                                 0x1
#define _MD1CON0_MD1EN_LENGTH                               0x1
#define _MD1CON0_MD1EN_MASK                                 0x80

