MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile DAC1CON2bits_t DAC1CON2bits __at(0x590);
// bitfield macros
#define _DAC1CON2_REF_POSN                                  0x0
#define _DAC1CON2_REF_POSITION                              0x0
#define _DAC1CON2_REF_SIZE                                  0x8
#define _DAC1CON2_REF_LENGTH                                0x8
#define _DAC1CON2_REF_MASK                                  0xFF
#define _DAC1CON2_DAC1REF8_POSN                             0x0
#define _DAC1CON2_DAC1REF8_POSITION                         0x0
#define _DAC1CON2_DAC1REF8_SIZE                             0x1
#define _DAC1CON2_DAC1REF8_LENGTH                           0x1
#define _DAC1CON2_DAC1REF8_MASK                             0x1
#define _DAC1CON2_DAC1REF9_POSN                             0x1
#define _DAC1CON2_DAC1REF9_POSITION                         0x1
#define _DAC1CON2_DAC1REF9_SIZE                             0x1
#define _DAC1CON2_DAC1REF9_LENGTH                           0x1
#define _DAC1CON2_DAC1REF9_MASK                             0x2
#define _DAC1CON2_DAC1REF10_POSN                            0x2
#define _DAC1CON2_DAC1REF10_POSITION                        0x2
#define _DAC1CON2_DAC1REF10_SIZE                            0x1
#define _DAC1CON2_DAC1REF10_LENGTH                          0x1
#define _DAC1CON2_DAC1REF10_MASK                            0x4
#define _DAC1CON2_DAC1REF11_POSN                            0x3
#define _DAC1CON2_DAC1REF11_POSITION                        0x3
#define _DAC1CON2_DAC1REF11_SIZE                            0x1
#define _DAC1CON2_DAC1REF11_LENGTH                          0x1
#define _DAC1CON2_DAC1REF11_MASK                            0x8
#define _DAC1CON2_DAC1REF12_POSN                            0x4
#define _DAC1CON2_DAC1REF12_POSITION                        0x4
#define _DAC1CON2_DAC1REF12_SIZE                            0x1
#define _DAC1CON2_DAC1REF12_LENGTH                          0x1
#define _DAC1CON2_DAC1REF12_MASK                            0x10
#define _DAC1CON2_DAC1REF13_POSN                            0x5
#define _DAC1CON2_DAC1REF13_POSITION                        0x5
#define _DAC1CON2_DAC1REF13_SIZE                            0x1
#define _DAC1CON2_DAC1REF13_LENGTH                          0x1
#define _DAC1CON2_DAC1REF13_MASK                            0x20
#define _DAC1CON2_DAC1REF14_POSN                            0x6
#define _DAC1CON2_DAC1REF14_POSITION                        0x6
#define _DAC1CON2_DAC1REF14_SIZE                            0x1
#define _DAC1CON2_DAC1REF14_LENGTH                          0x1
#define _DAC1CON2_DAC1REF14_MASK                            0x40
#define _DAC1CON2_DAC1REF15_POSN                            0x7
#define _DAC1CON2_DAC1REF15_POSITION                        0x7
#define _DAC1CON2_DAC1REF15_SIZE                            0x1
#define _DAC1CON2_DAC1REF15_LENGTH                          0x1
#define _DAC1CON2_DAC1REF15_MASK                            0x80
#define _DAC1CON2_R8_POSN                                   0x0
#define _DAC1CON2_R8_POSITION                               0x0
#define _DAC1CON2_R8_SIZE                                   0x1
#define _DAC1CON2_R8_LENGTH                                 0x1
#define _DAC1CON2_R8_MASK                                   0x1
#define _DAC1CON2_R9_POSN                                   0x1
#define _DAC1CON2_R9_POSITION                               0x1
#define _DAC1CON2_R9_SIZE                                   0x1
#define _DAC1CON2_R9_LENGTH                                 0x1
#define _DAC1CON2_R9_MASK                                   0x2
#define _DAC1CON2_R10_POSN                                  0x2
#define _DAC1CON2_R10_POSITION                              0x2
#define _DAC1CON2_R10_SIZE                                  0x1
#define _DAC1CON2_R10_LENGTH                                0x1
#define _DAC1CON2_R10_MASK                                  0x4
#define _DAC1CON2_R11_POSN                                  0x3
#define _DAC1CON2_R11_POSITION                              0x3
#define _DAC1CON2_R11_SIZE                                  0x1
#define _DAC1CON2_R11_LENGTH                                0x1
#define _DAC1CON2_R11_MASK                                  0x8
#define _DAC1CON2_R12_POSN                                  0x4
#define _DAC1CON2_R12_POSITION                              0x4
#define _DAC1CON2_R12_SIZE                                  0x1
#define _DAC1CON2_R12_LENGTH                                0x1
#define _DAC1CON2_R12_MASK                                  0x10
#define _DAC1CON2_R13_POSN                                  0x5
#define _DAC1CON2_R13_POSITION                              0x5
#define _DAC1CON2_R13_SIZE                                  0x1
#define _DAC1CON2_R13_LENGTH                                0x1
#define _DAC1CON2_R13_MASK                                  0x20
#define _DAC1CON2_R14_POSN                                  0x6
#define _DAC1CON2_R14_POSITION                              0x6
#define _DAC1CON2_R14_SIZE                                  0x1
#define _DAC1CON2_R14_LENGTH                                0x1
#define _DAC1CON2_R14_MASK                                  0x40
#define _DAC1CON2_R15_POSN                                  0x7
#define _DAC1CON2_R15_POSITION                              0x7
#define _DAC1CON2_R15_SIZE                                  0x1
#define _DAC1CON2_R15_LENGTH                                0x1
#define _DAC1CON2_R15_MASK                                  0x80
#define _DAC1CON2_DAC1R8_POSN                               0x0
#define _DAC1CON2_DAC1R8_POSITION                           0x0
#define _DAC1CON2_DAC1R8_SIZE                               0x1
#define _DAC1CON2_DAC1R8_LENGTH                             0x1
#define _DAC1CON2_DAC1R8_MASK                               0x1
#define _DAC1CON2_DAC1R9_POSN                               0x1
#define _DAC1CON2_DAC1R9_POSITION                           0x1
#define _DAC1CON2_DAC1R9_SIZE                               0x1
#define _DAC1CON2_DAC1R9_LENGTH                             0x1
#define _DAC1CON2_DAC1R9_MASK                               0x2
#define _DAC1CON2_DAC1R10_POSN                              0x2
#define _DAC1CON2_DAC1R10_POSITION                          0x2
#define _DAC1CON2_DAC1R10_SIZE                              0x1
#define _DAC1CON2_DAC1R10_LENGTH                            0x1
#define _DAC1CON2_DAC1R10_MASK                              0x4
#define _DAC1CON2_DAC1R11_POSN                              0x3
#define _DAC1CON2_DAC1R11_POSITION                          0x3
#define _DAC1CON2_DAC1R11_SIZE                              0x1
#define _DAC1CON2_DAC1R11_LENGTH                            0x1
#define _DAC1CON2_DAC1R11_MASK                              0x8
#define _DAC1CON2_DAC1R12_POSN                              0x4
#define _DAC1CON2_DAC1R12_POSITION                          0x4
#define _DAC1CON2_DAC1R12_SIZE                              0x1
#define _DAC1CON2_DAC1R12_LENGTH                            0x1
#define _DAC1CON2_DAC1R12_MASK                              0x10
#define _DAC1CON2_DAC1R13_POSN                              0x5
#define _DAC1CON2_DAC1R13_POSITION                          0x5
#define _DAC1CON2_DAC1R13_SIZE                              0x1
#define _DAC1CON2_DAC1R13_LENGTH                            0x1
#define _DAC1CON2_DAC1R13_MASK                              0x20
#define _DAC1CON2_DAC1R14_POSN                              0x6
#define _DAC1CON2_DAC1R14_POSITION                          0x6
#define _DAC1CON2_DAC1R14_SIZE                              0x1
#define _DAC1CON2_DAC1R14_LENGTH                            0x1
#define _DAC1CON2_DAC1R14_MASK                              0x40
#define _DAC1CON2_DAC1R15_POSN                              0x7
#define _DAC1CON2_DAC1R15_POSITION                          0x7
#define _DAC1CON2_DAC1R15_SIZE                              0x1
#define _DAC1CON2_DAC1R15_LENGTH                            0x1
#define _DAC1CON2_DAC1R15_MASK                              0x80
#define _DAC1CON2_REF8_POSN                                 0x0
#define _DAC1CON2_REF8_POSITION                             0x0
#define _DAC1CON2_REF8_SIZE                                 0x1
#define _DAC1CON2_REF8_LENGTH                               0x1
#define _DAC1CON2_REF8_MASK                                 0x1
#define _DAC1CON2_REF9_POSN                                 0x1
#define _DAC1CON2_REF9_POSITION                             0x1
#define _DAC1CON2_REF9_SIZE                                 0x1
#define _DAC1CON2_REF9_LENGTH                               0x1
#define _DAC1CON2_REF9_MASK                                 0x2
#define _DAC1CON2_REF10_POSN                                0x2
#define _DAC1CON2_REF10_POSITION                            0x2
#define _DAC1CON2_REF10_SIZE                                0x1
#define _DAC1CON2_REF10_LENGTH                              0x1
#define _DAC1CON2_REF10_MASK                                0x4
#define _DAC1CON2_REF11_POSN                                0x3
#define _DAC1CON2_REF11_POSITION                            0x3
#define _DAC1CON2_REF11_SIZE                                0x1
#define _DAC1CON2_REF11_LENGTH                              0x1
#define _DAC1CON2_REF11_MASK                                0x8
#define _DAC1CON2_REF12_POSN                                0x4
#define _DAC1CON2_REF12_POSITION                            0x4
#define _DAC1CON2_REF12_SIZE                                0x1
#define _DAC1CON2_REF12_LENGTH                              0x1
#define _DAC1CON2_REF12_MASK                                0x10
#define _DAC1CON2_REF13_POSN                                0x5
#define _DAC1CON2_REF13_POSITION                            0x5
#define _DAC1CON2_REF13_SIZE                                0x1
#define _DAC1CON2_REF13_LENGTH                              0x1
#define _DAC1CON2_REF13_MASK                                0x20
#define _DAC1CON2_REF14_POSN                                0x6
#define _DAC1CON2_REF14_POSITION                            0x6
#define _DAC1CON2_REF14_SIZE                                0x1
#define _DAC1CON2_REF14_LENGTH                              0x1
#define _DAC1CON2_REF14_MASK                                0x40
#define _DAC1CON2_REF15_POSN                                0x7
#define _DAC1CON2_REF15_POSITION                            0x7
#define _DAC1CON2_REF15_SIZE                                0x1
#define _DAC1CON2_REF15_LENGTH                              0x1
#define _DAC1CON2_REF15_MASK                                0x80

// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
extern volatile unsigned char           DAC2CON0            __at(0x591);
#ifndef _LIB_BUILD
asm("DAC2CON0 equ 0591h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned FM                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :1;
        unsigned OE                     :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned DACFM                  :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned DACNSS1                :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
        unsigned                        :1;
        unsigned DACOE                  :1;
    };
    struct {
        unsigned DAC2NSS                :2;
        unsigned DAC2PSS                :2;
        unsigned DAC2OE2                :1;
        unsigned DAC2OE1                :1;
        unsigned DAC2FM                 :1;
        unsigned DAC2EN                 :1;
    };
    struct {
        unsigned DAC2NSS0               :1;
        unsigned DAC2NSS1               :1;
        unsigned DAC2PSS0               :1;
        unsigned DAC2PSS1               :1;
    };
} DAC2CON0bits_t;
extern volatile DAC2CON0bits_t DAC2CON0bits __at(0x591);
// bitfield macros
#define _DAC2CON0_NSS_POSN                                  0x0
#define _DAC2CON0_NSS_POSITION                              0x0
#define _DAC2CON0_NSS_SIZE                                  0x2
#define _DAC2CON0_NSS_LENGTH                                0x2
#define _DAC2CON0_NSS_MASK                                  0x3
#define _DAC2CON0_PSS_POSN                                  0x2
#define _DAC2CON0_PSS_POSITION                              0x2
#define _DAC2CON0_PSS_SIZE                                  0x2
#define _DAC2CON0_PSS_LENGTH                                0x2
#define _DAC2CON0_PSS_MASK                                  0xC
#define _DAC2CON0_OE2_POSN                                  0x4
#define _DAC2CON0_OE2_POSITION                              0x4
#define _DAC2CON0_OE2_SIZE                                  0x1
#define _DAC2CON0_OE2_LENGTH                                0x1
#define _DAC2CON0_OE2_MASK                                  0x10
#define _DAC2CON0_OE1_POSN                                  0x5
#define _DAC2CON0_OE1_POSITION                              0x5
#define _DAC2CON0_OE1_SIZE                                  0x1
#define _DAC2CON0_OE1_LENGTH                                0x1
#define _DAC2CON0_OE1_MASK                                  0x20
#define _DAC2CON0_FM_POSN                                   0x6
#define _DAC2CON0_FM_POSITION                               0x6
#define _DAC2CON0_FM_SIZE                                   0x1
#define _DAC2CON0_FM_LENGTH                                 0x1
#define _DAC2CON0_FM_MASK                                   0x40
#define _DAC2CON0_EN_POSN                                   0x7
#define _DAC2CON0_EN_POSITION                               0x7
#define _DAC2CON0_EN_SIZE                                   0x1
#define _DAC2CON0_EN_LENGTH                                 0x1
#define _DAC2CON0_EN_MASK                                   0x80
#define _DAC2CON0_NSS0_POSN                                 0x0
#define _DAC2CON0_NSS0_POSITION                             0x0
#define _DAC2CON0_NSS0_SIZE                                 0x1
#define _DAC2CON0_NSS0_LENGTH                               0x1
#define _DAC2CON0_NSS0_MASK                                 0x1
#define _DAC2CON0_NSS1_POSN                                 0x1
#define _DAC2CON0_NSS1_POSITION                             0x1
#define _DAC2CON0_NSS1_SIZE                                 0x1
#define _DAC2CON0_NSS1_LENGTH                               0x1
#define _DAC2CON0_NSS1_MASK                                 0x2
#define _DAC2CON0_PSS0_POSN                                 0x2
#define _DAC2CON0_PSS0_POSITION                             0x2
#define _DAC2CON0_PSS0_SIZE                                 0x1
#define _DAC2CON0_PSS0_LENGTH                               0x1
#define _DAC2CON0_PSS0_MASK                                 0x4
#define _DAC2CON0_PSS1_POSN                                 0x3
#define _DAC2CON0_PSS1_POSITION                             0x3
#define _DAC2CON0_PSS1_SIZE                                 0x1
#define _DAC2CON0_PSS1_LENGTH                               0x1
#define _DAC2CON0_PSS1_MASK                                 0x8
#define _DAC2CON0_OE_POSN                                   0x5
#define _DAC2CON0_OE_POSITION                               0x5
#define _DAC2CON0_OE_SIZE                                   0x1
#define _DAC2CON0_OE_LENGTH                                 0x1
#define _DAC2CON0_OE_MASK                                   0x20
#define _DAC2CON0_DACNSS_POSN                               0x0
#define _DAC2CON0_DACNSS_POSITION                           0x0
#define _DAC2CON0_DACNSS_SIZE                               0x2
#define _DAC2CON0_DACNSS_LENGTH                             0x2
#define _DAC2CON0_DACNSS_MASK                               0x3
#define _DAC2CON0_DACPSS_POSN                               0x2
#define _DAC2CON0_DACPSS_POSITION                           0x2
#define _DAC2CON0_DACPSS_SIZE                               0x2
#define _DAC2CON0_DACPSS_LENGTH                             0x2
#define _DAC2CON0_DACPSS_MASK                               0xC
#define _DAC2CON0_DACOE2_POSN                               0x4
#define _DAC2CON0_DACOE2_POSITION                           0x4
#define _DAC2CON0_DACOE2_SIZE                               0x1
#define _DAC2CON0_DACOE2_LENGTH                             0x1
#define _DAC2CON0_DACOE2_MASK                               0x10
#define _DAC2CON0_DACOE1_POSN                               0x5
#define _DAC2CON0_DACOE1_POSITION                           0x5
#define _DAC2CON0_DACOE1_SIZE                               0x1
#define _DAC2CON0_DACOE1_LENGTH                             0x1
#define _DAC2CON0_DACOE1_MASK                               0x20
#define _DAC2CON0_DACFM_POSN                                0x6
#define _DAC2CON0_DACFM_POSITION                            0x6
#define _DAC2CON0_DACFM_SIZE                                0x1
#define _DAC2CON0_DACFM_LENGTH                              0x1
#define _DAC2CON0_DACFM_MASK                                0x40
#define _DAC2CON0_DACEN_POSN                                0x7
#define _DAC2CON0_DACEN_POSITION                            0x7
#define _DAC2CON0_DACEN_SIZE                                0x1
#define _DAC2CON0_DACEN_LENGTH                              0x1
#define _DAC2CON0_DACEN_MASK                                0x80
#define _DAC2CON0_DACNSS0_POSN                              0x0
#define _DAC2CON0_DACNSS0_POSITION                          0x0
#define _DAC2CON0_DACNSS0_SIZE                              0x1
#define _DAC2CON0_DACNSS0_LENGTH                            0x1
#define _DAC2CON0_DACNSS0_MASK                              0x1
#define _DAC2CON0_DACNSS1_POSN                              0x1
#define _DAC2CON0_DACNSS1_POSITION                          0x1
#define _DAC2CON0_DACNSS1_SIZE                              0x1
#define _DAC2CON0_DACNSS1_LENGTH                            0x1
#define _DAC2CON0_DACNSS1_MASK                              0x2
#define _DAC2CON0_DACPSS0_POSN                              0x2
#define _DAC2CON0_DACPSS0_POSITION                          0x2
#define _DAC2CON0_DACPSS0_SIZE                              0x1
#define _DAC2CON0_DACPSS0_LENGTH                            0x1
#define _DAC2CON0_DACPSS0_MASK                              0x4
#define _DAC2CON0_DACPSS1_POSN                              0x3
#define _DAC2CON0_DACPSS1_POSITION                          0x3
#define _DAC2CON0_DACPSS1_SIZE                              0x1
#define _DAC2CON0_DACPSS1_LENGTH                            0x1
#define _DAC2CON0_DACPSS1_MASK                              0x8
#define _DAC2CON0_DACOE_POSN                                0x5
#define _DAC2CON0_DACOE_POSITION                            0x5
#define _DAC2CON0_DACOE_SIZE                                0x1
#define _DAC2CON0_DACOE_LENGTH                              0x1
#define _DAC2CON0_DACOE_MASK                                0x20
#define _DAC2CON0_DAC2NSS_POSN                              0x0
#define _DAC2CON0_DAC2NSS_POSITION                          0x0
#define _DAC2CON0_DAC2NSS_SIZE                              0x2
#define _DAC2CON0_DAC2NSS_LENGTH                            0x2
#define _DAC2CON0_DAC2NSS_MASK                              0x3
#define _DAC2CON0_DAC2PSS_POSN                              0x2
#define _DAC2CON0_DAC2PSS_POSITION                          0x2
#define _DAC2CON0_DAC2PSS_SIZE                              0x2
#define _DAC2CON0_DAC2PSS_LENGTH                            0x2
#define _DAC2CON0_DAC2PSS_MASK                              0xC
#define _DAC2CON0_DAC2OE2_POSN                              0x4
#define _DAC2CON0_DAC2OE2_POSITION                          0x4
#define _DAC2CON0_DAC2OE2_SIZE                              0x1
#define _DAC2CON0_DAC2OE2_LENGTH                            0x1
#define _DAC2CON0_DAC2OE2_MASK                              0x10
#define _DAC2CON0_DAC2OE1_POSN                              0x5
#define _DAC2CON0_DAC2OE1_POSITION                          0x5
#define _DAC2CON0_DAC2OE1_SIZE                              0x1
#define _DAC2CON0_DAC2OE1_LENGTH                            0x1
#define _DAC2CON0_DAC2OE1_MASK                              0x20
#define _DAC2CON0_DAC2FM_POSN                               0x6
#define _DAC2CON0_DAC2FM_POSITION                           0x6
#define _DAC2CON0_DAC2FM_SIZE                               0x1
#define _DAC2CON0_DAC2FM_LENGTH                             0x1
#define _DAC2CON0_DAC2FM_MASK                               0x40
#define _DAC2CON0_DAC2EN_POSN                               0x7
#define _DAC2CON0_DAC2EN_POSITION                           0x7
#define _DAC2CON0_DAC2EN_SIZE                               0x1
#define _DAC2CON0_DAC2EN_LENGTH                             0x1
#define _DAC2CON0_DAC2EN_MASK                               0x80
#define _DAC2CON0_DAC2NSS0_POSN                             0x0
#define _DAC2CON0_DAC2NSS0_POSITION                         0x0
#define _DAC2CON0_DAC2NSS0_SIZE                             0x1
#define _DAC2CON0_DAC2NSS0_LENGTH                           0x1
#define _DAC2CON0_DAC2NSS0_MASK                             0x1
#define _DAC2CON0_DAC2NSS1_POSN                             0x1
#define _DAC2CON0_DAC2NSS1_POSITION                         0x1
#define _DAC2CON0_DAC2NSS1_SIZE                             0x1
#define _DAC2CON0_DAC2NSS1_LENGTH                           0x1
#define _DAC2CON0_DAC2NSS1_MASK                             0x2
#define _DAC2CON0_DAC2PSS0_POSN                             0x2
#define _DAC2CON0_DAC2PSS0_POSITION                         0x2
#define _DAC2CON0_DAC2PSS0_SIZE                             0x1
#define _DAC2CON0_DAC2PSS0_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS0_MASK                             0x4
#define _DAC2CON0_DAC2PSS1_POSN                             0x3
#define _DAC2CON0_DAC2PSS1_POSITION                         0x3
#define _DAC2CON0_DAC2PSS1_SIZE                             0x1
#define _DAC2CON0_DAC2PSS1_LENGTH                           0x1
#define _DAC2CON0_DAC2PSS1_MASK                             0x8

// Register: DAC2REF
#define DAC2REF DAC2REF
extern volatile unsigned short          DAC2REF             __at(0x592);
#ifndef _LIB_BUILD
asm("DAC2REF equ 0592h");
#endif

