MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: DAC5REF
#define DAC5REF DAC5REF
extern volatile unsigned short          DAC5REF             __at(0x599);
#ifndef _LIB_BUILD
asm("DAC5REF equ 0599h");
#endif

// Register: DAC5REFL
#define DAC5REFL DAC5REFL
extern volatile unsigned char           DAC5REFL            __at(0x599);
#ifndef _LIB_BUILD
asm("DAC5REFL equ 0599h");
#endif
// aliases
extern volatile unsigned char           DAC5CON1            __at(0x599);
#ifndef _LIB_BUILD
asm("DAC5CON1 equ 0599h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC5REF0               :1;
        unsigned DAC5REF1               :1;
        unsigned DAC5REF2               :1;
        unsigned DAC5REF3               :1;
        unsigned DAC5REF4               :1;
        unsigned DAC5REF5               :1;
        unsigned DAC5REF6               :1;
        unsigned DAC5REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC5R0                 :1;
        unsigned DAC5R1                 :1;
        unsigned DAC5R2                 :1;
        unsigned DAC5R3                 :1;
        unsigned DAC5R4                 :1;
        unsigned DAC5R5                 :1;
        unsigned DAC5R6                 :1;
        unsigned DAC5R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC5REFLbits_t;
extern volatile DAC5REFLbits_t DAC5REFLbits __at(0x599);
// bitfield macros
#define _DAC5REFL_REF_POSN                                  0x0
#define _DAC5REFL_REF_POSITION                              0x0
#define _DAC5REFL_REF_SIZE                                  0x8
#define _DAC5REFL_REF_LENGTH                                0x8
#define _DAC5REFL_REF_MASK                                  0xFF
#define _DAC5REFL_DAC5REF0_POSN                             0x0
#define _DAC5REFL_DAC5REF0_POSITION                         0x0
#define _DAC5REFL_DAC5REF0_SIZE                             0x1
#define _DAC5REFL_DAC5REF0_LENGTH                           0x1
#define _DAC5REFL_DAC5REF0_MASK                             0x1
#define _DAC5REFL_DAC5REF1_POSN                             0x1
#define _DAC5REFL_DAC5REF1_POSITION                         0x1
#define _DAC5REFL_DAC5REF1_SIZE                             0x1
#define _DAC5REFL_DAC5REF1_LENGTH                           0x1
#define _DAC5REFL_DAC5REF1_MASK                             0x2
#define _DAC5REFL_DAC5REF2_POSN                             0x2
#define _DAC5REFL_DAC5REF2_POSITION                         0x2
#define _DAC5REFL_DAC5REF2_SIZE                             0x1
#define _DAC5REFL_DAC5REF2_LENGTH                           0x1
#define _DAC5REFL_DAC5REF2_MASK                             0x4
#define _DAC5REFL_DAC5REF3_POSN                             0x3
#define _DAC5REFL_DAC5REF3_POSITION                         0x3
#define _DAC5REFL_DAC5REF3_SIZE                             0x1
#define _DAC5REFL_DAC5REF3_LENGTH                           0x1
#define _DAC5REFL_DAC5REF3_MASK                             0x8
#define _DAC5REFL_DAC5REF4_POSN                             0x4
#define _DAC5REFL_DAC5REF4_POSITION                         0x4
#define _DAC5REFL_DAC5REF4_SIZE                             0x1
#define _DAC5REFL_DAC5REF4_LENGTH                           0x1
#define _DAC5REFL_DAC5REF4_MASK                             0x10
#define _DAC5REFL_DAC5REF5_POSN                             0x5
#define _DAC5REFL_DAC5REF5_POSITION                         0x5
#define _DAC5REFL_DAC5REF5_SIZE                             0x1
#define _DAC5REFL_DAC5REF5_LENGTH                           0x1
#define _DAC5REFL_DAC5REF5_MASK                             0x20
#define _DAC5REFL_DAC5REF6_POSN                             0x6
#define _DAC5REFL_DAC5REF6_POSITION                         0x6
#define _DAC5REFL_DAC5REF6_SIZE                             0x1
#define _DAC5REFL_DAC5REF6_LENGTH                           0x1
#define _DAC5REFL_DAC5REF6_MASK                             0x40
#define _DAC5REFL_DAC5REF7_POSN                             0x7
#define _DAC5REFL_DAC5REF7_POSITION                         0x7
#define _DAC5REFL_DAC5REF7_SIZE                             0x1
#define _DAC5REFL_DAC5REF7_LENGTH                           0x1
#define _DAC5REFL_DAC5REF7_MASK                             0x80
#define _DAC5REFL_R0_POSN                                   0x0
#define _DAC5REFL_R0_POSITION                               0x0
#define _DAC5REFL_R0_SIZE                                   0x1
#define _DAC5REFL_R0_LENGTH                                 0x1
#define _DAC5REFL_R0_MASK                                   0x1
#define _DAC5REFL_R1_POSN                                   0x1
#define _DAC5REFL_R1_POSITION                               0x1
#define _DAC5REFL_R1_SIZE                                   0x1
#define _DAC5REFL_R1_LENGTH                                 0x1
#define _DAC5REFL_R1_MASK                                   0x2
#define _DAC5REFL_R2_POSN                                   0x2
#define _DAC5REFL_R2_POSITION                               0x2
#define _DAC5REFL_R2_SIZE                                   0x1
#define _DAC5REFL_R2_LENGTH                                 0x1
#define _DAC5REFL_R2_MASK                                   0x4
#define _DAC5REFL_R3_POSN                                   0x3
#define _DAC5REFL_R3_POSITION                               0x3
#define _DAC5REFL_R3_SIZE                                   0x1
#define _DAC5REFL_R3_LENGTH                                 0x1
#define _DAC5REFL_R3_MASK                                   0x8
#define _DAC5REFL_R4_POSN                                   0x4
#define _DAC5REFL_R4_POSITION                               0x4
#define _DAC5REFL_R4_SIZE                                   0x1
#define _DAC5REFL_R4_LENGTH                                 0x1
#define _DAC5REFL_R4_MASK                                   0x10
#define _DAC5REFL_R5_POSN                                   0x5
#define _DAC5REFL_R5_POSITION                               0x5
#define _DAC5REFL_R5_SIZE                                   0x1
#define _DAC5REFL_R5_LENGTH                                 0x1
#define _DAC5REFL_R5_MASK                                   0x20
#define _DAC5REFL_R6_POSN                                   0x6
#define _DAC5REFL_R6_POSITION                               0x6
#define _DAC5REFL_R6_SIZE                                   0x1
#define _DAC5REFL_R6_LENGTH                                 0x1
#define _DAC5REFL_R6_MASK                                   0x40
#define _DAC5REFL_R7_POSN                                   0x7
#define _DAC5REFL_R7_POSITION                               0x7
#define _DAC5REFL_R7_SIZE                                   0x1
#define _DAC5REFL_R7_LENGTH                                 0x1
#define _DAC5REFL_R7_MASK                                   0x80
#define _DAC5REFL_DAC5R0_POSN                               0x0
#define _DAC5REFL_DAC5R0_POSITION                           0x0
#define _DAC5REFL_DAC5R0_SIZE                               0x1
#define _DAC5REFL_DAC5R0_LENGTH                             0x1
#define _DAC5REFL_DAC5R0_MASK                               0x1
#define _DAC5REFL_DAC5R1_POSN                               0x1
#define _DAC5REFL_DAC5R1_POSITION                           0x1
#define _DAC5REFL_DAC5R1_SIZE                               0x1
#define _DAC5REFL_DAC5R1_LENGTH                             0x1
#define _DAC5REFL_DAC5R1_MASK                               0x2
#define _DAC5REFL_DAC5R2_POSN                               0x2
#define _DAC5REFL_DAC5R2_POSITION                           0x2
#define _DAC5REFL_DAC5R2_SIZE                               0x1
#define _DAC5REFL_DAC5R2_LENGTH                             0x1
#define _DAC5REFL_DAC5R2_MASK                               0x4
#define _DAC5REFL_DAC5R3_POSN                               0x3
#define _DAC5REFL_DAC5R3_POSITION                           0x3
#define _DAC5REFL_DAC5R3_SIZE                               0x1
#define _DAC5REFL_DAC5R3_LENGTH                             0x1
#define _DAC5REFL_DAC5R3_MASK                               0x8
#define _DAC5REFL_DAC5R4_POSN                               0x4
#define _DAC5REFL_DAC5R4_POSITION                           0x4
#define _DAC5REFL_DAC5R4_SIZE                               0x1
#define _DAC5REFL_DAC5R4_LENGTH                             0x1
#define _DAC5REFL_DAC5R4_MASK                               0x10
#define _DAC5REFL_DAC5R5_POSN                               0x5
#define _DAC5REFL_DAC5R5_POSITION                           0x5
#define _DAC5REFL_DAC5R5_SIZE                               0x1
#define _DAC5REFL_DAC5R5_LENGTH                             0x1
#define _DAC5REFL_DAC5R5_MASK                               0x20
#define _DAC5REFL_DAC5R6_POSN                               0x6
#define _DAC5REFL_DAC5R6_POSITION                           0x6
#define _DAC5REFL_DAC5R6_SIZE                               0x1
#define _DAC5REFL_DAC5R6_LENGTH                             0x1
#define _DAC5REFL_DAC5R6_MASK                               0x40
#define _DAC5REFL_DAC5R7_POSN                               0x7
#define _DAC5REFL_DAC5R7_POSITION                           0x7
#define _DAC5REFL_DAC5R7_SIZE                               0x1
#define _DAC5REFL_DAC5R7_LENGTH                             0x1
#define _DAC5REFL_DAC5R7_MASK                               0x80
#define _DAC5REFL_REF0_POSN                                 0x0
#define _DAC5REFL_REF0_POSITION                             0x0
#define _DAC5REFL_REF0_SIZE                                 0x1
#define _DAC5REFL_REF0_LENGTH                               0x1
#define _DAC5REFL_REF0_MASK                                 0x1
#define _DAC5REFL_REF1_POSN                                 0x1
#define _DAC5REFL_REF1_POSITION                             0x1
#define _DAC5REFL_REF1_SIZE                                 0x1
#define _DAC5REFL_REF1_LENGTH                               0x1
#define _DAC5REFL_REF1_MASK                                 0x2
#define _DAC5REFL_REF2_POSN                                 0x2
#define _DAC5REFL_REF2_POSITION                             0x2
#define _DAC5REFL_REF2_SIZE                                 0x1
#define _DAC5REFL_REF2_LENGTH                               0x1
#define _DAC5REFL_REF2_MASK                                 0x4
#define _DAC5REFL_REF3_POSN                                 0x3
#define _DAC5REFL_REF3_POSITION                             0x3
#define _DAC5REFL_REF3_SIZE                                 0x1
#define _DAC5REFL_REF3_LENGTH                               0x1
#define _DAC5REFL_REF3_MASK                                 0x8
#define _DAC5REFL_REF4_POSN                                 0x4
#define _DAC5REFL_REF4_POSITION                             0x4
#define _DAC5REFL_REF4_SIZE                                 0x1
#define _DAC5REFL_REF4_LENGTH                               0x1
#define _DAC5REFL_REF4_MASK                                 0x10
#define _DAC5REFL_REF5_POSN                                 0x5
#define _DAC5REFL_REF5_POSITION                             0x5
#define _DAC5REFL_REF5_SIZE                                 0x1
#define _DAC5REFL_REF5_LENGTH                               0x1
#define _DAC5REFL_REF5_MASK                                 0x20
#define _DAC5REFL_REF6_POSN                                 0x6
#define _DAC5REFL_REF6_POSITION                             0x6
#define _DAC5REFL_REF6_SIZE                                 0x1
#define _DAC5REFL_REF6_LENGTH                               0x1
#define _DAC5REFL_REF6_MASK                                 0x40
#define _DAC5REFL_REF7_POSN                                 0x7
#define _DAC5REFL_REF7_POSITION                             0x7
#define _DAC5REFL_REF7_SIZE                                 0x1
#define _DAC5REFL_REF7_LENGTH                               0x1
#define _DAC5REFL_REF7_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC5REF0               :1;
        unsigned DAC5REF1               :1;
        unsigned DAC5REF2               :1;
        unsigned DAC5REF3               :1;
        unsigned DAC5REF4               :1;
        unsigned DAC5REF5               :1;
        unsigned DAC5REF6               :1;
        unsigned DAC5REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC5R0                 :1;
        unsigned DAC5R1                 :1;
        unsigned DAC5R2                 :1;
        unsigned DAC5R3                 :1;
        unsigned DAC5R4                 :1;
        unsigned DAC5R5                 :1;
        unsigned DAC5R6                 :1;
        unsigned DAC5R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC5CON1bits_t;
