MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: DAC6REFL
#define DAC6REFL DAC6REFL
extern volatile unsigned char           DAC6REFL            __at(0x59C);
#ifndef _LIB_BUILD
asm("DAC6REFL equ 059Ch");
#endif
// aliases
extern volatile unsigned char           DAC6CON1            __at(0x59C);
#ifndef _LIB_BUILD
asm("DAC6CON1 equ 059Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC6REF0               :1;
        unsigned DAC6REF1               :1;
        unsigned DAC6REF2               :1;
        unsigned DAC6REF3               :1;
        unsigned DAC6REF4               :1;
        unsigned DAC6REF5               :1;
        unsigned DAC6REF6               :1;
        unsigned DAC6REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC6R0                 :1;
        unsigned DAC6R1                 :1;
        unsigned DAC6R2                 :1;
        unsigned DAC6R3                 :1;
        unsigned DAC6R4                 :1;
        unsigned DAC6R5                 :1;
        unsigned DAC6R6                 :1;
        unsigned DAC6R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC6REFLbits_t;
extern volatile DAC6REFLbits_t DAC6REFLbits __at(0x59C);
// bitfield macros
#define _DAC6REFL_REF_POSN                                  0x0
#define _DAC6REFL_REF_POSITION                              0x0
#define _DAC6REFL_REF_SIZE                                  0x8
#define _DAC6REFL_REF_LENGTH                                0x8
#define _DAC6REFL_REF_MASK                                  0xFF
#define _DAC6REFL_DAC6REF0_POSN                             0x0
#define _DAC6REFL_DAC6REF0_POSITION                         0x0
#define _DAC6REFL_DAC6REF0_SIZE                             0x1
#define _DAC6REFL_DAC6REF0_LENGTH                           0x1
#define _DAC6REFL_DAC6REF0_MASK                             0x1
#define _DAC6REFL_DAC6REF1_POSN                             0x1
#define _DAC6REFL_DAC6REF1_POSITION                         0x1
#define _DAC6REFL_DAC6REF1_SIZE                             0x1
#define _DAC6REFL_DAC6REF1_LENGTH                           0x1
#define _DAC6REFL_DAC6REF1_MASK                             0x2
#define _DAC6REFL_DAC6REF2_POSN                             0x2
#define _DAC6REFL_DAC6REF2_POSITION                         0x2
#define _DAC6REFL_DAC6REF2_SIZE                             0x1
#define _DAC6REFL_DAC6REF2_LENGTH                           0x1
#define _DAC6REFL_DAC6REF2_MASK                             0x4
#define _DAC6REFL_DAC6REF3_POSN                             0x3
#define _DAC6REFL_DAC6REF3_POSITION                         0x3
#define _DAC6REFL_DAC6REF3_SIZE                             0x1
#define _DAC6REFL_DAC6REF3_LENGTH                           0x1
#define _DAC6REFL_DAC6REF3_MASK                             0x8
#define _DAC6REFL_DAC6REF4_POSN                             0x4
#define _DAC6REFL_DAC6REF4_POSITION                         0x4
#define _DAC6REFL_DAC6REF4_SIZE                             0x1
#define _DAC6REFL_DAC6REF4_LENGTH                           0x1
#define _DAC6REFL_DAC6REF4_MASK                             0x10
#define _DAC6REFL_DAC6REF5_POSN                             0x5
#define _DAC6REFL_DAC6REF5_POSITION                         0x5
#define _DAC6REFL_DAC6REF5_SIZE                             0x1
#define _DAC6REFL_DAC6REF5_LENGTH                           0x1
#define _DAC6REFL_DAC6REF5_MASK                             0x20
#define _DAC6REFL_DAC6REF6_POSN                             0x6
#define _DAC6REFL_DAC6REF6_POSITION                         0x6
#define _DAC6REFL_DAC6REF6_SIZE                             0x1
#define _DAC6REFL_DAC6REF6_LENGTH                           0x1
#define _DAC6REFL_DAC6REF6_MASK                             0x40
#define _DAC6REFL_DAC6REF7_POSN                             0x7
#define _DAC6REFL_DAC6REF7_POSITION                         0x7
#define _DAC6REFL_DAC6REF7_SIZE                             0x1
#define _DAC6REFL_DAC6REF7_LENGTH                           0x1
#define _DAC6REFL_DAC6REF7_MASK                             0x80
#define _DAC6REFL_R0_POSN                                   0x0
#define _DAC6REFL_R0_POSITION                               0x0
#define _DAC6REFL_R0_SIZE                                   0x1
#define _DAC6REFL_R0_LENGTH                                 0x1
#define _DAC6REFL_R0_MASK                                   0x1
#define _DAC6REFL_R1_POSN                                   0x1
#define _DAC6REFL_R1_POSITION                               0x1
#define _DAC6REFL_R1_SIZE                                   0x1
#define _DAC6REFL_R1_LENGTH                                 0x1
#define _DAC6REFL_R1_MASK                                   0x2
#define _DAC6REFL_R2_POSN                                   0x2
#define _DAC6REFL_R2_POSITION                               0x2
#define _DAC6REFL_R2_SIZE                                   0x1
#define _DAC6REFL_R2_LENGTH                                 0x1
#define _DAC6REFL_R2_MASK                                   0x4
#define _DAC6REFL_R3_POSN                                   0x3
#define _DAC6REFL_R3_POSITION                               0x3
#define _DAC6REFL_R3_SIZE                                   0x1
#define _DAC6REFL_R3_LENGTH                                 0x1
#define _DAC6REFL_R3_MASK                                   0x8
#define _DAC6REFL_R4_POSN                                   0x4
#define _DAC6REFL_R4_POSITION                               0x4
#define _DAC6REFL_R4_SIZE                                   0x1
#define _DAC6REFL_R4_LENGTH                                 0x1
#define _DAC6REFL_R4_MASK                                   0x10
#define _DAC6REFL_R5_POSN                                   0x5
#define _DAC6REFL_R5_POSITION                               0x5
#define _DAC6REFL_R5_SIZE                                   0x1
#define _DAC6REFL_R5_LENGTH                                 0x1
#define _DAC6REFL_R5_MASK                                   0x20
#define _DAC6REFL_R6_POSN                                   0x6
#define _DAC6REFL_R6_POSITION                               0x6
#define _DAC6REFL_R6_SIZE                                   0x1
#define _DAC6REFL_R6_LENGTH                                 0x1
#define _DAC6REFL_R6_MASK                                   0x40
#define _DAC6REFL_R7_POSN                                   0x7
#define _DAC6REFL_R7_POSITION                               0x7
#define _DAC6REFL_R7_SIZE                                   0x1
#define _DAC6REFL_R7_LENGTH                                 0x1
#define _DAC6REFL_R7_MASK                                   0x80
#define _DAC6REFL_DAC6R0_POSN                               0x0
#define _DAC6REFL_DAC6R0_POSITION                           0x0
#define _DAC6REFL_DAC6R0_SIZE                               0x1
#define _DAC6REFL_DAC6R0_LENGTH                             0x1
#define _DAC6REFL_DAC6R0_MASK                               0x1
#define _DAC6REFL_DAC6R1_POSN                               0x1
#define _DAC6REFL_DAC6R1_POSITION                           0x1
#define _DAC6REFL_DAC6R1_SIZE                               0x1
#define _DAC6REFL_DAC6R1_LENGTH                             0x1
#define _DAC6REFL_DAC6R1_MASK                               0x2
#define _DAC6REFL_DAC6R2_POSN                               0x2
#define _DAC6REFL_DAC6R2_POSITION                           0x2
#define _DAC6REFL_DAC6R2_SIZE                               0x1
#define _DAC6REFL_DAC6R2_LENGTH                             0x1
#define _DAC6REFL_DAC6R2_MASK                               0x4
#define _DAC6REFL_DAC6R3_POSN                               0x3
#define _DAC6REFL_DAC6R3_POSITION                           0x3
#define _DAC6REFL_DAC6R3_SIZE                               0x1
#define _DAC6REFL_DAC6R3_LENGTH                             0x1
#define _DAC6REFL_DAC6R3_MASK                               0x8
#define _DAC6REFL_DAC6R4_POSN                               0x4
#define _DAC6REFL_DAC6R4_POSITION                           0x4
#define _DAC6REFL_DAC6R4_SIZE                               0x1
#define _DAC6REFL_DAC6R4_LENGTH                             0x1
#define _DAC6REFL_DAC6R4_MASK                               0x10
#define _DAC6REFL_DAC6R5_POSN                               0x5
#define _DAC6REFL_DAC6R5_POSITION                           0x5
#define _DAC6REFL_DAC6R5_SIZE                               0x1
#define _DAC6REFL_DAC6R5_LENGTH                             0x1
#define _DAC6REFL_DAC6R5_MASK                               0x20
#define _DAC6REFL_DAC6R6_POSN                               0x6
#define _DAC6REFL_DAC6R6_POSITION                           0x6
#define _DAC6REFL_DAC6R6_SIZE                               0x1
#define _DAC6REFL_DAC6R6_LENGTH                             0x1
#define _DAC6REFL_DAC6R6_MASK                               0x40
#define _DAC6REFL_DAC6R7_POSN                               0x7
#define _DAC6REFL_DAC6R7_POSITION                           0x7
#define _DAC6REFL_DAC6R7_SIZE                               0x1
#define _DAC6REFL_DAC6R7_LENGTH                             0x1
#define _DAC6REFL_DAC6R7_MASK                               0x80
#define _DAC6REFL_REF0_POSN                                 0x0
#define _DAC6REFL_REF0_POSITION                             0x0
#define _DAC6REFL_REF0_SIZE                                 0x1
#define _DAC6REFL_REF0_LENGTH                               0x1
#define _DAC6REFL_REF0_MASK                                 0x1
#define _DAC6REFL_REF1_POSN                                 0x1
#define _DAC6REFL_REF1_POSITION                             0x1
#define _DAC6REFL_REF1_SIZE                                 0x1
#define _DAC6REFL_REF1_LENGTH                               0x1
#define _DAC6REFL_REF1_MASK                                 0x2
#define _DAC6REFL_REF2_POSN                                 0x2
#define _DAC6REFL_REF2_POSITION                             0x2
#define _DAC6REFL_REF2_SIZE                                 0x1
#define _DAC6REFL_REF2_LENGTH                               0x1
#define _DAC6REFL_REF2_MASK                                 0x4
#define _DAC6REFL_REF3_POSN                                 0x3
#define _DAC6REFL_REF3_POSITION                             0x3
#define _DAC6REFL_REF3_SIZE                                 0x1
#define _DAC6REFL_REF3_LENGTH                               0x1
#define _DAC6REFL_REF3_MASK                                 0x8
#define _DAC6REFL_REF4_POSN                                 0x4
#define _DAC6REFL_REF4_POSITION                             0x4
#define _DAC6REFL_REF4_SIZE                                 0x1
#define _DAC6REFL_REF4_LENGTH                               0x1
#define _DAC6REFL_REF4_MASK                                 0x10
#define _DAC6REFL_REF5_POSN                                 0x5
#define _DAC6REFL_REF5_POSITION                             0x5
#define _DAC6REFL_REF5_SIZE                                 0x1
#define _DAC6REFL_REF5_LENGTH                               0x1
#define _DAC6REFL_REF5_MASK                                 0x20
#define _DAC6REFL_REF6_POSN                                 0x6
#define _DAC6REFL_REF6_POSITION                             0x6
#define _DAC6REFL_REF6_SIZE                                 0x1
#define _DAC6REFL_REF6_LENGTH                               0x1
#define _DAC6REFL_REF6_MASK                                 0x40
#define _DAC6REFL_REF7_POSN                                 0x7
#define _DAC6REFL_REF7_POSITION                             0x7
#define _DAC6REFL_REF7_SIZE                                 0x1
#define _DAC6REFL_REF7_LENGTH                               0x1
#define _DAC6REFL_REF7_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC6REF0               :1;
        unsigned DAC6REF1               :1;
        unsigned DAC6REF2               :1;
        unsigned DAC6REF3               :1;
        unsigned DAC6REF4               :1;
        unsigned DAC6REF5               :1;
        unsigned DAC6REF6               :1;
        unsigned DAC6REF7               :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
        unsigned R5                     :1;
        unsigned R6                     :1;
        unsigned R7                     :1;
    };
    struct {
        unsigned DAC6R0                 :1;
        unsigned DAC6R1                 :1;
        unsigned DAC6R2                 :1;
        unsigned DAC6R3                 :1;
        unsigned DAC6R4                 :1;
        unsigned DAC6R5                 :1;
        unsigned DAC6R6                 :1;
        unsigned DAC6R7                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
        unsigned REF5                   :1;
        unsigned REF6                   :1;
        unsigned REF7                   :1;
    };
} DAC6CON1bits_t;
