MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile DAC6CON1bits_t DAC6CON1bits __at(0x59C);
// bitfield macros
#define _DAC6CON1_REF_POSN                                  0x0
#define _DAC6CON1_REF_POSITION                              0x0
#define _DAC6CON1_REF_SIZE                                  0x8
#define _DAC6CON1_REF_LENGTH                                0x8
#define _DAC6CON1_REF_MASK                                  0xFF
#define _DAC6CON1_DAC6REF0_POSN                             0x0
#define _DAC6CON1_DAC6REF0_POSITION                         0x0
#define _DAC6CON1_DAC6REF0_SIZE                             0x1
#define _DAC6CON1_DAC6REF0_LENGTH                           0x1
#define _DAC6CON1_DAC6REF0_MASK                             0x1
#define _DAC6CON1_DAC6REF1_POSN                             0x1
#define _DAC6CON1_DAC6REF1_POSITION                         0x1
#define _DAC6CON1_DAC6REF1_SIZE                             0x1
#define _DAC6CON1_DAC6REF1_LENGTH                           0x1
#define _DAC6CON1_DAC6REF1_MASK                             0x2
#define _DAC6CON1_DAC6REF2_POSN                             0x2
#define _DAC6CON1_DAC6REF2_POSITION                         0x2
#define _DAC6CON1_DAC6REF2_SIZE                             0x1
#define _DAC6CON1_DAC6REF2_LENGTH                           0x1
#define _DAC6CON1_DAC6REF2_MASK                             0x4
#define _DAC6CON1_DAC6REF3_POSN                             0x3
#define _DAC6CON1_DAC6REF3_POSITION                         0x3
#define _DAC6CON1_DAC6REF3_SIZE                             0x1
#define _DAC6CON1_DAC6REF3_LENGTH                           0x1
#define _DAC6CON1_DAC6REF3_MASK                             0x8
#define _DAC6CON1_DAC6REF4_POSN                             0x4
#define _DAC6CON1_DAC6REF4_POSITION                         0x4
#define _DAC6CON1_DAC6REF4_SIZE                             0x1
#define _DAC6CON1_DAC6REF4_LENGTH                           0x1
#define _DAC6CON1_DAC6REF4_MASK                             0x10
#define _DAC6CON1_DAC6REF5_POSN                             0x5
#define _DAC6CON1_DAC6REF5_POSITION                         0x5
#define _DAC6CON1_DAC6REF5_SIZE                             0x1
#define _DAC6CON1_DAC6REF5_LENGTH                           0x1
#define _DAC6CON1_DAC6REF5_MASK                             0x20
#define _DAC6CON1_DAC6REF6_POSN                             0x6
#define _DAC6CON1_DAC6REF6_POSITION                         0x6
#define _DAC6CON1_DAC6REF6_SIZE                             0x1
#define _DAC6CON1_DAC6REF6_LENGTH                           0x1
#define _DAC6CON1_DAC6REF6_MASK                             0x40
#define _DAC6CON1_DAC6REF7_POSN                             0x7
#define _DAC6CON1_DAC6REF7_POSITION                         0x7
#define _DAC6CON1_DAC6REF7_SIZE                             0x1
#define _DAC6CON1_DAC6REF7_LENGTH                           0x1
#define _DAC6CON1_DAC6REF7_MASK                             0x80
#define _DAC6CON1_R0_POSN                                   0x0
#define _DAC6CON1_R0_POSITION                               0x0
#define _DAC6CON1_R0_SIZE                                   0x1
#define _DAC6CON1_R0_LENGTH                                 0x1
#define _DAC6CON1_R0_MASK                                   0x1
#define _DAC6CON1_R1_POSN                                   0x1
#define _DAC6CON1_R1_POSITION                               0x1
#define _DAC6CON1_R1_SIZE                                   0x1
#define _DAC6CON1_R1_LENGTH                                 0x1
#define _DAC6CON1_R1_MASK                                   0x2
#define _DAC6CON1_R2_POSN                                   0x2
#define _DAC6CON1_R2_POSITION                               0x2
#define _DAC6CON1_R2_SIZE                                   0x1
#define _DAC6CON1_R2_LENGTH                                 0x1
#define _DAC6CON1_R2_MASK                                   0x4
#define _DAC6CON1_R3_POSN                                   0x3
#define _DAC6CON1_R3_POSITION                               0x3
#define _DAC6CON1_R3_SIZE                                   0x1
#define _DAC6CON1_R3_LENGTH                                 0x1
#define _DAC6CON1_R3_MASK                                   0x8
#define _DAC6CON1_R4_POSN                                   0x4
#define _DAC6CON1_R4_POSITION                               0x4
#define _DAC6CON1_R4_SIZE                                   0x1
#define _DAC6CON1_R4_LENGTH                                 0x1
#define _DAC6CON1_R4_MASK                                   0x10
#define _DAC6CON1_R5_POSN                                   0x5
#define _DAC6CON1_R5_POSITION                               0x5
#define _DAC6CON1_R5_SIZE                                   0x1
#define _DAC6CON1_R5_LENGTH                                 0x1
#define _DAC6CON1_R5_MASK                                   0x20
#define _DAC6CON1_R6_POSN                                   0x6
#define _DAC6CON1_R6_POSITION                               0x6
#define _DAC6CON1_R6_SIZE                                   0x1
#define _DAC6CON1_R6_LENGTH                                 0x1
#define _DAC6CON1_R6_MASK                                   0x40
#define _DAC6CON1_R7_POSN                                   0x7
#define _DAC6CON1_R7_POSITION                               0x7
#define _DAC6CON1_R7_SIZE                                   0x1
#define _DAC6CON1_R7_LENGTH                                 0x1
#define _DAC6CON1_R7_MASK                                   0x80
#define _DAC6CON1_DAC6R0_POSN                               0x0
#define _DAC6CON1_DAC6R0_POSITION                           0x0
#define _DAC6CON1_DAC6R0_SIZE                               0x1
#define _DAC6CON1_DAC6R0_LENGTH                             0x1
#define _DAC6CON1_DAC6R0_MASK                               0x1
#define _DAC6CON1_DAC6R1_POSN                               0x1
#define _DAC6CON1_DAC6R1_POSITION                           0x1
#define _DAC6CON1_DAC6R1_SIZE                               0x1
#define _DAC6CON1_DAC6R1_LENGTH                             0x1
#define _DAC6CON1_DAC6R1_MASK                               0x2
#define _DAC6CON1_DAC6R2_POSN                               0x2
#define _DAC6CON1_DAC6R2_POSITION                           0x2
#define _DAC6CON1_DAC6R2_SIZE                               0x1
#define _DAC6CON1_DAC6R2_LENGTH                             0x1
#define _DAC6CON1_DAC6R2_MASK                               0x4
#define _DAC6CON1_DAC6R3_POSN                               0x3
#define _DAC6CON1_DAC6R3_POSITION                           0x3
#define _DAC6CON1_DAC6R3_SIZE                               0x1
#define _DAC6CON1_DAC6R3_LENGTH                             0x1
#define _DAC6CON1_DAC6R3_MASK                               0x8
#define _DAC6CON1_DAC6R4_POSN                               0x4
#define _DAC6CON1_DAC6R4_POSITION                           0x4
#define _DAC6CON1_DAC6R4_SIZE                               0x1
#define _DAC6CON1_DAC6R4_LENGTH                             0x1
#define _DAC6CON1_DAC6R4_MASK                               0x10
#define _DAC6CON1_DAC6R5_POSN                               0x5
#define _DAC6CON1_DAC6R5_POSITION                           0x5
#define _DAC6CON1_DAC6R5_SIZE                               0x1
#define _DAC6CON1_DAC6R5_LENGTH                             0x1
#define _DAC6CON1_DAC6R5_MASK                               0x20
#define _DAC6CON1_DAC6R6_POSN                               0x6
#define _DAC6CON1_DAC6R6_POSITION                           0x6
#define _DAC6CON1_DAC6R6_SIZE                               0x1
#define _DAC6CON1_DAC6R6_LENGTH                             0x1
#define _DAC6CON1_DAC6R6_MASK                               0x40
#define _DAC6CON1_DAC6R7_POSN                               0x7
#define _DAC6CON1_DAC6R7_POSITION                           0x7
#define _DAC6CON1_DAC6R7_SIZE                               0x1
#define _DAC6CON1_DAC6R7_LENGTH                             0x1
#define _DAC6CON1_DAC6R7_MASK                               0x80
#define _DAC6CON1_REF0_POSN                                 0x0
#define _DAC6CON1_REF0_POSITION                             0x0
#define _DAC6CON1_REF0_SIZE                                 0x1
#define _DAC6CON1_REF0_LENGTH                               0x1
#define _DAC6CON1_REF0_MASK                                 0x1
#define _DAC6CON1_REF1_POSN                                 0x1
#define _DAC6CON1_REF1_POSITION                             0x1
#define _DAC6CON1_REF1_SIZE                                 0x1
#define _DAC6CON1_REF1_LENGTH                               0x1
#define _DAC6CON1_REF1_MASK                                 0x2
#define _DAC6CON1_REF2_POSN                                 0x2
#define _DAC6CON1_REF2_POSITION                             0x2
#define _DAC6CON1_REF2_SIZE                                 0x1
#define _DAC6CON1_REF2_LENGTH                               0x1
#define _DAC6CON1_REF2_MASK                                 0x4
#define _DAC6CON1_REF3_POSN                                 0x3
#define _DAC6CON1_REF3_POSITION                             0x3
#define _DAC6CON1_REF3_SIZE                                 0x1
#define _DAC6CON1_REF3_LENGTH                               0x1
#define _DAC6CON1_REF3_MASK                                 0x8
#define _DAC6CON1_REF4_POSN                                 0x4
#define _DAC6CON1_REF4_POSITION                             0x4
#define _DAC6CON1_REF4_SIZE                                 0x1
#define _DAC6CON1_REF4_LENGTH                               0x1
#define _DAC6CON1_REF4_MASK                                 0x10
#define _DAC6CON1_REF5_POSN                                 0x5
#define _DAC6CON1_REF5_POSITION                             0x5
#define _DAC6CON1_REF5_SIZE                                 0x1
#define _DAC6CON1_REF5_LENGTH                               0x1
#define _DAC6CON1_REF5_MASK                                 0x20
#define _DAC6CON1_REF6_POSN                                 0x6
#define _DAC6CON1_REF6_POSITION                             0x6
#define _DAC6CON1_REF6_SIZE                                 0x1
#define _DAC6CON1_REF6_LENGTH                               0x1
#define _DAC6CON1_REF6_MASK                                 0x40
#define _DAC6CON1_REF7_POSN                                 0x7
#define _DAC6CON1_REF7_POSITION                             0x7
#define _DAC6CON1_REF7_SIZE                                 0x1
#define _DAC6CON1_REF7_LENGTH                               0x1
#define _DAC6CON1_REF7_MASK                                 0x80

// Register: DAC6REFH
#define DAC6REFH DAC6REFH
extern volatile unsigned char           DAC6REFH            __at(0x59D);
#ifndef _LIB_BUILD
asm("DAC6REFH equ 059Dh");
#endif
// aliases
extern volatile unsigned char           DAC6CON2            __at(0x59D);
#ifndef _LIB_BUILD
asm("DAC6CON2 equ 059Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC6REF8               :1;
        unsigned DAC6REF9               :1;
        unsigned DAC6REF10              :1;
        unsigned DAC6REF11              :1;
        unsigned DAC6REF12              :1;
        unsigned DAC6REF13              :1;
        unsigned DAC6REF14              :1;
        unsigned DAC6REF15              :1;
    };
    struct {
        unsigned R8                     :1;
        unsigned R9                     :1;
        unsigned R10                    :1;
        unsigned R11                    :1;
        unsigned R12                    :1;
        unsigned R13                    :1;
        unsigned R14                    :1;
        unsigned R15                    :1;
    };
    struct {
        unsigned DAC6R8                 :1;
        unsigned DAC6R9                 :1;
        unsigned DAC6R10                :1;
        unsigned DAC6R11                :1;
        unsigned DAC6R12                :1;
        unsigned DAC6R13                :1;
        unsigned DAC6R14                :1;
        unsigned DAC6R15                :1;
    };
    struct {
        unsigned REF8                   :1;
        unsigned REF9                   :1;
        unsigned REF10                  :1;
        unsigned REF11                  :1;
        unsigned REF12                  :1;
        unsigned REF13                  :1;
        unsigned REF14                  :1;
        unsigned REF15                  :1;
    };
} DAC6REFHbits_t;
