MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile DAC8CON0bits_t DAC8CON0bits __at(0x60C);
// bitfield macros
#define _DAC8CON0_NSS_POSN                                  0x0
#define _DAC8CON0_NSS_POSITION                              0x0
#define _DAC8CON0_NSS_SIZE                                  0x2
#define _DAC8CON0_NSS_LENGTH                                0x2
#define _DAC8CON0_NSS_MASK                                  0x3
#define _DAC8CON0_PSS_POSN                                  0x2
#define _DAC8CON0_PSS_POSITION                              0x2
#define _DAC8CON0_PSS_SIZE                                  0x2
#define _DAC8CON0_PSS_LENGTH                                0x2
#define _DAC8CON0_PSS_MASK                                  0xC
#define _DAC8CON0_OE2_POSN                                  0x4
#define _DAC8CON0_OE2_POSITION                              0x4
#define _DAC8CON0_OE2_SIZE                                  0x1
#define _DAC8CON0_OE2_LENGTH                                0x1
#define _DAC8CON0_OE2_MASK                                  0x10
#define _DAC8CON0_OE1_POSN                                  0x5
#define _DAC8CON0_OE1_POSITION                              0x5
#define _DAC8CON0_OE1_SIZE                                  0x1
#define _DAC8CON0_OE1_LENGTH                                0x1
#define _DAC8CON0_OE1_MASK                                  0x20
#define _DAC8CON0_EN_POSN                                   0x7
#define _DAC8CON0_EN_POSITION                               0x7
#define _DAC8CON0_EN_SIZE                                   0x1
#define _DAC8CON0_EN_LENGTH                                 0x1
#define _DAC8CON0_EN_MASK                                   0x80
#define _DAC8CON0_NSS0_POSN                                 0x0
#define _DAC8CON0_NSS0_POSITION                             0x0
#define _DAC8CON0_NSS0_SIZE                                 0x1
#define _DAC8CON0_NSS0_LENGTH                               0x1
#define _DAC8CON0_NSS0_MASK                                 0x1
#define _DAC8CON0_NSS1_POSN                                 0x1
#define _DAC8CON0_NSS1_POSITION                             0x1
#define _DAC8CON0_NSS1_SIZE                                 0x1
#define _DAC8CON0_NSS1_LENGTH                               0x1
#define _DAC8CON0_NSS1_MASK                                 0x2
#define _DAC8CON0_PSS0_POSN                                 0x2
#define _DAC8CON0_PSS0_POSITION                             0x2
#define _DAC8CON0_PSS0_SIZE                                 0x1
#define _DAC8CON0_PSS0_LENGTH                               0x1
#define _DAC8CON0_PSS0_MASK                                 0x4
#define _DAC8CON0_PSS1_POSN                                 0x3
#define _DAC8CON0_PSS1_POSITION                             0x3
#define _DAC8CON0_PSS1_SIZE                                 0x1
#define _DAC8CON0_PSS1_LENGTH                               0x1
#define _DAC8CON0_PSS1_MASK                                 0x8
#define _DAC8CON0_DACNSS_POSN                               0x0
#define _DAC8CON0_DACNSS_POSITION                           0x0
#define _DAC8CON0_DACNSS_SIZE                               0x2
#define _DAC8CON0_DACNSS_LENGTH                             0x2
#define _DAC8CON0_DACNSS_MASK                               0x3
#define _DAC8CON0_DACPSS_POSN                               0x2
#define _DAC8CON0_DACPSS_POSITION                           0x2
#define _DAC8CON0_DACPSS_SIZE                               0x2
#define _DAC8CON0_DACPSS_LENGTH                             0x2
#define _DAC8CON0_DACPSS_MASK                               0xC
#define _DAC8CON0_DACOE2_POSN                               0x4
#define _DAC8CON0_DACOE2_POSITION                           0x4
#define _DAC8CON0_DACOE2_SIZE                               0x1
#define _DAC8CON0_DACOE2_LENGTH                             0x1
#define _DAC8CON0_DACOE2_MASK                               0x10
#define _DAC8CON0_DACOE1_POSN                               0x5
#define _DAC8CON0_DACOE1_POSITION                           0x5
#define _DAC8CON0_DACOE1_SIZE                               0x1
#define _DAC8CON0_DACOE1_LENGTH                             0x1
#define _DAC8CON0_DACOE1_MASK                               0x20
#define _DAC8CON0_DACEN_POSN                                0x7
#define _DAC8CON0_DACEN_POSITION                            0x7
#define _DAC8CON0_DACEN_SIZE                                0x1
#define _DAC8CON0_DACEN_LENGTH                              0x1
#define _DAC8CON0_DACEN_MASK                                0x80
#define _DAC8CON0_DACNSS0_POSN                              0x0
#define _DAC8CON0_DACNSS0_POSITION                          0x0
#define _DAC8CON0_DACNSS0_SIZE                              0x1
#define _DAC8CON0_DACNSS0_LENGTH                            0x1
#define _DAC8CON0_DACNSS0_MASK                              0x1
#define _DAC8CON0_DACNSS1_POSN                              0x1
#define _DAC8CON0_DACNSS1_POSITION                          0x1
#define _DAC8CON0_DACNSS1_SIZE                              0x1
#define _DAC8CON0_DACNSS1_LENGTH                            0x1
#define _DAC8CON0_DACNSS1_MASK                              0x2
#define _DAC8CON0_DACPSS0_POSN                              0x2
#define _DAC8CON0_DACPSS0_POSITION                          0x2
#define _DAC8CON0_DACPSS0_SIZE                              0x1
#define _DAC8CON0_DACPSS0_LENGTH                            0x1
#define _DAC8CON0_DACPSS0_MASK                              0x4
#define _DAC8CON0_DACPSS1_POSN                              0x3
#define _DAC8CON0_DACPSS1_POSITION                          0x3
#define _DAC8CON0_DACPSS1_SIZE                              0x1
#define _DAC8CON0_DACPSS1_LENGTH                            0x1
#define _DAC8CON0_DACPSS1_MASK                              0x8
#define _DAC8CON0_DAC8NSS_POSN                              0x0
#define _DAC8CON0_DAC8NSS_POSITION                          0x0
#define _DAC8CON0_DAC8NSS_SIZE                              0x2
#define _DAC8CON0_DAC8NSS_LENGTH                            0x2
#define _DAC8CON0_DAC8NSS_MASK                              0x3
#define _DAC8CON0_DAC8PSS_POSN                              0x2
#define _DAC8CON0_DAC8PSS_POSITION                          0x2
#define _DAC8CON0_DAC8PSS_SIZE                              0x2
#define _DAC8CON0_DAC8PSS_LENGTH                            0x2
#define _DAC8CON0_DAC8PSS_MASK                              0xC
#define _DAC8CON0_DAC8OE2_POSN                              0x4
#define _DAC8CON0_DAC8OE2_POSITION                          0x4
#define _DAC8CON0_DAC8OE2_SIZE                              0x1
#define _DAC8CON0_DAC8OE2_LENGTH                            0x1
#define _DAC8CON0_DAC8OE2_MASK                              0x10
#define _DAC8CON0_DAC8OE1_POSN                              0x5
#define _DAC8CON0_DAC8OE1_POSITION                          0x5
#define _DAC8CON0_DAC8OE1_SIZE                              0x1
#define _DAC8CON0_DAC8OE1_LENGTH                            0x1
#define _DAC8CON0_DAC8OE1_MASK                              0x20
#define _DAC8CON0_DAC8EN_POSN                               0x7
#define _DAC8CON0_DAC8EN_POSITION                           0x7
#define _DAC8CON0_DAC8EN_SIZE                               0x1
#define _DAC8CON0_DAC8EN_LENGTH                             0x1
#define _DAC8CON0_DAC8EN_MASK                               0x80
#define _DAC8CON0_DAC8NSS0_POSN                             0x0
#define _DAC8CON0_DAC8NSS0_POSITION                         0x0
#define _DAC8CON0_DAC8NSS0_SIZE                             0x1
#define _DAC8CON0_DAC8NSS0_LENGTH                           0x1
#define _DAC8CON0_DAC8NSS0_MASK                             0x1
#define _DAC8CON0_DAC8NSS1_POSN                             0x1
#define _DAC8CON0_DAC8NSS1_POSITION                         0x1
#define _DAC8CON0_DAC8NSS1_SIZE                             0x1
#define _DAC8CON0_DAC8NSS1_LENGTH                           0x1
#define _DAC8CON0_DAC8NSS1_MASK                             0x2
#define _DAC8CON0_DAC8PSS0_POSN                             0x2
#define _DAC8CON0_DAC8PSS0_POSITION                         0x2
#define _DAC8CON0_DAC8PSS0_SIZE                             0x1
#define _DAC8CON0_DAC8PSS0_LENGTH                           0x1
#define _DAC8CON0_DAC8PSS0_MASK                             0x4
#define _DAC8CON0_DAC8PSS1_POSN                             0x3
#define _DAC8CON0_DAC8PSS1_POSITION                         0x3
#define _DAC8CON0_DAC8PSS1_SIZE                             0x1
#define _DAC8CON0_DAC8PSS1_LENGTH                           0x1
#define _DAC8CON0_DAC8PSS1_MASK                             0x8

// Register: DAC8REF
#define DAC8REF DAC8REF
extern volatile unsigned char           DAC8REF             __at(0x60D);
#ifndef _LIB_BUILD
asm("DAC8REF equ 060Dh");
#endif
// aliases
extern volatile unsigned char           DAC8CON1            __at(0x60D);
#ifndef _LIB_BUILD
asm("DAC8CON1 equ 060Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC8R                  :5;
    };
    struct {
        unsigned DAC8R0                 :1;
        unsigned DAC8R1                 :1;
        unsigned DAC8R2                 :1;
        unsigned DAC8R3                 :1;
        unsigned DAC8R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC8REF0               :1;
        unsigned DAC8REF1               :1;
        unsigned DAC8REF2               :1;
        unsigned DAC8REF3               :1;
        unsigned DAC8REF4               :1;
    };
} DAC8REFbits_t;
