MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile DAC8REFbits_t DAC8REFbits __at(0x60D);
// bitfield macros
#define _DAC8REF_DACR_POSN                                  0x0
#define _DAC8REF_DACR_POSITION                              0x0
#define _DAC8REF_DACR_SIZE                                  0x5
#define _DAC8REF_DACR_LENGTH                                0x5
#define _DAC8REF_DACR_MASK                                  0x1F
#define _DAC8REF_DACR0_POSN                                 0x0
#define _DAC8REF_DACR0_POSITION                             0x0
#define _DAC8REF_DACR0_SIZE                                 0x1
#define _DAC8REF_DACR0_LENGTH                               0x1
#define _DAC8REF_DACR0_MASK                                 0x1
#define _DAC8REF_DACR1_POSN                                 0x1
#define _DAC8REF_DACR1_POSITION                             0x1
#define _DAC8REF_DACR1_SIZE                                 0x1
#define _DAC8REF_DACR1_LENGTH                               0x1
#define _DAC8REF_DACR1_MASK                                 0x2
#define _DAC8REF_DACR2_POSN                                 0x2
#define _DAC8REF_DACR2_POSITION                             0x2
#define _DAC8REF_DACR2_SIZE                                 0x1
#define _DAC8REF_DACR2_LENGTH                               0x1
#define _DAC8REF_DACR2_MASK                                 0x4
#define _DAC8REF_DACR3_POSN                                 0x3
#define _DAC8REF_DACR3_POSITION                             0x3
#define _DAC8REF_DACR3_SIZE                                 0x1
#define _DAC8REF_DACR3_LENGTH                               0x1
#define _DAC8REF_DACR3_MASK                                 0x8
#define _DAC8REF_DACR4_POSN                                 0x4
#define _DAC8REF_DACR4_POSITION                             0x4
#define _DAC8REF_DACR4_SIZE                                 0x1
#define _DAC8REF_DACR4_LENGTH                               0x1
#define _DAC8REF_DACR4_MASK                                 0x10
#define _DAC8REF_R0_POSN                                    0x0
#define _DAC8REF_R0_POSITION                                0x0
#define _DAC8REF_R0_SIZE                                    0x1
#define _DAC8REF_R0_LENGTH                                  0x1
#define _DAC8REF_R0_MASK                                    0x1
#define _DAC8REF_R1_POSN                                    0x1
#define _DAC8REF_R1_POSITION                                0x1
#define _DAC8REF_R1_SIZE                                    0x1
#define _DAC8REF_R1_LENGTH                                  0x1
#define _DAC8REF_R1_MASK                                    0x2
#define _DAC8REF_R2_POSN                                    0x2
#define _DAC8REF_R2_POSITION                                0x2
#define _DAC8REF_R2_SIZE                                    0x1
#define _DAC8REF_R2_LENGTH                                  0x1
#define _DAC8REF_R2_MASK                                    0x4
#define _DAC8REF_R3_POSN                                    0x3
#define _DAC8REF_R3_POSITION                                0x3
#define _DAC8REF_R3_SIZE                                    0x1
#define _DAC8REF_R3_LENGTH                                  0x1
#define _DAC8REF_R3_MASK                                    0x8
#define _DAC8REF_R4_POSN                                    0x4
#define _DAC8REF_R4_POSITION                                0x4
#define _DAC8REF_R4_SIZE                                    0x1
#define _DAC8REF_R4_LENGTH                                  0x1
#define _DAC8REF_R4_MASK                                    0x10
#define _DAC8REF_DAC8R_POSN                                 0x0
#define _DAC8REF_DAC8R_POSITION                             0x0
#define _DAC8REF_DAC8R_SIZE                                 0x5
#define _DAC8REF_DAC8R_LENGTH                               0x5
#define _DAC8REF_DAC8R_MASK                                 0x1F
#define _DAC8REF_DAC8R0_POSN                                0x0
#define _DAC8REF_DAC8R0_POSITION                            0x0
#define _DAC8REF_DAC8R0_SIZE                                0x1
#define _DAC8REF_DAC8R0_LENGTH                              0x1
#define _DAC8REF_DAC8R0_MASK                                0x1
#define _DAC8REF_DAC8R1_POSN                                0x1
#define _DAC8REF_DAC8R1_POSITION                            0x1
#define _DAC8REF_DAC8R1_SIZE                                0x1
#define _DAC8REF_DAC8R1_LENGTH                              0x1
#define _DAC8REF_DAC8R1_MASK                                0x2
#define _DAC8REF_DAC8R2_POSN                                0x2
#define _DAC8REF_DAC8R2_POSITION                            0x2
#define _DAC8REF_DAC8R2_SIZE                                0x1
#define _DAC8REF_DAC8R2_LENGTH                              0x1
#define _DAC8REF_DAC8R2_MASK                                0x4
#define _DAC8REF_DAC8R3_POSN                                0x3
#define _DAC8REF_DAC8R3_POSITION                            0x3
#define _DAC8REF_DAC8R3_SIZE                                0x1
#define _DAC8REF_DAC8R3_LENGTH                              0x1
#define _DAC8REF_DAC8R3_MASK                                0x8
#define _DAC8REF_DAC8R4_POSN                                0x4
#define _DAC8REF_DAC8R4_POSITION                            0x4
#define _DAC8REF_DAC8R4_SIZE                                0x1
#define _DAC8REF_DAC8R4_LENGTH                              0x1
#define _DAC8REF_DAC8R4_MASK                                0x10
#define _DAC8REF_REF0_POSN                                  0x0
#define _DAC8REF_REF0_POSITION                              0x0
#define _DAC8REF_REF0_SIZE                                  0x1
#define _DAC8REF_REF0_LENGTH                                0x1
#define _DAC8REF_REF0_MASK                                  0x1
#define _DAC8REF_REF1_POSN                                  0x1
#define _DAC8REF_REF1_POSITION                              0x1
#define _DAC8REF_REF1_SIZE                                  0x1
#define _DAC8REF_REF1_LENGTH                                0x1
#define _DAC8REF_REF1_MASK                                  0x2
#define _DAC8REF_REF2_POSN                                  0x2
#define _DAC8REF_REF2_POSITION                              0x2
#define _DAC8REF_REF2_SIZE                                  0x1
#define _DAC8REF_REF2_LENGTH                                0x1
#define _DAC8REF_REF2_MASK                                  0x4
#define _DAC8REF_REF3_POSN                                  0x3
#define _DAC8REF_REF3_POSITION                              0x3
#define _DAC8REF_REF3_SIZE                                  0x1
#define _DAC8REF_REF3_LENGTH                                0x1
#define _DAC8REF_REF3_MASK                                  0x8
#define _DAC8REF_REF4_POSN                                  0x4
#define _DAC8REF_REF4_POSITION                              0x4
#define _DAC8REF_REF4_SIZE                                  0x1
#define _DAC8REF_REF4_LENGTH                                0x1
#define _DAC8REF_REF4_MASK                                  0x10
#define _DAC8REF_DAC8REF0_POSN                              0x0
#define _DAC8REF_DAC8REF0_POSITION                          0x0
#define _DAC8REF_DAC8REF0_SIZE                              0x1
#define _DAC8REF_DAC8REF0_LENGTH                            0x1
#define _DAC8REF_DAC8REF0_MASK                              0x1
#define _DAC8REF_DAC8REF1_POSN                              0x1
#define _DAC8REF_DAC8REF1_POSITION                          0x1
#define _DAC8REF_DAC8REF1_SIZE                              0x1
#define _DAC8REF_DAC8REF1_LENGTH                            0x1
#define _DAC8REF_DAC8REF1_MASK                              0x2
#define _DAC8REF_DAC8REF2_POSN                              0x2
#define _DAC8REF_DAC8REF2_POSITION                          0x2
#define _DAC8REF_DAC8REF2_SIZE                              0x1
#define _DAC8REF_DAC8REF2_LENGTH                            0x1
#define _DAC8REF_DAC8REF2_MASK                              0x4
#define _DAC8REF_DAC8REF3_POSN                              0x3
#define _DAC8REF_DAC8REF3_POSITION                          0x3
#define _DAC8REF_DAC8REF3_SIZE                              0x1
#define _DAC8REF_DAC8REF3_LENGTH                            0x1
#define _DAC8REF_DAC8REF3_MASK                              0x8
#define _DAC8REF_DAC8REF4_POSN                              0x4
#define _DAC8REF_DAC8REF4_POSITION                          0x4
#define _DAC8REF_DAC8REF4_SIZE                              0x1
#define _DAC8REF_DAC8REF4_LENGTH                            0x1
#define _DAC8REF_DAC8REF4_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned DACR                   :5;
    };
    struct {
        unsigned DACR0                  :1;
        unsigned DACR1                  :1;
        unsigned DACR2                  :1;
        unsigned DACR3                  :1;
        unsigned DACR4                  :1;
    };
    struct {
        unsigned R0                     :1;
        unsigned R1                     :1;
        unsigned R2                     :1;
        unsigned R3                     :1;
        unsigned R4                     :1;
    };
    struct {
        unsigned DAC8R                  :5;
    };
    struct {
        unsigned DAC8R0                 :1;
        unsigned DAC8R1                 :1;
        unsigned DAC8R2                 :1;
        unsigned DAC8R3                 :1;
        unsigned DAC8R4                 :1;
    };
    struct {
        unsigned REF0                   :1;
        unsigned REF1                   :1;
        unsigned REF2                   :1;
        unsigned REF3                   :1;
        unsigned REF4                   :1;
    };
    struct {
        unsigned DAC8REF0               :1;
        unsigned DAC8REF1               :1;
        unsigned DAC8REF2               :1;
        unsigned DAC8REF3               :1;
        unsigned DAC8REF4               :1;
    };
} DAC8CON1bits_t;
