MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: PRG4INS
#define PRG4INS PRG4INS
extern volatile unsigned char           PRG4INS             __at(0x610);
#ifndef _LIB_BUILD
asm("PRG4INS equ 0610h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INS                    :8;
    };
    struct {
        unsigned INS0                   :1;
        unsigned INS1                   :1;
        unsigned INS2                   :1;
        unsigned INS3                   :1;
    };
    struct {
        unsigned RG4INS0                :1;
        unsigned RG4INS1                :1;
        unsigned RG4INS2                :1;
        unsigned RG4INS3                :1;
    };
} PRG4INSbits_t;
extern volatile PRG4INSbits_t PRG4INSbits __at(0x610);
// bitfield macros
#define _PRG4INS_INS_POSN                                   0x0
#define _PRG4INS_INS_POSITION                               0x0
#define _PRG4INS_INS_SIZE                                   0x8
#define _PRG4INS_INS_LENGTH                                 0x8
#define _PRG4INS_INS_MASK                                   0xFF
#define _PRG4INS_INS0_POSN                                  0x0
#define _PRG4INS_INS0_POSITION                              0x0
#define _PRG4INS_INS0_SIZE                                  0x1
#define _PRG4INS_INS0_LENGTH                                0x1
#define _PRG4INS_INS0_MASK                                  0x1
#define _PRG4INS_INS1_POSN                                  0x1
#define _PRG4INS_INS1_POSITION                              0x1
#define _PRG4INS_INS1_SIZE                                  0x1
#define _PRG4INS_INS1_LENGTH                                0x1
#define _PRG4INS_INS1_MASK                                  0x2
#define _PRG4INS_INS2_POSN                                  0x2
#define _PRG4INS_INS2_POSITION                              0x2
#define _PRG4INS_INS2_SIZE                                  0x1
#define _PRG4INS_INS2_LENGTH                                0x1
#define _PRG4INS_INS2_MASK                                  0x4
#define _PRG4INS_INS3_POSN                                  0x3
#define _PRG4INS_INS3_POSITION                              0x3
#define _PRG4INS_INS3_SIZE                                  0x1
#define _PRG4INS_INS3_LENGTH                                0x1
#define _PRG4INS_INS3_MASK                                  0x8
#define _PRG4INS_RG4INS0_POSN                               0x0
#define _PRG4INS_RG4INS0_POSITION                           0x0
#define _PRG4INS_RG4INS0_SIZE                               0x1
#define _PRG4INS_RG4INS0_LENGTH                             0x1
#define _PRG4INS_RG4INS0_MASK                               0x1
#define _PRG4INS_RG4INS1_POSN                               0x1
#define _PRG4INS_RG4INS1_POSITION                           0x1
#define _PRG4INS_RG4INS1_SIZE                               0x1
#define _PRG4INS_RG4INS1_LENGTH                             0x1
#define _PRG4INS_RG4INS1_MASK                               0x2
#define _PRG4INS_RG4INS2_POSN                               0x2
#define _PRG4INS_RG4INS2_POSITION                           0x2
#define _PRG4INS_RG4INS2_SIZE                               0x1
#define _PRG4INS_RG4INS2_LENGTH                             0x1
#define _PRG4INS_RG4INS2_MASK                               0x4
#define _PRG4INS_RG4INS3_POSN                               0x3
#define _PRG4INS_RG4INS3_POSITION                           0x3
#define _PRG4INS_RG4INS3_SIZE                               0x1
#define _PRG4INS_RG4INS3_LENGTH                             0x1
#define _PRG4INS_RG4INS3_MASK                               0x8

// Register: PRG4CON0
#define PRG4CON0 PRG4CON0
extern volatile unsigned char           PRG4CON0            __at(0x611);
#ifndef _LIB_BUILD
asm("PRG4CON0 equ 0611h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GO                     :1;
        unsigned OS                     :1;
        unsigned MODE                   :2;
        unsigned REDG                   :1;
        unsigned FEDG                   :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
    struct {
        unsigned RG4GO                  :1;
        unsigned RG4OS                  :1;
        unsigned RG4MODE                :2;
        unsigned RG4REDG                :1;
        unsigned RG4FEDG                :1;
        unsigned                        :1;
        unsigned RG4EN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned RG4MODE0               :1;
        unsigned RG4MODE1               :1;
    };
} PRG4CON0bits_t;
extern volatile PRG4CON0bits_t PRG4CON0bits __at(0x611);
// bitfield macros
#define _PRG4CON0_GO_POSN                                   0x0
#define _PRG4CON0_GO_POSITION                               0x0
#define _PRG4CON0_GO_SIZE                                   0x1
#define _PRG4CON0_GO_LENGTH                                 0x1
#define _PRG4CON0_GO_MASK                                   0x1
#define _PRG4CON0_OS_POSN                                   0x1
#define _PRG4CON0_OS_POSITION                               0x1
#define _PRG4CON0_OS_SIZE                                   0x1
#define _PRG4CON0_OS_LENGTH                                 0x1
#define _PRG4CON0_OS_MASK                                   0x2
#define _PRG4CON0_MODE_POSN                                 0x2
#define _PRG4CON0_MODE_POSITION                             0x2
#define _PRG4CON0_MODE_SIZE                                 0x2
#define _PRG4CON0_MODE_LENGTH                               0x2
#define _PRG4CON0_MODE_MASK                                 0xC
#define _PRG4CON0_REDG_POSN                                 0x4
#define _PRG4CON0_REDG_POSITION                             0x4
#define _PRG4CON0_REDG_SIZE                                 0x1
#define _PRG4CON0_REDG_LENGTH                               0x1
#define _PRG4CON0_REDG_MASK                                 0x10
#define _PRG4CON0_FEDG_POSN                                 0x5
#define _PRG4CON0_FEDG_POSITION                             0x5
#define _PRG4CON0_FEDG_SIZE                                 0x1
#define _PRG4CON0_FEDG_LENGTH                               0x1
#define _PRG4CON0_FEDG_MASK                                 0x20
#define _PRG4CON0_EN_POSN                                   0x7
#define _PRG4CON0_EN_POSITION                               0x7
#define _PRG4CON0_EN_SIZE                                   0x1
#define _PRG4CON0_EN_LENGTH                                 0x1
#define _PRG4CON0_EN_MASK                                   0x80
#define _PRG4CON0_MODE0_POSN                                0x2
#define _PRG4CON0_MODE0_POSITION                            0x2
#define _PRG4CON0_MODE0_SIZE                                0x1
#define _PRG4CON0_MODE0_LENGTH                              0x1
#define _PRG4CON0_MODE0_MASK                                0x4
#define _PRG4CON0_MODE1_POSN                                0x3
#define _PRG4CON0_MODE1_POSITION                            0x3
#define _PRG4CON0_MODE1_SIZE                                0x1
#define _PRG4CON0_MODE1_LENGTH                              0x1
#define _PRG4CON0_MODE1_MASK                                0x8
#define _PRG4CON0_RG4GO_POSN                                0x0
#define _PRG4CON0_RG4GO_POSITION                            0x0
#define _PRG4CON0_RG4GO_SIZE                                0x1
#define _PRG4CON0_RG4GO_LENGTH                              0x1
#define _PRG4CON0_RG4GO_MASK                                0x1
#define _PRG4CON0_RG4OS_POSN                                0x1
#define _PRG4CON0_RG4OS_POSITION                            0x1
#define _PRG4CON0_RG4OS_SIZE                                0x1
#define _PRG4CON0_RG4OS_LENGTH                              0x1
#define _PRG4CON0_RG4OS_MASK                                0x2
#define _PRG4CON0_RG4MODE_POSN                              0x2
#define _PRG4CON0_RG4MODE_POSITION                          0x2
#define _PRG4CON0_RG4MODE_SIZE                              0x2
#define _PRG4CON0_RG4MODE_LENGTH                            0x2
#define _PRG4CON0_RG4MODE_MASK                              0xC
#define _PRG4CON0_RG4REDG_POSN                              0x4
#define _PRG4CON0_RG4REDG_POSITION                          0x4
#define _PRG4CON0_RG4REDG_SIZE                              0x1
#define _PRG4CON0_RG4REDG_LENGTH                            0x1
#define _PRG4CON0_RG4REDG_MASK                              0x10
#define _PRG4CON0_RG4FEDG_POSN                              0x5
#define _PRG4CON0_RG4FEDG_POSITION                          0x5
#define _PRG4CON0_RG4FEDG_SIZE                              0x1
#define _PRG4CON0_RG4FEDG_LENGTH                            0x1
#define _PRG4CON0_RG4FEDG_MASK                              0x20
#define _PRG4CON0_RG4EN_POSN                                0x7
#define _PRG4CON0_RG4EN_POSITION                            0x7
#define _PRG4CON0_RG4EN_SIZE                                0x1
#define _PRG4CON0_RG4EN_LENGTH                              0x1
#define _PRG4CON0_RG4EN_MASK                                0x80
#define _PRG4CON0_RG4MODE0_POSN                             0x2
#define _PRG4CON0_RG4MODE0_POSITION                         0x2
#define _PRG4CON0_RG4MODE0_SIZE                             0x1
#define _PRG4CON0_RG4MODE0_LENGTH                           0x1
#define _PRG4CON0_RG4MODE0_MASK                             0x4
#define _PRG4CON0_RG4MODE1_POSN                             0x3
#define _PRG4CON0_RG4MODE1_POSITION                         0x3
#define _PRG4CON0_RG4MODE1_SIZE                             0x1
#define _PRG4CON0_RG4MODE1_LENGTH                           0x1
#define _PRG4CON0_RG4MODE1_MASK                             0x8

// Register: PRG4CON1
#define PRG4CON1 PRG4CON1
extern volatile unsigned char           PRG4CON1            __at(0x612);
#ifndef _LIB_BUILD
asm("PRG4CON1 equ 0612h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOL                   :1;
        unsigned FPOL                   :1;
        unsigned RDY                    :1;
    };
    struct {
        unsigned RG4RPOL                :1;
        unsigned RG4FPOL                :1;
        unsigned RG4RDY                 :1;
    };
} PRG4CON1bits_t;
extern volatile PRG4CON1bits_t PRG4CON1bits __at(0x612);
// bitfield macros
#define _PRG4CON1_RPOL_POSN                                 0x0
#define _PRG4CON1_RPOL_POSITION                             0x0
#define _PRG4CON1_RPOL_SIZE                                 0x1
#define _PRG4CON1_RPOL_LENGTH                               0x1
#define _PRG4CON1_RPOL_MASK                                 0x1
#define _PRG4CON1_FPOL_POSN                                 0x1
#define _PRG4CON1_FPOL_POSITION                             0x1
#define _PRG4CON1_FPOL_SIZE                                 0x1
#define _PRG4CON1_FPOL_LENGTH                               0x1
#define _PRG4CON1_FPOL_MASK                                 0x2
#define _PRG4CON1_RDY_POSN                                  0x2
#define _PRG4CON1_RDY_POSITION                              0x2
#define _PRG4CON1_RDY_SIZE                                  0x1
#define _PRG4CON1_RDY_LENGTH                                0x1
#define _PRG4CON1_RDY_MASK                                  0x4
#define _PRG4CON1_RG4RPOL_POSN                              0x0
#define _PRG4CON1_RG4RPOL_POSITION                          0x0
#define _PRG4CON1_RG4RPOL_SIZE                              0x1
#define _PRG4CON1_RG4RPOL_LENGTH                            0x1
#define _PRG4CON1_RG4RPOL_MASK                              0x1
#define _PRG4CON1_RG4FPOL_POSN                              0x1
#define _PRG4CON1_RG4FPOL_POSITION                          0x1
#define _PRG4CON1_RG4FPOL_SIZE                              0x1
#define _PRG4CON1_RG4FPOL_LENGTH                            0x1
#define _PRG4CON1_RG4FPOL_MASK                              0x2
#define _PRG4CON1_RG4RDY_POSN                               0x2
#define _PRG4CON1_RG4RDY_POSITION                           0x2
#define _PRG4CON1_RG4RDY_SIZE                               0x1
#define _PRG4CON1_RG4RDY_LENGTH                             0x1
#define _PRG4CON1_RG4RDY_MASK                               0x4

// Register: PRG4CON2
#define PRG4CON2 PRG4CON2
extern volatile unsigned char           PRG4CON2            __at(0x613);
#ifndef _LIB_BUILD
asm("PRG4CON2 equ 0613h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISET                   :5;
    };
    struct {
        unsigned ISET0                  :1;
        unsigned ISET1                  :1;
        unsigned ISET2                  :1;
        unsigned ISET3                  :1;
        unsigned ISET4                  :1;
    };
    struct {
        unsigned RG4ISET                :5;
    };
    struct {
        unsigned RG4ISET0               :1;
        unsigned RG4ISET1               :1;
        unsigned RG4ISET2               :1;
        unsigned RG4ISET3               :1;
        unsigned RG4ISET4               :1;
    };
} PRG4CON2bits_t;
extern volatile PRG4CON2bits_t PRG4CON2bits __at(0x613);
// bitfield macros
#define _PRG4CON2_ISET_POSN                                 0x0
#define _PRG4CON2_ISET_POSITION                             0x0
#define _PRG4CON2_ISET_SIZE                                 0x5
#define _PRG4CON2_ISET_LENGTH                               0x5
#define _PRG4CON2_ISET_MASK                                 0x1F
#define _PRG4CON2_ISET0_POSN                                0x0
#define _PRG4CON2_ISET0_POSITION                            0x0
#define _PRG4CON2_ISET0_SIZE                                0x1
#define _PRG4CON2_ISET0_LENGTH                              0x1
#define _PRG4CON2_ISET0_MASK                                0x1
#define _PRG4CON2_ISET1_POSN                                0x1
#define _PRG4CON2_ISET1_POSITION                            0x1
#define _PRG4CON2_ISET1_SIZE                                0x1
#define _PRG4CON2_ISET1_LENGTH                              0x1
#define _PRG4CON2_ISET1_MASK                                0x2
#define _PRG4CON2_ISET2_POSN                                0x2
#define _PRG4CON2_ISET2_POSITION                            0x2
#define _PRG4CON2_ISET2_SIZE                                0x1
#define _PRG4CON2_ISET2_LENGTH                              0x1
#define _PRG4CON2_ISET2_MASK                                0x4
#define _PRG4CON2_ISET3_POSN                                0x3
#define _PRG4CON2_ISET3_POSITION                            0x3
#define _PRG4CON2_ISET3_SIZE                                0x1
#define _PRG4CON2_ISET3_LENGTH                              0x1
#define _PRG4CON2_ISET3_MASK                                0x8
#define _PRG4CON2_ISET4_POSN                                0x4
#define _PRG4CON2_ISET4_POSITION                            0x4
#define _PRG4CON2_ISET4_SIZE                                0x1
#define _PRG4CON2_ISET4_LENGTH                              0x1
#define _PRG4CON2_ISET4_MASK                                0x10
#define _PRG4CON2_RG4ISET_POSN                              0x0
#define _PRG4CON2_RG4ISET_POSITION                          0x0
#define _PRG4CON2_RG4ISET_SIZE                              0x5
#define _PRG4CON2_RG4ISET_LENGTH                            0x5
#define _PRG4CON2_RG4ISET_MASK                              0x1F
#define _PRG4CON2_RG4ISET0_POSN                             0x0
#define _PRG4CON2_RG4ISET0_POSITION                         0x0
#define _PRG4CON2_RG4ISET0_SIZE                             0x1
#define _PRG4CON2_RG4ISET0_LENGTH                           0x1
#define _PRG4CON2_RG4ISET0_MASK                             0x1
#define _PRG4CON2_RG4ISET1_POSN                             0x1
#define _PRG4CON2_RG4ISET1_POSITION                         0x1
#define _PRG4CON2_RG4ISET1_SIZE                             0x1
#define _PRG4CON2_RG4ISET1_LENGTH                           0x1
#define _PRG4CON2_RG4ISET1_MASK                             0x2
#define _PRG4CON2_RG4ISET2_POSN                             0x2
#define _PRG4CON2_RG4ISET2_POSITION                         0x2
#define _PRG4CON2_RG4ISET2_SIZE                             0x1
#define _PRG4CON2_RG4ISET2_LENGTH                           0x1
#define _PRG4CON2_RG4ISET2_MASK                             0x4
#define _PRG4CON2_RG4ISET3_POSN                             0x3
#define _PRG4CON2_RG4ISET3_POSITION                         0x3
#define _PRG4CON2_RG4ISET3_SIZE                             0x1
#define _PRG4CON2_RG4ISET3_LENGTH                           0x1
#define _PRG4CON2_RG4ISET3_MASK                             0x8
#define _PRG4CON2_RG4ISET4_POSN                             0x4
#define _PRG4CON2_RG4ISET4_POSITION                         0x4
#define _PRG4CON2_RG4ISET4_SIZE                             0x1
#define _PRG4CON2_RG4ISET4_LENGTH                           0x1
#define _PRG4CON2_RG4ISET4_MASK                             0x10

// Register: PWM3DC
#define PWM3DC PWM3DC
extern volatile unsigned short          PWM3DC              __at(0x614);
#ifndef _LIB_BUILD
asm("PWM3DC equ 0614h");
#endif

