MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile COG2FSIM1bits_t COG2FSIM1bits __at(0x71C);
// bitfield macros
#define _COG2FSIM1_FSIM8_POSN                               0x0
#define _COG2FSIM1_FSIM8_POSITION                           0x0
#define _COG2FSIM1_FSIM8_SIZE                               0x1
#define _COG2FSIM1_FSIM8_LENGTH                             0x1
#define _COG2FSIM1_FSIM8_MASK                               0x1
#define _COG2FSIM1_FSIM9_POSN                               0x1
#define _COG2FSIM1_FSIM9_POSITION                           0x1
#define _COG2FSIM1_FSIM9_SIZE                               0x1
#define _COG2FSIM1_FSIM9_LENGTH                             0x1
#define _COG2FSIM1_FSIM9_MASK                               0x2
#define _COG2FSIM1_FSIM10_POSN                              0x2
#define _COG2FSIM1_FSIM10_POSITION                          0x2
#define _COG2FSIM1_FSIM10_SIZE                              0x1
#define _COG2FSIM1_FSIM10_LENGTH                            0x1
#define _COG2FSIM1_FSIM10_MASK                              0x4
#define _COG2FSIM1_FSIM11_POSN                              0x3
#define _COG2FSIM1_FSIM11_POSITION                          0x3
#define _COG2FSIM1_FSIM11_SIZE                              0x1
#define _COG2FSIM1_FSIM11_LENGTH                            0x1
#define _COG2FSIM1_FSIM11_MASK                              0x8
#define _COG2FSIM1_FSIM12_POSN                              0x4
#define _COG2FSIM1_FSIM12_POSITION                          0x4
#define _COG2FSIM1_FSIM12_SIZE                              0x1
#define _COG2FSIM1_FSIM12_LENGTH                            0x1
#define _COG2FSIM1_FSIM12_MASK                              0x10
#define _COG2FSIM1_FSIM13_POSN                              0x5
#define _COG2FSIM1_FSIM13_POSITION                          0x5
#define _COG2FSIM1_FSIM13_SIZE                              0x1
#define _COG2FSIM1_FSIM13_LENGTH                            0x1
#define _COG2FSIM1_FSIM13_MASK                              0x20
#define _COG2FSIM1_FSIM14_POSN                              0x6
#define _COG2FSIM1_FSIM14_POSITION                          0x6
#define _COG2FSIM1_FSIM14_SIZE                              0x1
#define _COG2FSIM1_FSIM14_LENGTH                            0x1
#define _COG2FSIM1_FSIM14_MASK                              0x40
#define _COG2FSIM1_FSIM15_POSN                              0x7
#define _COG2FSIM1_FSIM15_POSITION                          0x7
#define _COG2FSIM1_FSIM15_SIZE                              0x1
#define _COG2FSIM1_FSIM15_LENGTH                            0x1
#define _COG2FSIM1_FSIM15_MASK                              0x80
#define _COG2FSIM1_G2FSIM8_POSN                             0x0
#define _COG2FSIM1_G2FSIM8_POSITION                         0x0
#define _COG2FSIM1_G2FSIM8_SIZE                             0x1
#define _COG2FSIM1_G2FSIM8_LENGTH                           0x1
#define _COG2FSIM1_G2FSIM8_MASK                             0x1
#define _COG2FSIM1_G2FSIM9_POSN                             0x1
#define _COG2FSIM1_G2FSIM9_POSITION                         0x1
#define _COG2FSIM1_G2FSIM9_SIZE                             0x1
#define _COG2FSIM1_G2FSIM9_LENGTH                           0x1
#define _COG2FSIM1_G2FSIM9_MASK                             0x2
#define _COG2FSIM1_G2FSIM10_POSN                            0x2
#define _COG2FSIM1_G2FSIM10_POSITION                        0x2
#define _COG2FSIM1_G2FSIM10_SIZE                            0x1
#define _COG2FSIM1_G2FSIM10_LENGTH                          0x1
#define _COG2FSIM1_G2FSIM10_MASK                            0x4
#define _COG2FSIM1_G2FSIM11_POSN                            0x3
#define _COG2FSIM1_G2FSIM11_POSITION                        0x3
#define _COG2FSIM1_G2FSIM11_SIZE                            0x1
#define _COG2FSIM1_G2FSIM11_LENGTH                          0x1
#define _COG2FSIM1_G2FSIM11_MASK                            0x8
#define _COG2FSIM1_G2FSIM12_POSN                            0x4
#define _COG2FSIM1_G2FSIM12_POSITION                        0x4
#define _COG2FSIM1_G2FSIM12_SIZE                            0x1
#define _COG2FSIM1_G2FSIM12_LENGTH                          0x1
#define _COG2FSIM1_G2FSIM12_MASK                            0x10
#define _COG2FSIM1_G2FSIM13_POSN                            0x5
#define _COG2FSIM1_G2FSIM13_POSITION                        0x5
#define _COG2FSIM1_G2FSIM13_SIZE                            0x1
#define _COG2FSIM1_G2FSIM13_LENGTH                          0x1
#define _COG2FSIM1_G2FSIM13_MASK                            0x20
#define _COG2FSIM1_G2FSIM14_POSN                            0x6
#define _COG2FSIM1_G2FSIM14_POSITION                        0x6
#define _COG2FSIM1_G2FSIM14_SIZE                            0x1
#define _COG2FSIM1_G2FSIM14_LENGTH                          0x1
#define _COG2FSIM1_G2FSIM14_MASK                            0x40
#define _COG2FSIM1_G2FSIM15_POSN                            0x7
#define _COG2FSIM1_G2FSIM15_POSITION                        0x7
#define _COG2FSIM1_G2FSIM15_SIZE                            0x1
#define _COG2FSIM1_G2FSIM15_LENGTH                          0x1
#define _COG2FSIM1_G2FSIM15_MASK                            0x80

// Register: COG2ASD0
#define COG2ASD0 COG2ASD0
extern volatile unsigned char           COG2ASD0            __at(0x71D);
#ifndef _LIB_BUILD
asm("COG2ASD0 equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ASDAC                  :2;
        unsigned ASDBD                  :2;
        unsigned ASREN                  :1;
        unsigned ASE                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned ASDAC0                 :1;
        unsigned ASDAC1                 :1;
        unsigned ASDBD0                 :1;
        unsigned ASDBD1                 :1;
        unsigned ARSEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G2ASDAC                :2;
        unsigned G2ASDBD                :2;
        unsigned G2ARSEN                :1;
        unsigned G2ASE                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G2ASDAC0               :1;
        unsigned G2ASDAC1               :1;
        unsigned G2ASDBD0               :1;
        unsigned G2ASDBD1               :1;
        unsigned G2ASREN                :1;
    };
} COG2ASD0bits_t;
extern volatile COG2ASD0bits_t COG2ASD0bits __at(0x71D);
// bitfield macros
#define _COG2ASD0_ASDAC_POSN                                0x2
#define _COG2ASD0_ASDAC_POSITION                            0x2
#define _COG2ASD0_ASDAC_SIZE                                0x2
#define _COG2ASD0_ASDAC_LENGTH                              0x2
#define _COG2ASD0_ASDAC_MASK                                0xC
#define _COG2ASD0_ASDBD_POSN                                0x4
#define _COG2ASD0_ASDBD_POSITION                            0x4
#define _COG2ASD0_ASDBD_SIZE                                0x2
#define _COG2ASD0_ASDBD_LENGTH                              0x2
#define _COG2ASD0_ASDBD_MASK                                0x30
#define _COG2ASD0_ASREN_POSN                                0x6
#define _COG2ASD0_ASREN_POSITION                            0x6
#define _COG2ASD0_ASREN_SIZE                                0x1
#define _COG2ASD0_ASREN_LENGTH                              0x1
#define _COG2ASD0_ASREN_MASK                                0x40
#define _COG2ASD0_ASE_POSN                                  0x7
#define _COG2ASD0_ASE_POSITION                              0x7
#define _COG2ASD0_ASE_SIZE                                  0x1
#define _COG2ASD0_ASE_LENGTH                                0x1
#define _COG2ASD0_ASE_MASK                                  0x80
#define _COG2ASD0_ASDAC0_POSN                               0x2
#define _COG2ASD0_ASDAC0_POSITION                           0x2
#define _COG2ASD0_ASDAC0_SIZE                               0x1
#define _COG2ASD0_ASDAC0_LENGTH                             0x1
#define _COG2ASD0_ASDAC0_MASK                               0x4
#define _COG2ASD0_ASDAC1_POSN                               0x3
#define _COG2ASD0_ASDAC1_POSITION                           0x3
#define _COG2ASD0_ASDAC1_SIZE                               0x1
#define _COG2ASD0_ASDAC1_LENGTH                             0x1
#define _COG2ASD0_ASDAC1_MASK                               0x8
#define _COG2ASD0_ASDBD0_POSN                               0x4
#define _COG2ASD0_ASDBD0_POSITION                           0x4
#define _COG2ASD0_ASDBD0_SIZE                               0x1
#define _COG2ASD0_ASDBD0_LENGTH                             0x1
#define _COG2ASD0_ASDBD0_MASK                               0x10
#define _COG2ASD0_ASDBD1_POSN                               0x5
#define _COG2ASD0_ASDBD1_POSITION                           0x5
#define _COG2ASD0_ASDBD1_SIZE                               0x1
#define _COG2ASD0_ASDBD1_LENGTH                             0x1
#define _COG2ASD0_ASDBD1_MASK                               0x20
#define _COG2ASD0_ARSEN_POSN                                0x6
#define _COG2ASD0_ARSEN_POSITION                            0x6
#define _COG2ASD0_ARSEN_SIZE                                0x1
#define _COG2ASD0_ARSEN_LENGTH                              0x1
#define _COG2ASD0_ARSEN_MASK                                0x40
#define _COG2ASD0_G2ASDAC_POSN                              0x2
#define _COG2ASD0_G2ASDAC_POSITION                          0x2
#define _COG2ASD0_G2ASDAC_SIZE                              0x2
#define _COG2ASD0_G2ASDAC_LENGTH                            0x2
#define _COG2ASD0_G2ASDAC_MASK                              0xC
#define _COG2ASD0_G2ASDBD_POSN                              0x4
#define _COG2ASD0_G2ASDBD_POSITION                          0x4
#define _COG2ASD0_G2ASDBD_SIZE                              0x2
#define _COG2ASD0_G2ASDBD_LENGTH                            0x2
#define _COG2ASD0_G2ASDBD_MASK                              0x30
#define _COG2ASD0_G2ARSEN_POSN                              0x6
#define _COG2ASD0_G2ARSEN_POSITION                          0x6
#define _COG2ASD0_G2ARSEN_SIZE                              0x1
#define _COG2ASD0_G2ARSEN_LENGTH                            0x1
#define _COG2ASD0_G2ARSEN_MASK                              0x40
#define _COG2ASD0_G2ASE_POSN                                0x7
#define _COG2ASD0_G2ASE_POSITION                            0x7
#define _COG2ASD0_G2ASE_SIZE                                0x1
#define _COG2ASD0_G2ASE_LENGTH                              0x1
#define _COG2ASD0_G2ASE_MASK                                0x80
#define _COG2ASD0_G2ASDAC0_POSN                             0x2
#define _COG2ASD0_G2ASDAC0_POSITION                         0x2
#define _COG2ASD0_G2ASDAC0_SIZE                             0x1
#define _COG2ASD0_G2ASDAC0_LENGTH                           0x1
#define _COG2ASD0_G2ASDAC0_MASK                             0x4
#define _COG2ASD0_G2ASDAC1_POSN                             0x3
#define _COG2ASD0_G2ASDAC1_POSITION                         0x3
#define _COG2ASD0_G2ASDAC1_SIZE                             0x1
#define _COG2ASD0_G2ASDAC1_LENGTH                           0x1
#define _COG2ASD0_G2ASDAC1_MASK                             0x8
#define _COG2ASD0_G2ASDBD0_POSN                             0x4
#define _COG2ASD0_G2ASDBD0_POSITION                         0x4
#define _COG2ASD0_G2ASDBD0_SIZE                             0x1
#define _COG2ASD0_G2ASDBD0_LENGTH                           0x1
#define _COG2ASD0_G2ASDBD0_MASK                             0x10
#define _COG2ASD0_G2ASDBD1_POSN                             0x5
#define _COG2ASD0_G2ASDBD1_POSITION                         0x5
#define _COG2ASD0_G2ASDBD1_SIZE                             0x1
#define _COG2ASD0_G2ASDBD1_LENGTH                           0x1
#define _COG2ASD0_G2ASDBD1_MASK                             0x20
#define _COG2ASD0_G2ASREN_POSN                              0x6
#define _COG2ASD0_G2ASREN_POSITION                          0x6
#define _COG2ASD0_G2ASREN_SIZE                              0x1
#define _COG2ASD0_G2ASREN_LENGTH                            0x1
#define _COG2ASD0_G2ASREN_MASK                              0x40

// Register: COG2ASD1
#define COG2ASD1 COG2ASD1
extern volatile unsigned char           COG2ASD1            __at(0x71E);
#ifndef _LIB_BUILD
asm("COG2ASD1 equ 071Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
        unsigned AS7E                   :1;
    };
    struct {
        unsigned G2AS0E                 :1;
        unsigned G2AS1E                 :1;
        unsigned G2AS2E                 :1;
        unsigned G2AS3E                 :1;
        unsigned G2AS4E                 :1;
        unsigned G2AS5E                 :1;
        unsigned G2AS6E                 :1;
        unsigned G2AS7E                 :1;
    };
} COG2ASD1bits_t;
extern volatile COG2ASD1bits_t COG2ASD1bits __at(0x71E);
// bitfield macros
#define _COG2ASD1_AS0E_POSN                                 0x0
#define _COG2ASD1_AS0E_POSITION                             0x0
#define _COG2ASD1_AS0E_SIZE                                 0x1
#define _COG2ASD1_AS0E_LENGTH                               0x1
#define _COG2ASD1_AS0E_MASK                                 0x1
#define _COG2ASD1_AS1E_POSN                                 0x1
#define _COG2ASD1_AS1E_POSITION                             0x1
#define _COG2ASD1_AS1E_SIZE                                 0x1
#define _COG2ASD1_AS1E_LENGTH                               0x1
#define _COG2ASD1_AS1E_MASK                                 0x2
#define _COG2ASD1_AS2E_POSN                                 0x2
#define _COG2ASD1_AS2E_POSITION                             0x2
#define _COG2ASD1_AS2E_SIZE                                 0x1
#define _COG2ASD1_AS2E_LENGTH                               0x1
#define _COG2ASD1_AS2E_MASK                                 0x4
#define _COG2ASD1_AS3E_POSN                                 0x3
#define _COG2ASD1_AS3E_POSITION                             0x3
#define _COG2ASD1_AS3E_SIZE                                 0x1
#define _COG2ASD1_AS3E_LENGTH                               0x1
#define _COG2ASD1_AS3E_MASK                                 0x8
#define _COG2ASD1_AS4E_POSN                                 0x4
#define _COG2ASD1_AS4E_POSITION                             0x4
#define _COG2ASD1_AS4E_SIZE                                 0x1
#define _COG2ASD1_AS4E_LENGTH                               0x1
#define _COG2ASD1_AS4E_MASK                                 0x10
#define _COG2ASD1_AS5E_POSN                                 0x5
#define _COG2ASD1_AS5E_POSITION                             0x5
#define _COG2ASD1_AS5E_SIZE                                 0x1
#define _COG2ASD1_AS5E_LENGTH                               0x1
#define _COG2ASD1_AS5E_MASK                                 0x20
#define _COG2ASD1_AS6E_POSN                                 0x6
#define _COG2ASD1_AS6E_POSITION                             0x6
#define _COG2ASD1_AS6E_SIZE                                 0x1
#define _COG2ASD1_AS6E_LENGTH                               0x1
#define _COG2ASD1_AS6E_MASK                                 0x40
#define _COG2ASD1_AS7E_POSN                                 0x7
#define _COG2ASD1_AS7E_POSITION                             0x7
#define _COG2ASD1_AS7E_SIZE                                 0x1
#define _COG2ASD1_AS7E_LENGTH                               0x1
#define _COG2ASD1_AS7E_MASK                                 0x80
#define _COG2ASD1_G2AS0E_POSN                               0x0
#define _COG2ASD1_G2AS0E_POSITION                           0x0
#define _COG2ASD1_G2AS0E_SIZE                               0x1
#define _COG2ASD1_G2AS0E_LENGTH                             0x1
#define _COG2ASD1_G2AS0E_MASK                               0x1
#define _COG2ASD1_G2AS1E_POSN                               0x1
#define _COG2ASD1_G2AS1E_POSITION                           0x1
#define _COG2ASD1_G2AS1E_SIZE                               0x1
#define _COG2ASD1_G2AS1E_LENGTH                             0x1
#define _COG2ASD1_G2AS1E_MASK                               0x2
#define _COG2ASD1_G2AS2E_POSN                               0x2
#define _COG2ASD1_G2AS2E_POSITION                           0x2
#define _COG2ASD1_G2AS2E_SIZE                               0x1
#define _COG2ASD1_G2AS2E_LENGTH                             0x1
#define _COG2ASD1_G2AS2E_MASK                               0x4
#define _COG2ASD1_G2AS3E_POSN                               0x3
#define _COG2ASD1_G2AS3E_POSITION                           0x3
#define _COG2ASD1_G2AS3E_SIZE                               0x1
#define _COG2ASD1_G2AS3E_LENGTH                             0x1
#define _COG2ASD1_G2AS3E_MASK                               0x8
#define _COG2ASD1_G2AS4E_POSN                               0x4
#define _COG2ASD1_G2AS4E_POSITION                           0x4
#define _COG2ASD1_G2AS4E_SIZE                               0x1
#define _COG2ASD1_G2AS4E_LENGTH                             0x1
#define _COG2ASD1_G2AS4E_MASK                               0x10
#define _COG2ASD1_G2AS5E_POSN                               0x5
#define _COG2ASD1_G2AS5E_POSITION                           0x5
#define _COG2ASD1_G2AS5E_SIZE                               0x1
#define _COG2ASD1_G2AS5E_LENGTH                             0x1
#define _COG2ASD1_G2AS5E_MASK                               0x20
#define _COG2ASD1_G2AS6E_POSN                               0x6
#define _COG2ASD1_G2AS6E_POSITION                           0x6
#define _COG2ASD1_G2AS6E_SIZE                               0x1
#define _COG2ASD1_G2AS6E_LENGTH                             0x1
#define _COG2ASD1_G2AS6E_MASK                               0x40
#define _COG2ASD1_G2AS7E_POSN                               0x7
#define _COG2ASD1_G2AS7E_POSITION                           0x7
#define _COG2ASD1_G2AS7E_SIZE                               0x1
#define _COG2ASD1_G2AS7E_LENGTH                             0x1
#define _COG2ASD1_G2AS7E_MASK                               0x80

// Register: COG2STR
#define COG2STR COG2STR
extern volatile unsigned char           COG2STR             __at(0x71F);
#ifndef _LIB_BUILD
asm("COG2STR equ 071Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned SDATA                  :1;
        unsigned SDATB                  :1;
        unsigned SDATC                  :1;
        unsigned SDATD                  :1;
    };
    struct {
        unsigned G2STRA                 :1;
        unsigned G2STRB                 :1;
        unsigned G2STRC                 :1;
        unsigned G2STRD                 :1;
        unsigned G2SDATA                :1;
        unsigned G2SDATB                :1;
        unsigned G2SDATC                :1;
        unsigned G2SDATD                :1;
    };
} COG2STRbits_t;
