MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: COG4PHF
#define COG4PHF COG4PHF
extern volatile unsigned char           COG4PHF             __at(0x88E);
#ifndef _LIB_BUILD
asm("COG4PHF equ 088Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHF                    :6;
    };
    struct {
        unsigned PHF0                   :1;
        unsigned PHF1                   :1;
        unsigned PHF2                   :1;
        unsigned PHF3                   :1;
        unsigned PHF4                   :1;
        unsigned PHF5                   :1;
    };
    struct {
        unsigned G4PHF0                 :1;
        unsigned G4PHF1                 :1;
        unsigned G4PHF2                 :1;
        unsigned G4PHF3                 :1;
        unsigned G4PHF4                 :1;
        unsigned G4PHF5                 :1;
    };
} COG4PHFbits_t;
extern volatile COG4PHFbits_t COG4PHFbits __at(0x88E);
// bitfield macros
#define _COG4PHF_PHF_POSN                                   0x0
#define _COG4PHF_PHF_POSITION                               0x0
#define _COG4PHF_PHF_SIZE                                   0x6
#define _COG4PHF_PHF_LENGTH                                 0x6
#define _COG4PHF_PHF_MASK                                   0x3F
#define _COG4PHF_PHF0_POSN                                  0x0
#define _COG4PHF_PHF0_POSITION                              0x0
#define _COG4PHF_PHF0_SIZE                                  0x1
#define _COG4PHF_PHF0_LENGTH                                0x1
#define _COG4PHF_PHF0_MASK                                  0x1
#define _COG4PHF_PHF1_POSN                                  0x1
#define _COG4PHF_PHF1_POSITION                              0x1
#define _COG4PHF_PHF1_SIZE                                  0x1
#define _COG4PHF_PHF1_LENGTH                                0x1
#define _COG4PHF_PHF1_MASK                                  0x2
#define _COG4PHF_PHF2_POSN                                  0x2
#define _COG4PHF_PHF2_POSITION                              0x2
#define _COG4PHF_PHF2_SIZE                                  0x1
#define _COG4PHF_PHF2_LENGTH                                0x1
#define _COG4PHF_PHF2_MASK                                  0x4
#define _COG4PHF_PHF3_POSN                                  0x3
#define _COG4PHF_PHF3_POSITION                              0x3
#define _COG4PHF_PHF3_SIZE                                  0x1
#define _COG4PHF_PHF3_LENGTH                                0x1
#define _COG4PHF_PHF3_MASK                                  0x8
#define _COG4PHF_PHF4_POSN                                  0x4
#define _COG4PHF_PHF4_POSITION                              0x4
#define _COG4PHF_PHF4_SIZE                                  0x1
#define _COG4PHF_PHF4_LENGTH                                0x1
#define _COG4PHF_PHF4_MASK                                  0x10
#define _COG4PHF_PHF5_POSN                                  0x5
#define _COG4PHF_PHF5_POSITION                              0x5
#define _COG4PHF_PHF5_SIZE                                  0x1
#define _COG4PHF_PHF5_LENGTH                                0x1
#define _COG4PHF_PHF5_MASK                                  0x20
#define _COG4PHF_G4PHF0_POSN                                0x0
#define _COG4PHF_G4PHF0_POSITION                            0x0
#define _COG4PHF_G4PHF0_SIZE                                0x1
#define _COG4PHF_G4PHF0_LENGTH                              0x1
#define _COG4PHF_G4PHF0_MASK                                0x1
#define _COG4PHF_G4PHF1_POSN                                0x1
#define _COG4PHF_G4PHF1_POSITION                            0x1
#define _COG4PHF_G4PHF1_SIZE                                0x1
#define _COG4PHF_G4PHF1_LENGTH                              0x1
#define _COG4PHF_G4PHF1_MASK                                0x2
#define _COG4PHF_G4PHF2_POSN                                0x2
#define _COG4PHF_G4PHF2_POSITION                            0x2
#define _COG4PHF_G4PHF2_SIZE                                0x1
#define _COG4PHF_G4PHF2_LENGTH                              0x1
#define _COG4PHF_G4PHF2_MASK                                0x4
#define _COG4PHF_G4PHF3_POSN                                0x3
#define _COG4PHF_G4PHF3_POSITION                            0x3
#define _COG4PHF_G4PHF3_SIZE                                0x1
#define _COG4PHF_G4PHF3_LENGTH                              0x1
#define _COG4PHF_G4PHF3_MASK                                0x8
#define _COG4PHF_G4PHF4_POSN                                0x4
#define _COG4PHF_G4PHF4_POSITION                            0x4
#define _COG4PHF_G4PHF4_SIZE                                0x1
#define _COG4PHF_G4PHF4_LENGTH                              0x1
#define _COG4PHF_G4PHF4_MASK                                0x10
#define _COG4PHF_G4PHF5_POSN                                0x5
#define _COG4PHF_G4PHF5_POSITION                            0x5
#define _COG4PHF_G4PHF5_SIZE                                0x1
#define _COG4PHF_G4PHF5_LENGTH                              0x1
#define _COG4PHF_G4PHF5_MASK                                0x20

// Register: COG4BLKR
#define COG4BLKR COG4BLKR
extern volatile unsigned char           COG4BLKR            __at(0x88F);
#ifndef _LIB_BUILD
asm("COG4BLKR equ 088Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKR                   :6;
    };
    struct {
        unsigned BLKR0                  :1;
        unsigned BLKR1                  :1;
        unsigned BLKR2                  :1;
        unsigned BLKR3                  :1;
        unsigned BLKR4                  :1;
        unsigned BLKR5                  :1;
    };
    struct {
        unsigned G4BLKR0                :1;
        unsigned G4BLKR1                :1;
        unsigned G4BLKR2                :1;
        unsigned G4BLKR3                :1;
        unsigned G4BLKR4                :1;
        unsigned G4BLKR5                :1;
    };
} COG4BLKRbits_t;
extern volatile COG4BLKRbits_t COG4BLKRbits __at(0x88F);
// bitfield macros
#define _COG4BLKR_BLKR_POSN                                 0x0
#define _COG4BLKR_BLKR_POSITION                             0x0
#define _COG4BLKR_BLKR_SIZE                                 0x6
#define _COG4BLKR_BLKR_LENGTH                               0x6
#define _COG4BLKR_BLKR_MASK                                 0x3F
#define _COG4BLKR_BLKR0_POSN                                0x0
#define _COG4BLKR_BLKR0_POSITION                            0x0
#define _COG4BLKR_BLKR0_SIZE                                0x1
#define _COG4BLKR_BLKR0_LENGTH                              0x1
#define _COG4BLKR_BLKR0_MASK                                0x1
#define _COG4BLKR_BLKR1_POSN                                0x1
#define _COG4BLKR_BLKR1_POSITION                            0x1
#define _COG4BLKR_BLKR1_SIZE                                0x1
#define _COG4BLKR_BLKR1_LENGTH                              0x1
#define _COG4BLKR_BLKR1_MASK                                0x2
#define _COG4BLKR_BLKR2_POSN                                0x2
#define _COG4BLKR_BLKR2_POSITION                            0x2
#define _COG4BLKR_BLKR2_SIZE                                0x1
#define _COG4BLKR_BLKR2_LENGTH                              0x1
#define _COG4BLKR_BLKR2_MASK                                0x4
#define _COG4BLKR_BLKR3_POSN                                0x3
#define _COG4BLKR_BLKR3_POSITION                            0x3
#define _COG4BLKR_BLKR3_SIZE                                0x1
#define _COG4BLKR_BLKR3_LENGTH                              0x1
#define _COG4BLKR_BLKR3_MASK                                0x8
#define _COG4BLKR_BLKR4_POSN                                0x4
#define _COG4BLKR_BLKR4_POSITION                            0x4
#define _COG4BLKR_BLKR4_SIZE                                0x1
#define _COG4BLKR_BLKR4_LENGTH                              0x1
#define _COG4BLKR_BLKR4_MASK                                0x10
#define _COG4BLKR_BLKR5_POSN                                0x5
#define _COG4BLKR_BLKR5_POSITION                            0x5
#define _COG4BLKR_BLKR5_SIZE                                0x1
#define _COG4BLKR_BLKR5_LENGTH                              0x1
#define _COG4BLKR_BLKR5_MASK                                0x20
#define _COG4BLKR_G4BLKR0_POSN                              0x0
#define _COG4BLKR_G4BLKR0_POSITION                          0x0
#define _COG4BLKR_G4BLKR0_SIZE                              0x1
#define _COG4BLKR_G4BLKR0_LENGTH                            0x1
#define _COG4BLKR_G4BLKR0_MASK                              0x1
#define _COG4BLKR_G4BLKR1_POSN                              0x1
#define _COG4BLKR_G4BLKR1_POSITION                          0x1
#define _COG4BLKR_G4BLKR1_SIZE                              0x1
#define _COG4BLKR_G4BLKR1_LENGTH                            0x1
#define _COG4BLKR_G4BLKR1_MASK                              0x2
#define _COG4BLKR_G4BLKR2_POSN                              0x2
#define _COG4BLKR_G4BLKR2_POSITION                          0x2
#define _COG4BLKR_G4BLKR2_SIZE                              0x1
#define _COG4BLKR_G4BLKR2_LENGTH                            0x1
#define _COG4BLKR_G4BLKR2_MASK                              0x4
#define _COG4BLKR_G4BLKR3_POSN                              0x3
#define _COG4BLKR_G4BLKR3_POSITION                          0x3
#define _COG4BLKR_G4BLKR3_SIZE                              0x1
#define _COG4BLKR_G4BLKR3_LENGTH                            0x1
#define _COG4BLKR_G4BLKR3_MASK                              0x8
#define _COG4BLKR_G4BLKR4_POSN                              0x4
#define _COG4BLKR_G4BLKR4_POSITION                          0x4
#define _COG4BLKR_G4BLKR4_SIZE                              0x1
#define _COG4BLKR_G4BLKR4_LENGTH                            0x1
#define _COG4BLKR_G4BLKR4_MASK                              0x10
#define _COG4BLKR_G4BLKR5_POSN                              0x5
#define _COG4BLKR_G4BLKR5_POSITION                          0x5
#define _COG4BLKR_G4BLKR5_SIZE                              0x1
#define _COG4BLKR_G4BLKR5_LENGTH                            0x1
#define _COG4BLKR_G4BLKR5_MASK                              0x20

// Register: COG4BLKF
#define COG4BLKF COG4BLKF
extern volatile unsigned char           COG4BLKF            __at(0x890);
#ifndef _LIB_BUILD
asm("COG4BLKF equ 0890h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BLKF                   :6;
    };
    struct {
        unsigned BLKF0                  :1;
        unsigned BLKF1                  :1;
        unsigned BLKF2                  :1;
        unsigned BLKF3                  :1;
        unsigned BLKF4                  :1;
        unsigned BLKF5                  :1;
    };
    struct {
        unsigned G4BLKF0                :1;
        unsigned G4BLKF1                :1;
        unsigned G4BLKF2                :1;
        unsigned G4BLKF3                :1;
        unsigned G4BLKF4                :1;
        unsigned G4BLKF5                :1;
    };
} COG4BLKFbits_t;
extern volatile COG4BLKFbits_t COG4BLKFbits __at(0x890);
// bitfield macros
#define _COG4BLKF_BLKF_POSN                                 0x0
#define _COG4BLKF_BLKF_POSITION                             0x0
#define _COG4BLKF_BLKF_SIZE                                 0x6
#define _COG4BLKF_BLKF_LENGTH                               0x6
#define _COG4BLKF_BLKF_MASK                                 0x3F
#define _COG4BLKF_BLKF0_POSN                                0x0
#define _COG4BLKF_BLKF0_POSITION                            0x0
#define _COG4BLKF_BLKF0_SIZE                                0x1
#define _COG4BLKF_BLKF0_LENGTH                              0x1
#define _COG4BLKF_BLKF0_MASK                                0x1
#define _COG4BLKF_BLKF1_POSN                                0x1
#define _COG4BLKF_BLKF1_POSITION                            0x1
#define _COG4BLKF_BLKF1_SIZE                                0x1
#define _COG4BLKF_BLKF1_LENGTH                              0x1
#define _COG4BLKF_BLKF1_MASK                                0x2
#define _COG4BLKF_BLKF2_POSN                                0x2
#define _COG4BLKF_BLKF2_POSITION                            0x2
#define _COG4BLKF_BLKF2_SIZE                                0x1
#define _COG4BLKF_BLKF2_LENGTH                              0x1
#define _COG4BLKF_BLKF2_MASK                                0x4
#define _COG4BLKF_BLKF3_POSN                                0x3
#define _COG4BLKF_BLKF3_POSITION                            0x3
#define _COG4BLKF_BLKF3_SIZE                                0x1
#define _COG4BLKF_BLKF3_LENGTH                              0x1
#define _COG4BLKF_BLKF3_MASK                                0x8
#define _COG4BLKF_BLKF4_POSN                                0x4
#define _COG4BLKF_BLKF4_POSITION                            0x4
#define _COG4BLKF_BLKF4_SIZE                                0x1
#define _COG4BLKF_BLKF4_LENGTH                              0x1
#define _COG4BLKF_BLKF4_MASK                                0x10
#define _COG4BLKF_BLKF5_POSN                                0x5
#define _COG4BLKF_BLKF5_POSITION                            0x5
#define _COG4BLKF_BLKF5_SIZE                                0x1
#define _COG4BLKF_BLKF5_LENGTH                              0x1
#define _COG4BLKF_BLKF5_MASK                                0x20
#define _COG4BLKF_G4BLKF0_POSN                              0x0
#define _COG4BLKF_G4BLKF0_POSITION                          0x0
#define _COG4BLKF_G4BLKF0_SIZE                              0x1
#define _COG4BLKF_G4BLKF0_LENGTH                            0x1
#define _COG4BLKF_G4BLKF0_MASK                              0x1
#define _COG4BLKF_G4BLKF1_POSN                              0x1
#define _COG4BLKF_G4BLKF1_POSITION                          0x1
#define _COG4BLKF_G4BLKF1_SIZE                              0x1
#define _COG4BLKF_G4BLKF1_LENGTH                            0x1
#define _COG4BLKF_G4BLKF1_MASK                              0x2
#define _COG4BLKF_G4BLKF2_POSN                              0x2
#define _COG4BLKF_G4BLKF2_POSITION                          0x2
#define _COG4BLKF_G4BLKF2_SIZE                              0x1
#define _COG4BLKF_G4BLKF2_LENGTH                            0x1
#define _COG4BLKF_G4BLKF2_MASK                              0x4
#define _COG4BLKF_G4BLKF3_POSN                              0x3
#define _COG4BLKF_G4BLKF3_POSITION                          0x3
#define _COG4BLKF_G4BLKF3_SIZE                              0x1
#define _COG4BLKF_G4BLKF3_LENGTH                            0x1
#define _COG4BLKF_G4BLKF3_MASK                              0x8
#define _COG4BLKF_G4BLKF4_POSN                              0x4
#define _COG4BLKF_G4BLKF4_POSITION                          0x4
#define _COG4BLKF_G4BLKF4_SIZE                              0x1
#define _COG4BLKF_G4BLKF4_LENGTH                            0x1
#define _COG4BLKF_G4BLKF4_MASK                              0x10
#define _COG4BLKF_G4BLKF5_POSN                              0x5
#define _COG4BLKF_G4BLKF5_POSITION                          0x5
#define _COG4BLKF_G4BLKF5_SIZE                              0x1
#define _COG4BLKF_G4BLKF5_LENGTH                            0x1
#define _COG4BLKF_G4BLKF5_MASK                              0x20

// Register: COG4DBR
#define COG4DBR COG4DBR
extern volatile unsigned char           COG4DBR             __at(0x891);
#ifndef _LIB_BUILD
asm("COG4DBR equ 0891h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBR                    :6;
    };
    struct {
        unsigned DBR0                   :1;
        unsigned DBR1                   :1;
        unsigned DBR2                   :1;
        unsigned DBR3                   :1;
        unsigned DBR4                   :1;
        unsigned DBR5                   :1;
    };
    struct {
        unsigned G4DBR0                 :1;
        unsigned G4DBR1                 :1;
        unsigned G4DBR2                 :1;
        unsigned G4DBR3                 :1;
        unsigned G4DBR4                 :1;
        unsigned G4DBR5                 :1;
    };
} COG4DBRbits_t;
