MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: COG4RSIM0
#define COG4RSIM0 COG4RSIM0
extern volatile unsigned char           COG4RSIM0           __at(0x897);
#ifndef _LIB_BUILD
asm("COG4RSIM0 equ 0897h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSIM0                  :1;
        unsigned RSIM1                  :1;
        unsigned RSIM2                  :1;
        unsigned RSIM3                  :1;
        unsigned RSIM4                  :1;
        unsigned RSIM5                  :1;
        unsigned RSIM6                  :1;
        unsigned RSIM7                  :1;
    };
    struct {
        unsigned G4RSIM0                :1;
        unsigned G4RSIM1                :1;
        unsigned G4RSIM2                :1;
        unsigned G4RSIM3                :1;
        unsigned G4RSIM4                :1;
        unsigned G4RSIM5                :1;
        unsigned G4RSIM6                :1;
        unsigned G4RSIM7                :1;
    };
} COG4RSIM0bits_t;
extern volatile COG4RSIM0bits_t COG4RSIM0bits __at(0x897);
// bitfield macros
#define _COG4RSIM0_RSIM0_POSN                               0x0
#define _COG4RSIM0_RSIM0_POSITION                           0x0
#define _COG4RSIM0_RSIM0_SIZE                               0x1
#define _COG4RSIM0_RSIM0_LENGTH                             0x1
#define _COG4RSIM0_RSIM0_MASK                               0x1
#define _COG4RSIM0_RSIM1_POSN                               0x1
#define _COG4RSIM0_RSIM1_POSITION                           0x1
#define _COG4RSIM0_RSIM1_SIZE                               0x1
#define _COG4RSIM0_RSIM1_LENGTH                             0x1
#define _COG4RSIM0_RSIM1_MASK                               0x2
#define _COG4RSIM0_RSIM2_POSN                               0x2
#define _COG4RSIM0_RSIM2_POSITION                           0x2
#define _COG4RSIM0_RSIM2_SIZE                               0x1
#define _COG4RSIM0_RSIM2_LENGTH                             0x1
#define _COG4RSIM0_RSIM2_MASK                               0x4
#define _COG4RSIM0_RSIM3_POSN                               0x3
#define _COG4RSIM0_RSIM3_POSITION                           0x3
#define _COG4RSIM0_RSIM3_SIZE                               0x1
#define _COG4RSIM0_RSIM3_LENGTH                             0x1
#define _COG4RSIM0_RSIM3_MASK                               0x8
#define _COG4RSIM0_RSIM4_POSN                               0x4
#define _COG4RSIM0_RSIM4_POSITION                           0x4
#define _COG4RSIM0_RSIM4_SIZE                               0x1
#define _COG4RSIM0_RSIM4_LENGTH                             0x1
#define _COG4RSIM0_RSIM4_MASK                               0x10
#define _COG4RSIM0_RSIM5_POSN                               0x5
#define _COG4RSIM0_RSIM5_POSITION                           0x5
#define _COG4RSIM0_RSIM5_SIZE                               0x1
#define _COG4RSIM0_RSIM5_LENGTH                             0x1
#define _COG4RSIM0_RSIM5_MASK                               0x20
#define _COG4RSIM0_RSIM6_POSN                               0x6
#define _COG4RSIM0_RSIM6_POSITION                           0x6
#define _COG4RSIM0_RSIM6_SIZE                               0x1
#define _COG4RSIM0_RSIM6_LENGTH                             0x1
#define _COG4RSIM0_RSIM6_MASK                               0x40
#define _COG4RSIM0_RSIM7_POSN                               0x7
#define _COG4RSIM0_RSIM7_POSITION                           0x7
#define _COG4RSIM0_RSIM7_SIZE                               0x1
#define _COG4RSIM0_RSIM7_LENGTH                             0x1
#define _COG4RSIM0_RSIM7_MASK                               0x80
#define _COG4RSIM0_G4RSIM0_POSN                             0x0
#define _COG4RSIM0_G4RSIM0_POSITION                         0x0
#define _COG4RSIM0_G4RSIM0_SIZE                             0x1
#define _COG4RSIM0_G4RSIM0_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM0_MASK                             0x1
#define _COG4RSIM0_G4RSIM1_POSN                             0x1
#define _COG4RSIM0_G4RSIM1_POSITION                         0x1
#define _COG4RSIM0_G4RSIM1_SIZE                             0x1
#define _COG4RSIM0_G4RSIM1_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM1_MASK                             0x2
#define _COG4RSIM0_G4RSIM2_POSN                             0x2
#define _COG4RSIM0_G4RSIM2_POSITION                         0x2
#define _COG4RSIM0_G4RSIM2_SIZE                             0x1
#define _COG4RSIM0_G4RSIM2_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM2_MASK                             0x4
#define _COG4RSIM0_G4RSIM3_POSN                             0x3
#define _COG4RSIM0_G4RSIM3_POSITION                         0x3
#define _COG4RSIM0_G4RSIM3_SIZE                             0x1
#define _COG4RSIM0_G4RSIM3_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM3_MASK                             0x8
#define _COG4RSIM0_G4RSIM4_POSN                             0x4
#define _COG4RSIM0_G4RSIM4_POSITION                         0x4
#define _COG4RSIM0_G4RSIM4_SIZE                             0x1
#define _COG4RSIM0_G4RSIM4_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM4_MASK                             0x10
#define _COG4RSIM0_G4RSIM5_POSN                             0x5
#define _COG4RSIM0_G4RSIM5_POSITION                         0x5
#define _COG4RSIM0_G4RSIM5_SIZE                             0x1
#define _COG4RSIM0_G4RSIM5_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM5_MASK                             0x20
#define _COG4RSIM0_G4RSIM6_POSN                             0x6
#define _COG4RSIM0_G4RSIM6_POSITION                         0x6
#define _COG4RSIM0_G4RSIM6_SIZE                             0x1
#define _COG4RSIM0_G4RSIM6_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM6_MASK                             0x40
#define _COG4RSIM0_G4RSIM7_POSN                             0x7
#define _COG4RSIM0_G4RSIM7_POSITION                         0x7
#define _COG4RSIM0_G4RSIM7_SIZE                             0x1
#define _COG4RSIM0_G4RSIM7_LENGTH                           0x1
#define _COG4RSIM0_G4RSIM7_MASK                             0x80

// Register: COG4RSIM1
#define COG4RSIM1 COG4RSIM1
extern volatile unsigned char           COG4RSIM1           __at(0x898);
#ifndef _LIB_BUILD
asm("COG4RSIM1 equ 0898h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSIM8                  :1;
        unsigned RSIM9                  :1;
        unsigned RSIM10                 :1;
        unsigned RSIM11                 :1;
        unsigned RSIM12                 :1;
        unsigned RSIM13                 :1;
        unsigned RSIM14                 :1;
        unsigned RSIM15                 :1;
    };
    struct {
        unsigned G4RSIM8                :1;
        unsigned G4RSIM9                :1;
        unsigned G4RSIM10               :1;
        unsigned G4RSIM11               :1;
        unsigned G4RSIM12               :1;
        unsigned G4RSIM13               :1;
        unsigned G4RSIM14               :1;
        unsigned G4RSIM15               :1;
    };
} COG4RSIM1bits_t;
extern volatile COG4RSIM1bits_t COG4RSIM1bits __at(0x898);
// bitfield macros
#define _COG4RSIM1_RSIM8_POSN                               0x0
#define _COG4RSIM1_RSIM8_POSITION                           0x0
#define _COG4RSIM1_RSIM8_SIZE                               0x1
#define _COG4RSIM1_RSIM8_LENGTH                             0x1
#define _COG4RSIM1_RSIM8_MASK                               0x1
#define _COG4RSIM1_RSIM9_POSN                               0x1
#define _COG4RSIM1_RSIM9_POSITION                           0x1
#define _COG4RSIM1_RSIM9_SIZE                               0x1
#define _COG4RSIM1_RSIM9_LENGTH                             0x1
#define _COG4RSIM1_RSIM9_MASK                               0x2
#define _COG4RSIM1_RSIM10_POSN                              0x2
#define _COG4RSIM1_RSIM10_POSITION                          0x2
#define _COG4RSIM1_RSIM10_SIZE                              0x1
#define _COG4RSIM1_RSIM10_LENGTH                            0x1
#define _COG4RSIM1_RSIM10_MASK                              0x4
#define _COG4RSIM1_RSIM11_POSN                              0x3
#define _COG4RSIM1_RSIM11_POSITION                          0x3
#define _COG4RSIM1_RSIM11_SIZE                              0x1
#define _COG4RSIM1_RSIM11_LENGTH                            0x1
#define _COG4RSIM1_RSIM11_MASK                              0x8
#define _COG4RSIM1_RSIM12_POSN                              0x4
#define _COG4RSIM1_RSIM12_POSITION                          0x4
#define _COG4RSIM1_RSIM12_SIZE                              0x1
#define _COG4RSIM1_RSIM12_LENGTH                            0x1
#define _COG4RSIM1_RSIM12_MASK                              0x10
#define _COG4RSIM1_RSIM13_POSN                              0x5
#define _COG4RSIM1_RSIM13_POSITION                          0x5
#define _COG4RSIM1_RSIM13_SIZE                              0x1
#define _COG4RSIM1_RSIM13_LENGTH                            0x1
#define _COG4RSIM1_RSIM13_MASK                              0x20
#define _COG4RSIM1_RSIM14_POSN                              0x6
#define _COG4RSIM1_RSIM14_POSITION                          0x6
#define _COG4RSIM1_RSIM14_SIZE                              0x1
#define _COG4RSIM1_RSIM14_LENGTH                            0x1
#define _COG4RSIM1_RSIM14_MASK                              0x40
#define _COG4RSIM1_RSIM15_POSN                              0x7
#define _COG4RSIM1_RSIM15_POSITION                          0x7
#define _COG4RSIM1_RSIM15_SIZE                              0x1
#define _COG4RSIM1_RSIM15_LENGTH                            0x1
#define _COG4RSIM1_RSIM15_MASK                              0x80
#define _COG4RSIM1_G4RSIM8_POSN                             0x0
#define _COG4RSIM1_G4RSIM8_POSITION                         0x0
#define _COG4RSIM1_G4RSIM8_SIZE                             0x1
#define _COG4RSIM1_G4RSIM8_LENGTH                           0x1
#define _COG4RSIM1_G4RSIM8_MASK                             0x1
#define _COG4RSIM1_G4RSIM9_POSN                             0x1
#define _COG4RSIM1_G4RSIM9_POSITION                         0x1
#define _COG4RSIM1_G4RSIM9_SIZE                             0x1
#define _COG4RSIM1_G4RSIM9_LENGTH                           0x1
#define _COG4RSIM1_G4RSIM9_MASK                             0x2
#define _COG4RSIM1_G4RSIM10_POSN                            0x2
#define _COG4RSIM1_G4RSIM10_POSITION                        0x2
#define _COG4RSIM1_G4RSIM10_SIZE                            0x1
#define _COG4RSIM1_G4RSIM10_LENGTH                          0x1
#define _COG4RSIM1_G4RSIM10_MASK                            0x4
#define _COG4RSIM1_G4RSIM11_POSN                            0x3
#define _COG4RSIM1_G4RSIM11_POSITION                        0x3
#define _COG4RSIM1_G4RSIM11_SIZE                            0x1
#define _COG4RSIM1_G4RSIM11_LENGTH                          0x1
#define _COG4RSIM1_G4RSIM11_MASK                            0x8
#define _COG4RSIM1_G4RSIM12_POSN                            0x4
#define _COG4RSIM1_G4RSIM12_POSITION                        0x4
#define _COG4RSIM1_G4RSIM12_SIZE                            0x1
#define _COG4RSIM1_G4RSIM12_LENGTH                          0x1
#define _COG4RSIM1_G4RSIM12_MASK                            0x10
#define _COG4RSIM1_G4RSIM13_POSN                            0x5
#define _COG4RSIM1_G4RSIM13_POSITION                        0x5
#define _COG4RSIM1_G4RSIM13_SIZE                            0x1
#define _COG4RSIM1_G4RSIM13_LENGTH                          0x1
#define _COG4RSIM1_G4RSIM13_MASK                            0x20
#define _COG4RSIM1_G4RSIM14_POSN                            0x6
#define _COG4RSIM1_G4RSIM14_POSITION                        0x6
#define _COG4RSIM1_G4RSIM14_SIZE                            0x1
#define _COG4RSIM1_G4RSIM14_LENGTH                          0x1
#define _COG4RSIM1_G4RSIM14_MASK                            0x40
#define _COG4RSIM1_G4RSIM15_POSN                            0x7
#define _COG4RSIM1_G4RSIM15_POSITION                        0x7
#define _COG4RSIM1_G4RSIM15_SIZE                            0x1
#define _COG4RSIM1_G4RSIM15_LENGTH                          0x1
#define _COG4RSIM1_G4RSIM15_MASK                            0x80

// Register: COG4FIS0
#define COG4FIS0 COG4FIS0
extern volatile unsigned char           COG4FIS0            __at(0x899);
#ifndef _LIB_BUILD
asm("COG4FIS0 equ 0899h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIS0                   :1;
        unsigned FIS1                   :1;
        unsigned FIS2                   :1;
        unsigned FIS3                   :1;
        unsigned FIS4                   :1;
        unsigned FIS5                   :1;
        unsigned FIS6                   :1;
        unsigned FIS7                   :1;
    };
    struct {
        unsigned G4FIS0                 :1;
        unsigned G4FIS1                 :1;
        unsigned G4FIS2                 :1;
        unsigned G4FIS3                 :1;
        unsigned G4FIS4                 :1;
        unsigned G4FIS5                 :1;
        unsigned G4FIS6                 :1;
        unsigned G4FIS7                 :1;
    };
} COG4FIS0bits_t;
extern volatile COG4FIS0bits_t COG4FIS0bits __at(0x899);
// bitfield macros
#define _COG4FIS0_FIS0_POSN                                 0x0
#define _COG4FIS0_FIS0_POSITION                             0x0
#define _COG4FIS0_FIS0_SIZE                                 0x1
#define _COG4FIS0_FIS0_LENGTH                               0x1
#define _COG4FIS0_FIS0_MASK                                 0x1
#define _COG4FIS0_FIS1_POSN                                 0x1
#define _COG4FIS0_FIS1_POSITION                             0x1
#define _COG4FIS0_FIS1_SIZE                                 0x1
#define _COG4FIS0_FIS1_LENGTH                               0x1
#define _COG4FIS0_FIS1_MASK                                 0x2
#define _COG4FIS0_FIS2_POSN                                 0x2
#define _COG4FIS0_FIS2_POSITION                             0x2
#define _COG4FIS0_FIS2_SIZE                                 0x1
#define _COG4FIS0_FIS2_LENGTH                               0x1
#define _COG4FIS0_FIS2_MASK                                 0x4
#define _COG4FIS0_FIS3_POSN                                 0x3
#define _COG4FIS0_FIS3_POSITION                             0x3
#define _COG4FIS0_FIS3_SIZE                                 0x1
#define _COG4FIS0_FIS3_LENGTH                               0x1
#define _COG4FIS0_FIS3_MASK                                 0x8
#define _COG4FIS0_FIS4_POSN                                 0x4
#define _COG4FIS0_FIS4_POSITION                             0x4
#define _COG4FIS0_FIS4_SIZE                                 0x1
#define _COG4FIS0_FIS4_LENGTH                               0x1
#define _COG4FIS0_FIS4_MASK                                 0x10
#define _COG4FIS0_FIS5_POSN                                 0x5
#define _COG4FIS0_FIS5_POSITION                             0x5
#define _COG4FIS0_FIS5_SIZE                                 0x1
#define _COG4FIS0_FIS5_LENGTH                               0x1
#define _COG4FIS0_FIS5_MASK                                 0x20
#define _COG4FIS0_FIS6_POSN                                 0x6
#define _COG4FIS0_FIS6_POSITION                             0x6
#define _COG4FIS0_FIS6_SIZE                                 0x1
#define _COG4FIS0_FIS6_LENGTH                               0x1
#define _COG4FIS0_FIS6_MASK                                 0x40
#define _COG4FIS0_FIS7_POSN                                 0x7
#define _COG4FIS0_FIS7_POSITION                             0x7
#define _COG4FIS0_FIS7_SIZE                                 0x1
#define _COG4FIS0_FIS7_LENGTH                               0x1
#define _COG4FIS0_FIS7_MASK                                 0x80
#define _COG4FIS0_G4FIS0_POSN                               0x0
#define _COG4FIS0_G4FIS0_POSITION                           0x0
#define _COG4FIS0_G4FIS0_SIZE                               0x1
#define _COG4FIS0_G4FIS0_LENGTH                             0x1
#define _COG4FIS0_G4FIS0_MASK                               0x1
#define _COG4FIS0_G4FIS1_POSN                               0x1
#define _COG4FIS0_G4FIS1_POSITION                           0x1
#define _COG4FIS0_G4FIS1_SIZE                               0x1
#define _COG4FIS0_G4FIS1_LENGTH                             0x1
#define _COG4FIS0_G4FIS1_MASK                               0x2
#define _COG4FIS0_G4FIS2_POSN                               0x2
#define _COG4FIS0_G4FIS2_POSITION                           0x2
#define _COG4FIS0_G4FIS2_SIZE                               0x1
#define _COG4FIS0_G4FIS2_LENGTH                             0x1
#define _COG4FIS0_G4FIS2_MASK                               0x4
#define _COG4FIS0_G4FIS3_POSN                               0x3
#define _COG4FIS0_G4FIS3_POSITION                           0x3
#define _COG4FIS0_G4FIS3_SIZE                               0x1
#define _COG4FIS0_G4FIS3_LENGTH                             0x1
#define _COG4FIS0_G4FIS3_MASK                               0x8
#define _COG4FIS0_G4FIS4_POSN                               0x4
#define _COG4FIS0_G4FIS4_POSITION                           0x4
#define _COG4FIS0_G4FIS4_SIZE                               0x1
#define _COG4FIS0_G4FIS4_LENGTH                             0x1
#define _COG4FIS0_G4FIS4_MASK                               0x10
#define _COG4FIS0_G4FIS5_POSN                               0x5
#define _COG4FIS0_G4FIS5_POSITION                           0x5
#define _COG4FIS0_G4FIS5_SIZE                               0x1
#define _COG4FIS0_G4FIS5_LENGTH                             0x1
#define _COG4FIS0_G4FIS5_MASK                               0x20
#define _COG4FIS0_G4FIS6_POSN                               0x6
#define _COG4FIS0_G4FIS6_POSITION                           0x6
#define _COG4FIS0_G4FIS6_SIZE                               0x1
#define _COG4FIS0_G4FIS6_LENGTH                             0x1
#define _COG4FIS0_G4FIS6_MASK                               0x40
#define _COG4FIS0_G4FIS7_POSN                               0x7
#define _COG4FIS0_G4FIS7_POSITION                           0x7
#define _COG4FIS0_G4FIS7_SIZE                               0x1
#define _COG4FIS0_G4FIS7_LENGTH                             0x1
#define _COG4FIS0_G4FIS7_MASK                               0x80

// Register: COG4FIS1
#define COG4FIS1 COG4FIS1
extern volatile unsigned char           COG4FIS1            __at(0x89A);
#ifndef _LIB_BUILD
asm("COG4FIS1 equ 089Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FIS8                   :1;
        unsigned FIS9                   :1;
        unsigned FIS10                  :1;
        unsigned FIS11                  :1;
        unsigned FIS12                  :1;
        unsigned FIS13                  :1;
        unsigned FIS14                  :1;
        unsigned FIS15                  :1;
    };
    struct {
        unsigned G4FIS8                 :1;
        unsigned G4FIS9                 :1;
        unsigned G4FIS10                :1;
        unsigned G4FIS11                :1;
        unsigned G4FIS12                :1;
        unsigned G4FIS13                :1;
        unsigned G4FIS14                :1;
        unsigned G4FIS15                :1;
    };
} COG4FIS1bits_t;
