MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile COG4FIS1bits_t COG4FIS1bits __at(0x89A);
// bitfield macros
#define _COG4FIS1_FIS8_POSN                                 0x0
#define _COG4FIS1_FIS8_POSITION                             0x0
#define _COG4FIS1_FIS8_SIZE                                 0x1
#define _COG4FIS1_FIS8_LENGTH                               0x1
#define _COG4FIS1_FIS8_MASK                                 0x1
#define _COG4FIS1_FIS9_POSN                                 0x1
#define _COG4FIS1_FIS9_POSITION                             0x1
#define _COG4FIS1_FIS9_SIZE                                 0x1
#define _COG4FIS1_FIS9_LENGTH                               0x1
#define _COG4FIS1_FIS9_MASK                                 0x2
#define _COG4FIS1_FIS10_POSN                                0x2
#define _COG4FIS1_FIS10_POSITION                            0x2
#define _COG4FIS1_FIS10_SIZE                                0x1
#define _COG4FIS1_FIS10_LENGTH                              0x1
#define _COG4FIS1_FIS10_MASK                                0x4
#define _COG4FIS1_FIS11_POSN                                0x3
#define _COG4FIS1_FIS11_POSITION                            0x3
#define _COG4FIS1_FIS11_SIZE                                0x1
#define _COG4FIS1_FIS11_LENGTH                              0x1
#define _COG4FIS1_FIS11_MASK                                0x8
#define _COG4FIS1_FIS12_POSN                                0x4
#define _COG4FIS1_FIS12_POSITION                            0x4
#define _COG4FIS1_FIS12_SIZE                                0x1
#define _COG4FIS1_FIS12_LENGTH                              0x1
#define _COG4FIS1_FIS12_MASK                                0x10
#define _COG4FIS1_FIS13_POSN                                0x5
#define _COG4FIS1_FIS13_POSITION                            0x5
#define _COG4FIS1_FIS13_SIZE                                0x1
#define _COG4FIS1_FIS13_LENGTH                              0x1
#define _COG4FIS1_FIS13_MASK                                0x20
#define _COG4FIS1_FIS14_POSN                                0x6
#define _COG4FIS1_FIS14_POSITION                            0x6
#define _COG4FIS1_FIS14_SIZE                                0x1
#define _COG4FIS1_FIS14_LENGTH                              0x1
#define _COG4FIS1_FIS14_MASK                                0x40
#define _COG4FIS1_FIS15_POSN                                0x7
#define _COG4FIS1_FIS15_POSITION                            0x7
#define _COG4FIS1_FIS15_SIZE                                0x1
#define _COG4FIS1_FIS15_LENGTH                              0x1
#define _COG4FIS1_FIS15_MASK                                0x80
#define _COG4FIS1_G4FIS8_POSN                               0x0
#define _COG4FIS1_G4FIS8_POSITION                           0x0
#define _COG4FIS1_G4FIS8_SIZE                               0x1
#define _COG4FIS1_G4FIS8_LENGTH                             0x1
#define _COG4FIS1_G4FIS8_MASK                               0x1
#define _COG4FIS1_G4FIS9_POSN                               0x1
#define _COG4FIS1_G4FIS9_POSITION                           0x1
#define _COG4FIS1_G4FIS9_SIZE                               0x1
#define _COG4FIS1_G4FIS9_LENGTH                             0x1
#define _COG4FIS1_G4FIS9_MASK                               0x2
#define _COG4FIS1_G4FIS10_POSN                              0x2
#define _COG4FIS1_G4FIS10_POSITION                          0x2
#define _COG4FIS1_G4FIS10_SIZE                              0x1
#define _COG4FIS1_G4FIS10_LENGTH                            0x1
#define _COG4FIS1_G4FIS10_MASK                              0x4
#define _COG4FIS1_G4FIS11_POSN                              0x3
#define _COG4FIS1_G4FIS11_POSITION                          0x3
#define _COG4FIS1_G4FIS11_SIZE                              0x1
#define _COG4FIS1_G4FIS11_LENGTH                            0x1
#define _COG4FIS1_G4FIS11_MASK                              0x8
#define _COG4FIS1_G4FIS12_POSN                              0x4
#define _COG4FIS1_G4FIS12_POSITION                          0x4
#define _COG4FIS1_G4FIS12_SIZE                              0x1
#define _COG4FIS1_G4FIS12_LENGTH                            0x1
#define _COG4FIS1_G4FIS12_MASK                              0x10
#define _COG4FIS1_G4FIS13_POSN                              0x5
#define _COG4FIS1_G4FIS13_POSITION                          0x5
#define _COG4FIS1_G4FIS13_SIZE                              0x1
#define _COG4FIS1_G4FIS13_LENGTH                            0x1
#define _COG4FIS1_G4FIS13_MASK                              0x20
#define _COG4FIS1_G4FIS14_POSN                              0x6
#define _COG4FIS1_G4FIS14_POSITION                          0x6
#define _COG4FIS1_G4FIS14_SIZE                              0x1
#define _COG4FIS1_G4FIS14_LENGTH                            0x1
#define _COG4FIS1_G4FIS14_MASK                              0x40
#define _COG4FIS1_G4FIS15_POSN                              0x7
#define _COG4FIS1_G4FIS15_POSITION                          0x7
#define _COG4FIS1_G4FIS15_SIZE                              0x1
#define _COG4FIS1_G4FIS15_LENGTH                            0x1
#define _COG4FIS1_G4FIS15_MASK                              0x80

// Register: COG4FSIM0
#define COG4FSIM0 COG4FSIM0
extern volatile unsigned char           COG4FSIM0           __at(0x89B);
#ifndef _LIB_BUILD
asm("COG4FSIM0 equ 089Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSIM0                  :1;
        unsigned FSIM1                  :1;
        unsigned FSIM2                  :1;
        unsigned FSIM3                  :1;
        unsigned FSIM4                  :1;
        unsigned FSIM5                  :1;
        unsigned FSIM6                  :1;
        unsigned FSIM7                  :1;
    };
    struct {
        unsigned G4FSIM0                :1;
        unsigned G4FSIM1                :1;
        unsigned G4FSIM2                :1;
        unsigned G4FSIM3                :1;
        unsigned G4FSIM4                :1;
        unsigned G4FSIM5                :1;
        unsigned G4FSIM6                :1;
        unsigned G4FSIM7                :1;
    };
} COG4FSIM0bits_t;
extern volatile COG4FSIM0bits_t COG4FSIM0bits __at(0x89B);
// bitfield macros
#define _COG4FSIM0_FSIM0_POSN                               0x0
#define _COG4FSIM0_FSIM0_POSITION                           0x0
#define _COG4FSIM0_FSIM0_SIZE                               0x1
#define _COG4FSIM0_FSIM0_LENGTH                             0x1
#define _COG4FSIM0_FSIM0_MASK                               0x1
#define _COG4FSIM0_FSIM1_POSN                               0x1
#define _COG4FSIM0_FSIM1_POSITION                           0x1
#define _COG4FSIM0_FSIM1_SIZE                               0x1
#define _COG4FSIM0_FSIM1_LENGTH                             0x1
#define _COG4FSIM0_FSIM1_MASK                               0x2
#define _COG4FSIM0_FSIM2_POSN                               0x2
#define _COG4FSIM0_FSIM2_POSITION                           0x2
#define _COG4FSIM0_FSIM2_SIZE                               0x1
#define _COG4FSIM0_FSIM2_LENGTH                             0x1
#define _COG4FSIM0_FSIM2_MASK                               0x4
#define _COG4FSIM0_FSIM3_POSN                               0x3
#define _COG4FSIM0_FSIM3_POSITION                           0x3
#define _COG4FSIM0_FSIM3_SIZE                               0x1
#define _COG4FSIM0_FSIM3_LENGTH                             0x1
#define _COG4FSIM0_FSIM3_MASK                               0x8
#define _COG4FSIM0_FSIM4_POSN                               0x4
#define _COG4FSIM0_FSIM4_POSITION                           0x4
#define _COG4FSIM0_FSIM4_SIZE                               0x1
#define _COG4FSIM0_FSIM4_LENGTH                             0x1
#define _COG4FSIM0_FSIM4_MASK                               0x10
#define _COG4FSIM0_FSIM5_POSN                               0x5
#define _COG4FSIM0_FSIM5_POSITION                           0x5
#define _COG4FSIM0_FSIM5_SIZE                               0x1
#define _COG4FSIM0_FSIM5_LENGTH                             0x1
#define _COG4FSIM0_FSIM5_MASK                               0x20
#define _COG4FSIM0_FSIM6_POSN                               0x6
#define _COG4FSIM0_FSIM6_POSITION                           0x6
#define _COG4FSIM0_FSIM6_SIZE                               0x1
#define _COG4FSIM0_FSIM6_LENGTH                             0x1
#define _COG4FSIM0_FSIM6_MASK                               0x40
#define _COG4FSIM0_FSIM7_POSN                               0x7
#define _COG4FSIM0_FSIM7_POSITION                           0x7
#define _COG4FSIM0_FSIM7_SIZE                               0x1
#define _COG4FSIM0_FSIM7_LENGTH                             0x1
#define _COG4FSIM0_FSIM7_MASK                               0x80
#define _COG4FSIM0_G4FSIM0_POSN                             0x0
#define _COG4FSIM0_G4FSIM0_POSITION                         0x0
#define _COG4FSIM0_G4FSIM0_SIZE                             0x1
#define _COG4FSIM0_G4FSIM0_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM0_MASK                             0x1
#define _COG4FSIM0_G4FSIM1_POSN                             0x1
#define _COG4FSIM0_G4FSIM1_POSITION                         0x1
#define _COG4FSIM0_G4FSIM1_SIZE                             0x1
#define _COG4FSIM0_G4FSIM1_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM1_MASK                             0x2
#define _COG4FSIM0_G4FSIM2_POSN                             0x2
#define _COG4FSIM0_G4FSIM2_POSITION                         0x2
#define _COG4FSIM0_G4FSIM2_SIZE                             0x1
#define _COG4FSIM0_G4FSIM2_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM2_MASK                             0x4
#define _COG4FSIM0_G4FSIM3_POSN                             0x3
#define _COG4FSIM0_G4FSIM3_POSITION                         0x3
#define _COG4FSIM0_G4FSIM3_SIZE                             0x1
#define _COG4FSIM0_G4FSIM3_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM3_MASK                             0x8
#define _COG4FSIM0_G4FSIM4_POSN                             0x4
#define _COG4FSIM0_G4FSIM4_POSITION                         0x4
#define _COG4FSIM0_G4FSIM4_SIZE                             0x1
#define _COG4FSIM0_G4FSIM4_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM4_MASK                             0x10
#define _COG4FSIM0_G4FSIM5_POSN                             0x5
#define _COG4FSIM0_G4FSIM5_POSITION                         0x5
#define _COG4FSIM0_G4FSIM5_SIZE                             0x1
#define _COG4FSIM0_G4FSIM5_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM5_MASK                             0x20
#define _COG4FSIM0_G4FSIM6_POSN                             0x6
#define _COG4FSIM0_G4FSIM6_POSITION                         0x6
#define _COG4FSIM0_G4FSIM6_SIZE                             0x1
#define _COG4FSIM0_G4FSIM6_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM6_MASK                             0x40
#define _COG4FSIM0_G4FSIM7_POSN                             0x7
#define _COG4FSIM0_G4FSIM7_POSITION                         0x7
#define _COG4FSIM0_G4FSIM7_SIZE                             0x1
#define _COG4FSIM0_G4FSIM7_LENGTH                           0x1
#define _COG4FSIM0_G4FSIM7_MASK                             0x80

