MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: COG4ASD0
#define COG4ASD0 COG4ASD0
extern volatile unsigned char           COG4ASD0            __at(0x89D);
#ifndef _LIB_BUILD
asm("COG4ASD0 equ 089Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned ASDAC                  :2;
        unsigned ASDBD                  :2;
        unsigned ASREN                  :1;
        unsigned ASE                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned ASDAC0                 :1;
        unsigned ASDAC1                 :1;
        unsigned ASDBD0                 :1;
        unsigned ASDBD1                 :1;
        unsigned ARSEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G4ASDAC                :2;
        unsigned G4ASDBD                :2;
        unsigned G4ARSEN                :1;
        unsigned G4ASE                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G4ASDAC0               :1;
        unsigned G4ASDAC1               :1;
        unsigned G4ASDBD0               :1;
        unsigned G4ASDBD1               :1;
        unsigned G4ASREN                :1;
    };
} COG4ASD0bits_t;
extern volatile COG4ASD0bits_t COG4ASD0bits __at(0x89D);
// bitfield macros
#define _COG4ASD0_ASDAC_POSN                                0x2
#define _COG4ASD0_ASDAC_POSITION                            0x2
#define _COG4ASD0_ASDAC_SIZE                                0x2
#define _COG4ASD0_ASDAC_LENGTH                              0x2
#define _COG4ASD0_ASDAC_MASK                                0xC
#define _COG4ASD0_ASDBD_POSN                                0x4
#define _COG4ASD0_ASDBD_POSITION                            0x4
#define _COG4ASD0_ASDBD_SIZE                                0x2
#define _COG4ASD0_ASDBD_LENGTH                              0x2
#define _COG4ASD0_ASDBD_MASK                                0x30
#define _COG4ASD0_ASREN_POSN                                0x6
#define _COG4ASD0_ASREN_POSITION                            0x6
#define _COG4ASD0_ASREN_SIZE                                0x1
#define _COG4ASD0_ASREN_LENGTH                              0x1
#define _COG4ASD0_ASREN_MASK                                0x40
#define _COG4ASD0_ASE_POSN                                  0x7
#define _COG4ASD0_ASE_POSITION                              0x7
#define _COG4ASD0_ASE_SIZE                                  0x1
#define _COG4ASD0_ASE_LENGTH                                0x1
#define _COG4ASD0_ASE_MASK                                  0x80
#define _COG4ASD0_ASDAC0_POSN                               0x2
#define _COG4ASD0_ASDAC0_POSITION                           0x2
#define _COG4ASD0_ASDAC0_SIZE                               0x1
#define _COG4ASD0_ASDAC0_LENGTH                             0x1
#define _COG4ASD0_ASDAC0_MASK                               0x4
#define _COG4ASD0_ASDAC1_POSN                               0x3
#define _COG4ASD0_ASDAC1_POSITION                           0x3
#define _COG4ASD0_ASDAC1_SIZE                               0x1
#define _COG4ASD0_ASDAC1_LENGTH                             0x1
#define _COG4ASD0_ASDAC1_MASK                               0x8
#define _COG4ASD0_ASDBD0_POSN                               0x4
#define _COG4ASD0_ASDBD0_POSITION                           0x4
#define _COG4ASD0_ASDBD0_SIZE                               0x1
#define _COG4ASD0_ASDBD0_LENGTH                             0x1
#define _COG4ASD0_ASDBD0_MASK                               0x10
#define _COG4ASD0_ASDBD1_POSN                               0x5
#define _COG4ASD0_ASDBD1_POSITION                           0x5
#define _COG4ASD0_ASDBD1_SIZE                               0x1
#define _COG4ASD0_ASDBD1_LENGTH                             0x1
#define _COG4ASD0_ASDBD1_MASK                               0x20
#define _COG4ASD0_ARSEN_POSN                                0x6
#define _COG4ASD0_ARSEN_POSITION                            0x6
#define _COG4ASD0_ARSEN_SIZE                                0x1
#define _COG4ASD0_ARSEN_LENGTH                              0x1
#define _COG4ASD0_ARSEN_MASK                                0x40
#define _COG4ASD0_G4ASDAC_POSN                              0x2
#define _COG4ASD0_G4ASDAC_POSITION                          0x2
#define _COG4ASD0_G4ASDAC_SIZE                              0x2
#define _COG4ASD0_G4ASDAC_LENGTH                            0x2
#define _COG4ASD0_G4ASDAC_MASK                              0xC
#define _COG4ASD0_G4ASDBD_POSN                              0x4
#define _COG4ASD0_G4ASDBD_POSITION                          0x4
#define _COG4ASD0_G4ASDBD_SIZE                              0x2
#define _COG4ASD0_G4ASDBD_LENGTH                            0x2
#define _COG4ASD0_G4ASDBD_MASK                              0x30
#define _COG4ASD0_G4ARSEN_POSN                              0x6
#define _COG4ASD0_G4ARSEN_POSITION                          0x6
#define _COG4ASD0_G4ARSEN_SIZE                              0x1
#define _COG4ASD0_G4ARSEN_LENGTH                            0x1
#define _COG4ASD0_G4ARSEN_MASK                              0x40
#define _COG4ASD0_G4ASE_POSN                                0x7
#define _COG4ASD0_G4ASE_POSITION                            0x7
#define _COG4ASD0_G4ASE_SIZE                                0x1
#define _COG4ASD0_G4ASE_LENGTH                              0x1
#define _COG4ASD0_G4ASE_MASK                                0x80
#define _COG4ASD0_G4ASDAC0_POSN                             0x2
#define _COG4ASD0_G4ASDAC0_POSITION                         0x2
#define _COG4ASD0_G4ASDAC0_SIZE                             0x1
#define _COG4ASD0_G4ASDAC0_LENGTH                           0x1
#define _COG4ASD0_G4ASDAC0_MASK                             0x4
#define _COG4ASD0_G4ASDAC1_POSN                             0x3
#define _COG4ASD0_G4ASDAC1_POSITION                         0x3
#define _COG4ASD0_G4ASDAC1_SIZE                             0x1
#define _COG4ASD0_G4ASDAC1_LENGTH                           0x1
#define _COG4ASD0_G4ASDAC1_MASK                             0x8
#define _COG4ASD0_G4ASDBD0_POSN                             0x4
#define _COG4ASD0_G4ASDBD0_POSITION                         0x4
#define _COG4ASD0_G4ASDBD0_SIZE                             0x1
#define _COG4ASD0_G4ASDBD0_LENGTH                           0x1
#define _COG4ASD0_G4ASDBD0_MASK                             0x10
#define _COG4ASD0_G4ASDBD1_POSN                             0x5
#define _COG4ASD0_G4ASDBD1_POSITION                         0x5
#define _COG4ASD0_G4ASDBD1_SIZE                             0x1
#define _COG4ASD0_G4ASDBD1_LENGTH                           0x1
#define _COG4ASD0_G4ASDBD1_MASK                             0x20
#define _COG4ASD0_G4ASREN_POSN                              0x6
#define _COG4ASD0_G4ASREN_POSITION                          0x6
#define _COG4ASD0_G4ASREN_SIZE                              0x1
#define _COG4ASD0_G4ASREN_LENGTH                            0x1
#define _COG4ASD0_G4ASREN_MASK                              0x40

// Register: COG4ASD1
#define COG4ASD1 COG4ASD1
extern volatile unsigned char           COG4ASD1            __at(0x89E);
#ifndef _LIB_BUILD
asm("COG4ASD1 equ 089Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
        unsigned AS7E                   :1;
    };
    struct {
        unsigned G4AS0E                 :1;
        unsigned G4AS1E                 :1;
        unsigned G4AS2E                 :1;
        unsigned G4AS3E                 :1;
        unsigned G4AS4E                 :1;
        unsigned G4AS5E                 :1;
        unsigned G4AS6E                 :1;
        unsigned G4AS7E                 :1;
    };
} COG4ASD1bits_t;
extern volatile COG4ASD1bits_t COG4ASD1bits __at(0x89E);
// bitfield macros
#define _COG4ASD1_AS0E_POSN                                 0x0
#define _COG4ASD1_AS0E_POSITION                             0x0
#define _COG4ASD1_AS0E_SIZE                                 0x1
#define _COG4ASD1_AS0E_LENGTH                               0x1
#define _COG4ASD1_AS0E_MASK                                 0x1
#define _COG4ASD1_AS1E_POSN                                 0x1
#define _COG4ASD1_AS1E_POSITION                             0x1
#define _COG4ASD1_AS1E_SIZE                                 0x1
#define _COG4ASD1_AS1E_LENGTH                               0x1
#define _COG4ASD1_AS1E_MASK                                 0x2
#define _COG4ASD1_AS2E_POSN                                 0x2
#define _COG4ASD1_AS2E_POSITION                             0x2
#define _COG4ASD1_AS2E_SIZE                                 0x1
#define _COG4ASD1_AS2E_LENGTH                               0x1
#define _COG4ASD1_AS2E_MASK                                 0x4
#define _COG4ASD1_AS3E_POSN                                 0x3
#define _COG4ASD1_AS3E_POSITION                             0x3
#define _COG4ASD1_AS3E_SIZE                                 0x1
#define _COG4ASD1_AS3E_LENGTH                               0x1
#define _COG4ASD1_AS3E_MASK                                 0x8
#define _COG4ASD1_AS4E_POSN                                 0x4
#define _COG4ASD1_AS4E_POSITION                             0x4
#define _COG4ASD1_AS4E_SIZE                                 0x1
#define _COG4ASD1_AS4E_LENGTH                               0x1
#define _COG4ASD1_AS4E_MASK                                 0x10
#define _COG4ASD1_AS5E_POSN                                 0x5
#define _COG4ASD1_AS5E_POSITION                             0x5
#define _COG4ASD1_AS5E_SIZE                                 0x1
#define _COG4ASD1_AS5E_LENGTH                               0x1
#define _COG4ASD1_AS5E_MASK                                 0x20
#define _COG4ASD1_AS6E_POSN                                 0x6
#define _COG4ASD1_AS6E_POSITION                             0x6
#define _COG4ASD1_AS6E_SIZE                                 0x1
#define _COG4ASD1_AS6E_LENGTH                               0x1
#define _COG4ASD1_AS6E_MASK                                 0x40
#define _COG4ASD1_AS7E_POSN                                 0x7
#define _COG4ASD1_AS7E_POSITION                             0x7
#define _COG4ASD1_AS7E_SIZE                                 0x1
#define _COG4ASD1_AS7E_LENGTH                               0x1
#define _COG4ASD1_AS7E_MASK                                 0x80
#define _COG4ASD1_G4AS0E_POSN                               0x0
#define _COG4ASD1_G4AS0E_POSITION                           0x0
#define _COG4ASD1_G4AS0E_SIZE                               0x1
#define _COG4ASD1_G4AS0E_LENGTH                             0x1
#define _COG4ASD1_G4AS0E_MASK                               0x1
#define _COG4ASD1_G4AS1E_POSN                               0x1
#define _COG4ASD1_G4AS1E_POSITION                           0x1
#define _COG4ASD1_G4AS1E_SIZE                               0x1
#define _COG4ASD1_G4AS1E_LENGTH                             0x1
#define _COG4ASD1_G4AS1E_MASK                               0x2
#define _COG4ASD1_G4AS2E_POSN                               0x2
#define _COG4ASD1_G4AS2E_POSITION                           0x2
#define _COG4ASD1_G4AS2E_SIZE                               0x1
#define _COG4ASD1_G4AS2E_LENGTH                             0x1
#define _COG4ASD1_G4AS2E_MASK                               0x4
#define _COG4ASD1_G4AS3E_POSN                               0x3
#define _COG4ASD1_G4AS3E_POSITION                           0x3
#define _COG4ASD1_G4AS3E_SIZE                               0x1
#define _COG4ASD1_G4AS3E_LENGTH                             0x1
#define _COG4ASD1_G4AS3E_MASK                               0x8
#define _COG4ASD1_G4AS4E_POSN                               0x4
#define _COG4ASD1_G4AS4E_POSITION                           0x4
#define _COG4ASD1_G4AS4E_SIZE                               0x1
#define _COG4ASD1_G4AS4E_LENGTH                             0x1
#define _COG4ASD1_G4AS4E_MASK                               0x10
#define _COG4ASD1_G4AS5E_POSN                               0x5
#define _COG4ASD1_G4AS5E_POSITION                           0x5
#define _COG4ASD1_G4AS5E_SIZE                               0x1
#define _COG4ASD1_G4AS5E_LENGTH                             0x1
#define _COG4ASD1_G4AS5E_MASK                               0x20
#define _COG4ASD1_G4AS6E_POSN                               0x6
#define _COG4ASD1_G4AS6E_POSITION                           0x6
#define _COG4ASD1_G4AS6E_SIZE                               0x1
#define _COG4ASD1_G4AS6E_LENGTH                             0x1
#define _COG4ASD1_G4AS6E_MASK                               0x40
#define _COG4ASD1_G4AS7E_POSN                               0x7
#define _COG4ASD1_G4AS7E_POSITION                           0x7
#define _COG4ASD1_G4AS7E_SIZE                               0x1
#define _COG4ASD1_G4AS7E_LENGTH                             0x1
#define _COG4ASD1_G4AS7E_MASK                               0x80

// Register: COG4STR
#define COG4STR COG4STR
extern volatile unsigned char           COG4STR             __at(0x89F);
#ifndef _LIB_BUILD
asm("COG4STR equ 089Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned SDATA                  :1;
        unsigned SDATB                  :1;
        unsigned SDATC                  :1;
        unsigned SDATD                  :1;
    };
    struct {
        unsigned G4STRA                 :1;
        unsigned G4STRB                 :1;
        unsigned G4STRC                 :1;
        unsigned G4STRD                 :1;
        unsigned G4SDATA                :1;
        unsigned G4SDATB                :1;
        unsigned G4SDATC                :1;
        unsigned G4SDATD                :1;
    };
} COG4STRbits_t;
extern volatile COG4STRbits_t COG4STRbits __at(0x89F);
// bitfield macros
#define _COG4STR_STRA_POSN                                  0x0
#define _COG4STR_STRA_POSITION                              0x0
#define _COG4STR_STRA_SIZE                                  0x1
#define _COG4STR_STRA_LENGTH                                0x1
#define _COG4STR_STRA_MASK                                  0x1
#define _COG4STR_STRB_POSN                                  0x1
#define _COG4STR_STRB_POSITION                              0x1
#define _COG4STR_STRB_SIZE                                  0x1
#define _COG4STR_STRB_LENGTH                                0x1
#define _COG4STR_STRB_MASK                                  0x2
#define _COG4STR_STRC_POSN                                  0x2
#define _COG4STR_STRC_POSITION                              0x2
#define _COG4STR_STRC_SIZE                                  0x1
#define _COG4STR_STRC_LENGTH                                0x1
#define _COG4STR_STRC_MASK                                  0x4
#define _COG4STR_STRD_POSN                                  0x3
#define _COG4STR_STRD_POSITION                              0x3
#define _COG4STR_STRD_SIZE                                  0x1
#define _COG4STR_STRD_LENGTH                                0x1
#define _COG4STR_STRD_MASK                                  0x8
#define _COG4STR_SDATA_POSN                                 0x4
#define _COG4STR_SDATA_POSITION                             0x4
#define _COG4STR_SDATA_SIZE                                 0x1
#define _COG4STR_SDATA_LENGTH                               0x1
#define _COG4STR_SDATA_MASK                                 0x10
#define _COG4STR_SDATB_POSN                                 0x5
#define _COG4STR_SDATB_POSITION                             0x5
#define _COG4STR_SDATB_SIZE                                 0x1
#define _COG4STR_SDATB_LENGTH                               0x1
#define _COG4STR_SDATB_MASK                                 0x20
#define _COG4STR_SDATC_POSN                                 0x6
#define _COG4STR_SDATC_POSITION                             0x6
#define _COG4STR_SDATC_SIZE                                 0x1
#define _COG4STR_SDATC_LENGTH                               0x1
#define _COG4STR_SDATC_MASK                                 0x40
#define _COG4STR_SDATD_POSN                                 0x7
#define _COG4STR_SDATD_POSITION                             0x7
#define _COG4STR_SDATD_SIZE                                 0x1
#define _COG4STR_SDATD_LENGTH                               0x1
#define _COG4STR_SDATD_MASK                                 0x80
#define _COG4STR_G4STRA_POSN                                0x0
#define _COG4STR_G4STRA_POSITION                            0x0
#define _COG4STR_G4STRA_SIZE                                0x1
#define _COG4STR_G4STRA_LENGTH                              0x1
#define _COG4STR_G4STRA_MASK                                0x1
#define _COG4STR_G4STRB_POSN                                0x1
#define _COG4STR_G4STRB_POSITION                            0x1
#define _COG4STR_G4STRB_SIZE                                0x1
#define _COG4STR_G4STRB_LENGTH                              0x1
#define _COG4STR_G4STRB_MASK                                0x2
#define _COG4STR_G4STRC_POSN                                0x2
#define _COG4STR_G4STRC_POSITION                            0x2
#define _COG4STR_G4STRC_SIZE                                0x1
#define _COG4STR_G4STRC_LENGTH                              0x1
#define _COG4STR_G4STRC_MASK                                0x4
#define _COG4STR_G4STRD_POSN                                0x3
#define _COG4STR_G4STRD_POSITION                            0x3
#define _COG4STR_G4STRD_SIZE                                0x1
#define _COG4STR_G4STRD_LENGTH                              0x1
#define _COG4STR_G4STRD_MASK                                0x8
#define _COG4STR_G4SDATA_POSN                               0x4
#define _COG4STR_G4SDATA_POSITION                           0x4
#define _COG4STR_G4SDATA_SIZE                               0x1
#define _COG4STR_G4SDATA_LENGTH                             0x1
#define _COG4STR_G4SDATA_MASK                               0x10
#define _COG4STR_G4SDATB_POSN                               0x5
#define _COG4STR_G4SDATB_POSITION                           0x5
#define _COG4STR_G4SDATB_SIZE                               0x1
#define _COG4STR_G4SDATB_LENGTH                             0x1
#define _COG4STR_G4SDATB_MASK                               0x20
#define _COG4STR_G4SDATC_POSN                               0x6
#define _COG4STR_G4SDATC_POSITION                           0x6
#define _COG4STR_G4SDATC_SIZE                               0x1
#define _COG4STR_G4SDATC_LENGTH                             0x1
#define _COG4STR_G4SDATC_MASK                               0x40
#define _COG4STR_G4SDATD_POSN                               0x7
#define _COG4STR_G4SDATD_POSITION                           0x7
#define _COG4STR_G4SDATD_SIZE                               0x1
#define _COG4STR_G4SDATD_LENGTH                             0x1
#define _COG4STR_G4SDATD_MASK                               0x80

// Register: CM4CON0
#define CM4CON0 CM4CON0
extern volatile unsigned char           CM4CON0             __at(0x90C);
#ifndef _LIB_BUILD
asm("CM4CON0 equ 090Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C4SYNC                 :1;
        unsigned C4HYS                  :1;
        unsigned                        :1;
        unsigned C4ZLF                  :1;
        unsigned C4POL                  :1;
        unsigned                        :1;
        unsigned C4OUT                  :1;
        unsigned C4ON                   :1;
    };
} CM4CON0bits_t;
