MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile CM4NSELbits_t CM4NSELbits __at(0x90E);
// bitfield macros
#define _CM4NSEL_NCH_POSN                                   0x0
#define _CM4NSEL_NCH_POSITION                               0x0
#define _CM4NSEL_NCH_SIZE                                   0x4
#define _CM4NSEL_NCH_LENGTH                                 0x4
#define _CM4NSEL_NCH_MASK                                   0xF
#define _CM4NSEL_C4NCH_POSN                                 0x0
#define _CM4NSEL_C4NCH_POSITION                             0x0
#define _CM4NSEL_C4NCH_SIZE                                 0x4
#define _CM4NSEL_C4NCH_LENGTH                               0x4
#define _CM4NSEL_C4NCH_MASK                                 0xF
#define _CM4NSEL_C4NCH0_POSN                                0x0
#define _CM4NSEL_C4NCH0_POSITION                            0x0
#define _CM4NSEL_C4NCH0_SIZE                                0x1
#define _CM4NSEL_C4NCH0_LENGTH                              0x1
#define _CM4NSEL_C4NCH0_MASK                                0x1
#define _CM4NSEL_C4NCH1_POSN                                0x1
#define _CM4NSEL_C4NCH1_POSITION                            0x1
#define _CM4NSEL_C4NCH1_SIZE                                0x1
#define _CM4NSEL_C4NCH1_LENGTH                              0x1
#define _CM4NSEL_C4NCH1_MASK                                0x2
#define _CM4NSEL_C4NCH2_POSN                                0x2
#define _CM4NSEL_C4NCH2_POSITION                            0x2
#define _CM4NSEL_C4NCH2_SIZE                                0x1
#define _CM4NSEL_C4NCH2_LENGTH                              0x1
#define _CM4NSEL_C4NCH2_MASK                                0x4
#define _CM4NSEL_C4NCH3_POSN                                0x3
#define _CM4NSEL_C4NCH3_POSITION                            0x3
#define _CM4NSEL_C4NCH3_SIZE                                0x1
#define _CM4NSEL_C4NCH3_LENGTH                              0x1
#define _CM4NSEL_C4NCH3_MASK                                0x8

// Register: CM4PSEL
#define CM4PSEL CM4PSEL
extern volatile unsigned char           CM4PSEL             __at(0x90F);
#ifndef _LIB_BUILD
asm("CM4PSEL equ 090Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C4PCH                  :4;
    };
    struct {
        unsigned C4PCH0                 :1;
        unsigned C4PCH1                 :1;
        unsigned C4PCH2                 :1;
        unsigned C4PCH3                 :1;
    };
} CM4PSELbits_t;
extern volatile CM4PSELbits_t CM4PSELbits __at(0x90F);
// bitfield macros
#define _CM4PSEL_PCH_POSN                                   0x0
#define _CM4PSEL_PCH_POSITION                               0x0
#define _CM4PSEL_PCH_SIZE                                   0x4
#define _CM4PSEL_PCH_LENGTH                                 0x4
#define _CM4PSEL_PCH_MASK                                   0xF
#define _CM4PSEL_PCH0_POSN                                  0x0
#define _CM4PSEL_PCH0_POSITION                              0x0
#define _CM4PSEL_PCH0_SIZE                                  0x1
#define _CM4PSEL_PCH0_LENGTH                                0x1
#define _CM4PSEL_PCH0_MASK                                  0x1
#define _CM4PSEL_PCH1_POSN                                  0x1
#define _CM4PSEL_PCH1_POSITION                              0x1
#define _CM4PSEL_PCH1_SIZE                                  0x1
#define _CM4PSEL_PCH1_LENGTH                                0x1
#define _CM4PSEL_PCH1_MASK                                  0x2
#define _CM4PSEL_PCH2_POSN                                  0x2
#define _CM4PSEL_PCH2_POSITION                              0x2
#define _CM4PSEL_PCH2_SIZE                                  0x1
#define _CM4PSEL_PCH2_LENGTH                                0x1
#define _CM4PSEL_PCH2_MASK                                  0x4
#define _CM4PSEL_PCH3_POSN                                  0x3
#define _CM4PSEL_PCH3_POSITION                              0x3
#define _CM4PSEL_PCH3_SIZE                                  0x1
#define _CM4PSEL_PCH3_LENGTH                                0x1
#define _CM4PSEL_PCH3_MASK                                  0x8
#define _CM4PSEL_C4PCH_POSN                                 0x0
#define _CM4PSEL_C4PCH_POSITION                             0x0
#define _CM4PSEL_C4PCH_SIZE                                 0x4
#define _CM4PSEL_C4PCH_LENGTH                               0x4
#define _CM4PSEL_C4PCH_MASK                                 0xF
#define _CM4PSEL_C4PCH0_POSN                                0x0
#define _CM4PSEL_C4PCH0_POSITION                            0x0
#define _CM4PSEL_C4PCH0_SIZE                                0x1
#define _CM4PSEL_C4PCH0_LENGTH                              0x1
#define _CM4PSEL_C4PCH0_MASK                                0x1
#define _CM4PSEL_C4PCH1_POSN                                0x1
#define _CM4PSEL_C4PCH1_POSITION                            0x1
#define _CM4PSEL_C4PCH1_SIZE                                0x1
#define _CM4PSEL_C4PCH1_LENGTH                              0x1
#define _CM4PSEL_C4PCH1_MASK                                0x2
#define _CM4PSEL_C4PCH2_POSN                                0x2
#define _CM4PSEL_C4PCH2_POSITION                            0x2
#define _CM4PSEL_C4PCH2_SIZE                                0x1
#define _CM4PSEL_C4PCH2_LENGTH                              0x1
#define _CM4PSEL_C4PCH2_MASK                                0x4
#define _CM4PSEL_C4PCH3_POSN                                0x3
#define _CM4PSEL_C4PCH3_POSITION                            0x3
#define _CM4PSEL_C4PCH3_SIZE                                0x1
#define _CM4PSEL_C4PCH3_LENGTH                              0x1
#define _CM4PSEL_C4PCH3_MASK                                0x8

// Register: CM5CON0
#define CM5CON0 CM5CON0
extern volatile unsigned char           CM5CON0             __at(0x910);
#ifndef _LIB_BUILD
asm("CM5CON0 equ 0910h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C5SYNC                 :1;
        unsigned C5HYS                  :1;
        unsigned                        :1;
        unsigned C5ZLF                  :1;
        unsigned C5POL                  :1;
        unsigned                        :1;
        unsigned C5OUT                  :1;
        unsigned C5ON                   :1;
    };
} CM5CON0bits_t;
