MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: PWM5OF
#define PWM5OF PWM5OF
extern volatile unsigned short          PWM5OF              __at(0xD97);
#ifndef _LIB_BUILD
asm("PWM5OF equ 0D97h");
#endif

// Register: PWM5OFL
#define PWM5OFL PWM5OFL
extern volatile unsigned char           PWM5OFL             __at(0xD97);
#ifndef _LIB_BUILD
asm("PWM5OFL equ 0D97h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM5OFL0               :1;
        unsigned PWM5OFL1               :1;
        unsigned PWM5OFL2               :1;
        unsigned PWM5OFL3               :1;
        unsigned PWM5OFL4               :1;
        unsigned PWM5OFL5               :1;
        unsigned PWM5OFL6               :1;
        unsigned PWM5OFL7               :1;
    };
    struct {
        unsigned PWM5OFL                :8;
    };
} PWM5OFLbits_t;
extern volatile PWM5OFLbits_t PWM5OFLbits __at(0xD97);
// bitfield macros
#define _PWM5OFL_OF_POSN                                    0x0
#define _PWM5OFL_OF_POSITION                                0x0
#define _PWM5OFL_OF_SIZE                                    0x8
#define _PWM5OFL_OF_LENGTH                                  0x8
#define _PWM5OFL_OF_MASK                                    0xFF
#define _PWM5OFL_PWM5OFL0_POSN                              0x0
#define _PWM5OFL_PWM5OFL0_POSITION                          0x0
#define _PWM5OFL_PWM5OFL0_SIZE                              0x1
#define _PWM5OFL_PWM5OFL0_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL0_MASK                              0x1
#define _PWM5OFL_PWM5OFL1_POSN                              0x1
#define _PWM5OFL_PWM5OFL1_POSITION                          0x1
#define _PWM5OFL_PWM5OFL1_SIZE                              0x1
#define _PWM5OFL_PWM5OFL1_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL1_MASK                              0x2
#define _PWM5OFL_PWM5OFL2_POSN                              0x2
#define _PWM5OFL_PWM5OFL2_POSITION                          0x2
#define _PWM5OFL_PWM5OFL2_SIZE                              0x1
#define _PWM5OFL_PWM5OFL2_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL2_MASK                              0x4
#define _PWM5OFL_PWM5OFL3_POSN                              0x3
#define _PWM5OFL_PWM5OFL3_POSITION                          0x3
#define _PWM5OFL_PWM5OFL3_SIZE                              0x1
#define _PWM5OFL_PWM5OFL3_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL3_MASK                              0x8
#define _PWM5OFL_PWM5OFL4_POSN                              0x4
#define _PWM5OFL_PWM5OFL4_POSITION                          0x4
#define _PWM5OFL_PWM5OFL4_SIZE                              0x1
#define _PWM5OFL_PWM5OFL4_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL4_MASK                              0x10
#define _PWM5OFL_PWM5OFL5_POSN                              0x5
#define _PWM5OFL_PWM5OFL5_POSITION                          0x5
#define _PWM5OFL_PWM5OFL5_SIZE                              0x1
#define _PWM5OFL_PWM5OFL5_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL5_MASK                              0x20
#define _PWM5OFL_PWM5OFL6_POSN                              0x6
#define _PWM5OFL_PWM5OFL6_POSITION                          0x6
#define _PWM5OFL_PWM5OFL6_SIZE                              0x1
#define _PWM5OFL_PWM5OFL6_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL6_MASK                              0x40
#define _PWM5OFL_PWM5OFL7_POSN                              0x7
#define _PWM5OFL_PWM5OFL7_POSITION                          0x7
#define _PWM5OFL_PWM5OFL7_SIZE                              0x1
#define _PWM5OFL_PWM5OFL7_LENGTH                            0x1
#define _PWM5OFL_PWM5OFL7_MASK                              0x80
#define _PWM5OFL_PWM5OFL_POSN                               0x0
#define _PWM5OFL_PWM5OFL_POSITION                           0x0
#define _PWM5OFL_PWM5OFL_SIZE                               0x8
#define _PWM5OFL_PWM5OFL_LENGTH                             0x8
#define _PWM5OFL_PWM5OFL_MASK                               0xFF

// Register: PWM5OFH
#define PWM5OFH PWM5OFH
extern volatile unsigned char           PWM5OFH             __at(0xD98);
#ifndef _LIB_BUILD
asm("PWM5OFH equ 0D98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM5OFH0               :1;
        unsigned PWM5OFH1               :1;
        unsigned PWM5OFH2               :1;
        unsigned PWM5OFH3               :1;
        unsigned PWM5OFH4               :1;
        unsigned PWM5OFH5               :1;
        unsigned PWM5OFH6               :1;
        unsigned PWM5OFH7               :1;
    };
    struct {
        unsigned PWM5OFH                :8;
    };
} PWM5OFHbits_t;
extern volatile PWM5OFHbits_t PWM5OFHbits __at(0xD98);
// bitfield macros
#define _PWM5OFH_OF_POSN                                    0x0
#define _PWM5OFH_OF_POSITION                                0x0
#define _PWM5OFH_OF_SIZE                                    0x8
#define _PWM5OFH_OF_LENGTH                                  0x8
#define _PWM5OFH_OF_MASK                                    0xFF
#define _PWM5OFH_PWM5OFH0_POSN                              0x0
#define _PWM5OFH_PWM5OFH0_POSITION                          0x0
#define _PWM5OFH_PWM5OFH0_SIZE                              0x1
#define _PWM5OFH_PWM5OFH0_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH0_MASK                              0x1
#define _PWM5OFH_PWM5OFH1_POSN                              0x1
#define _PWM5OFH_PWM5OFH1_POSITION                          0x1
#define _PWM5OFH_PWM5OFH1_SIZE                              0x1
#define _PWM5OFH_PWM5OFH1_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH1_MASK                              0x2
#define _PWM5OFH_PWM5OFH2_POSN                              0x2
#define _PWM5OFH_PWM5OFH2_POSITION                          0x2
#define _PWM5OFH_PWM5OFH2_SIZE                              0x1
#define _PWM5OFH_PWM5OFH2_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH2_MASK                              0x4
#define _PWM5OFH_PWM5OFH3_POSN                              0x3
#define _PWM5OFH_PWM5OFH3_POSITION                          0x3
#define _PWM5OFH_PWM5OFH3_SIZE                              0x1
#define _PWM5OFH_PWM5OFH3_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH3_MASK                              0x8
#define _PWM5OFH_PWM5OFH4_POSN                              0x4
#define _PWM5OFH_PWM5OFH4_POSITION                          0x4
#define _PWM5OFH_PWM5OFH4_SIZE                              0x1
#define _PWM5OFH_PWM5OFH4_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH4_MASK                              0x10
#define _PWM5OFH_PWM5OFH5_POSN                              0x5
#define _PWM5OFH_PWM5OFH5_POSITION                          0x5
#define _PWM5OFH_PWM5OFH5_SIZE                              0x1
#define _PWM5OFH_PWM5OFH5_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH5_MASK                              0x20
#define _PWM5OFH_PWM5OFH6_POSN                              0x6
#define _PWM5OFH_PWM5OFH6_POSITION                          0x6
#define _PWM5OFH_PWM5OFH6_SIZE                              0x1
#define _PWM5OFH_PWM5OFH6_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH6_MASK                              0x40
#define _PWM5OFH_PWM5OFH7_POSN                              0x7
#define _PWM5OFH_PWM5OFH7_POSITION                          0x7
#define _PWM5OFH_PWM5OFH7_SIZE                              0x1
#define _PWM5OFH_PWM5OFH7_LENGTH                            0x1
#define _PWM5OFH_PWM5OFH7_MASK                              0x80
#define _PWM5OFH_PWM5OFH_POSN                               0x0
#define _PWM5OFH_PWM5OFH_POSITION                           0x0
#define _PWM5OFH_PWM5OFH_SIZE                               0x8
#define _PWM5OFH_PWM5OFH_LENGTH                             0x8
#define _PWM5OFH_PWM5OFH_MASK                               0xFF

// Register: PWM5TMR
#define PWM5TMR PWM5TMR
extern volatile unsigned short          PWM5TMR             __at(0xD99);
#ifndef _LIB_BUILD
asm("PWM5TMR equ 0D99h");
#endif

