MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile PWM6OFLbits_t PWM6OFLbits __at(0xDA7);
// bitfield macros
#define _PWM6OFL_OF_POSN                                    0x0
#define _PWM6OFL_OF_POSITION                                0x0
#define _PWM6OFL_OF_SIZE                                    0x8
#define _PWM6OFL_OF_LENGTH                                  0x8
#define _PWM6OFL_OF_MASK                                    0xFF
#define _PWM6OFL_PWM6OFL0_POSN                              0x0
#define _PWM6OFL_PWM6OFL0_POSITION                          0x0
#define _PWM6OFL_PWM6OFL0_SIZE                              0x1
#define _PWM6OFL_PWM6OFL0_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL0_MASK                              0x1
#define _PWM6OFL_PWM6OFL1_POSN                              0x1
#define _PWM6OFL_PWM6OFL1_POSITION                          0x1
#define _PWM6OFL_PWM6OFL1_SIZE                              0x1
#define _PWM6OFL_PWM6OFL1_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL1_MASK                              0x2
#define _PWM6OFL_PWM6OFL2_POSN                              0x2
#define _PWM6OFL_PWM6OFL2_POSITION                          0x2
#define _PWM6OFL_PWM6OFL2_SIZE                              0x1
#define _PWM6OFL_PWM6OFL2_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL2_MASK                              0x4
#define _PWM6OFL_PWM6OFL3_POSN                              0x3
#define _PWM6OFL_PWM6OFL3_POSITION                          0x3
#define _PWM6OFL_PWM6OFL3_SIZE                              0x1
#define _PWM6OFL_PWM6OFL3_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL3_MASK                              0x8
#define _PWM6OFL_PWM6OFL4_POSN                              0x4
#define _PWM6OFL_PWM6OFL4_POSITION                          0x4
#define _PWM6OFL_PWM6OFL4_SIZE                              0x1
#define _PWM6OFL_PWM6OFL4_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL4_MASK                              0x10
#define _PWM6OFL_PWM6OFL5_POSN                              0x5
#define _PWM6OFL_PWM6OFL5_POSITION                          0x5
#define _PWM6OFL_PWM6OFL5_SIZE                              0x1
#define _PWM6OFL_PWM6OFL5_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL5_MASK                              0x20
#define _PWM6OFL_PWM6OFL6_POSN                              0x6
#define _PWM6OFL_PWM6OFL6_POSITION                          0x6
#define _PWM6OFL_PWM6OFL6_SIZE                              0x1
#define _PWM6OFL_PWM6OFL6_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL6_MASK                              0x40
#define _PWM6OFL_PWM6OFL7_POSN                              0x7
#define _PWM6OFL_PWM6OFL7_POSITION                          0x7
#define _PWM6OFL_PWM6OFL7_SIZE                              0x1
#define _PWM6OFL_PWM6OFL7_LENGTH                            0x1
#define _PWM6OFL_PWM6OFL7_MASK                              0x80
#define _PWM6OFL_PWM6OFL_POSN                               0x0
#define _PWM6OFL_PWM6OFL_POSITION                           0x0
#define _PWM6OFL_PWM6OFL_SIZE                               0x8
#define _PWM6OFL_PWM6OFL_LENGTH                             0x8
#define _PWM6OFL_PWM6OFL_MASK                               0xFF

// Register: PWM6OFH
#define PWM6OFH PWM6OFH
extern volatile unsigned char           PWM6OFH             __at(0xDA8);
#ifndef _LIB_BUILD
asm("PWM6OFH equ 0DA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OF                     :8;
    };
    struct {
        unsigned PWM6OFH0               :1;
        unsigned PWM6OFH1               :1;
        unsigned PWM6OFH2               :1;
        unsigned PWM6OFH3               :1;
        unsigned PWM6OFH4               :1;
        unsigned PWM6OFH5               :1;
        unsigned PWM6OFH6               :1;
        unsigned PWM6OFH7               :1;
    };
    struct {
        unsigned PWM6OFH                :8;
    };
} PWM6OFHbits_t;
extern volatile PWM6OFHbits_t PWM6OFHbits __at(0xDA8);
// bitfield macros
#define _PWM6OFH_OF_POSN                                    0x0
#define _PWM6OFH_OF_POSITION                                0x0
#define _PWM6OFH_OF_SIZE                                    0x8
#define _PWM6OFH_OF_LENGTH                                  0x8
#define _PWM6OFH_OF_MASK                                    0xFF
#define _PWM6OFH_PWM6OFH0_POSN                              0x0
#define _PWM6OFH_PWM6OFH0_POSITION                          0x0
#define _PWM6OFH_PWM6OFH0_SIZE                              0x1
#define _PWM6OFH_PWM6OFH0_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH0_MASK                              0x1
#define _PWM6OFH_PWM6OFH1_POSN                              0x1
#define _PWM6OFH_PWM6OFH1_POSITION                          0x1
#define _PWM6OFH_PWM6OFH1_SIZE                              0x1
#define _PWM6OFH_PWM6OFH1_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH1_MASK                              0x2
#define _PWM6OFH_PWM6OFH2_POSN                              0x2
#define _PWM6OFH_PWM6OFH2_POSITION                          0x2
#define _PWM6OFH_PWM6OFH2_SIZE                              0x1
#define _PWM6OFH_PWM6OFH2_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH2_MASK                              0x4
#define _PWM6OFH_PWM6OFH3_POSN                              0x3
#define _PWM6OFH_PWM6OFH3_POSITION                          0x3
#define _PWM6OFH_PWM6OFH3_SIZE                              0x1
#define _PWM6OFH_PWM6OFH3_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH3_MASK                              0x8
#define _PWM6OFH_PWM6OFH4_POSN                              0x4
#define _PWM6OFH_PWM6OFH4_POSITION                          0x4
#define _PWM6OFH_PWM6OFH4_SIZE                              0x1
#define _PWM6OFH_PWM6OFH4_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH4_MASK                              0x10
#define _PWM6OFH_PWM6OFH5_POSN                              0x5
#define _PWM6OFH_PWM6OFH5_POSITION                          0x5
#define _PWM6OFH_PWM6OFH5_SIZE                              0x1
#define _PWM6OFH_PWM6OFH5_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH5_MASK                              0x20
#define _PWM6OFH_PWM6OFH6_POSN                              0x6
#define _PWM6OFH_PWM6OFH6_POSITION                          0x6
#define _PWM6OFH_PWM6OFH6_SIZE                              0x1
#define _PWM6OFH_PWM6OFH6_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH6_MASK                              0x40
#define _PWM6OFH_PWM6OFH7_POSN                              0x7
#define _PWM6OFH_PWM6OFH7_POSITION                          0x7
#define _PWM6OFH_PWM6OFH7_SIZE                              0x1
#define _PWM6OFH_PWM6OFH7_LENGTH                            0x1
#define _PWM6OFH_PWM6OFH7_MASK                              0x80
#define _PWM6OFH_PWM6OFH_POSN                               0x0
#define _PWM6OFH_PWM6OFH_POSITION                           0x0
#define _PWM6OFH_PWM6OFH_SIZE                               0x8
#define _PWM6OFH_PWM6OFH_LENGTH                             0x8
#define _PWM6OFH_PWM6OFH_MASK                               0xFF

// Register: PWM6TMR
#define PWM6TMR PWM6TMR
extern volatile unsigned short          PWM6TMR             __at(0xDA9);
#ifndef _LIB_BUILD
asm("PWM6TMR equ 0DA9h");
#endif

