MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
// Register: PWM11OFCON
#define PWM11OFCON PWM11OFCON
extern volatile unsigned char           PWM11OFCON          __at(0xDC0);
#ifndef _LIB_BUILD
asm("PWM11OFCON equ 0DC0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM11OFS0              :1;
        unsigned PWM11OFS1              :1;
        unsigned                        :3;
        unsigned PWM11OFM0              :1;
        unsigned PWM11OFM1              :1;
    };
    struct {
        unsigned PWM11OFS               :2;
        unsigned                        :2;
        unsigned PWM11OFMC              :1;
        unsigned PWM11OFM               :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM11OFCONbits_t;
extern volatile PWM11OFCONbits_t PWM11OFCONbits __at(0xDC0);
// bitfield macros
#define _PWM11OFCON_OFS_POSN                                0x0
#define _PWM11OFCON_OFS_POSITION                            0x0
#define _PWM11OFCON_OFS_SIZE                                0x2
#define _PWM11OFCON_OFS_LENGTH                              0x2
#define _PWM11OFCON_OFS_MASK                                0x3
#define _PWM11OFCON_OFO_POSN                                0x4
#define _PWM11OFCON_OFO_POSITION                            0x4
#define _PWM11OFCON_OFO_SIZE                                0x1
#define _PWM11OFCON_OFO_LENGTH                              0x1
#define _PWM11OFCON_OFO_MASK                                0x10
#define _PWM11OFCON_OFM_POSN                                0x5
#define _PWM11OFCON_OFM_POSITION                            0x5
#define _PWM11OFCON_OFM_SIZE                                0x2
#define _PWM11OFCON_OFM_LENGTH                              0x2
#define _PWM11OFCON_OFM_MASK                                0x60
#define _PWM11OFCON_PWM11OFS0_POSN                          0x0
#define _PWM11OFCON_PWM11OFS0_POSITION                      0x0
#define _PWM11OFCON_PWM11OFS0_SIZE                          0x1
#define _PWM11OFCON_PWM11OFS0_LENGTH                        0x1
#define _PWM11OFCON_PWM11OFS0_MASK                          0x1
#define _PWM11OFCON_PWM11OFS1_POSN                          0x1
#define _PWM11OFCON_PWM11OFS1_POSITION                      0x1
#define _PWM11OFCON_PWM11OFS1_SIZE                          0x1
#define _PWM11OFCON_PWM11OFS1_LENGTH                        0x1
#define _PWM11OFCON_PWM11OFS1_MASK                          0x2
#define _PWM11OFCON_PWM11OFM0_POSN                          0x5
#define _PWM11OFCON_PWM11OFM0_POSITION                      0x5
#define _PWM11OFCON_PWM11OFM0_SIZE                          0x1
#define _PWM11OFCON_PWM11OFM0_LENGTH                        0x1
#define _PWM11OFCON_PWM11OFM0_MASK                          0x20
#define _PWM11OFCON_PWM11OFM1_POSN                          0x6
#define _PWM11OFCON_PWM11OFM1_POSITION                      0x6
#define _PWM11OFCON_PWM11OFM1_SIZE                          0x1
#define _PWM11OFCON_PWM11OFM1_LENGTH                        0x1
#define _PWM11OFCON_PWM11OFM1_MASK                          0x40
#define _PWM11OFCON_PWM11OFS_POSN                           0x0
#define _PWM11OFCON_PWM11OFS_POSITION                       0x0
#define _PWM11OFCON_PWM11OFS_SIZE                           0x2
#define _PWM11OFCON_PWM11OFS_LENGTH                         0x2
#define _PWM11OFCON_PWM11OFS_MASK                           0x3
#define _PWM11OFCON_PWM11OFMC_POSN                          0x4
#define _PWM11OFCON_PWM11OFMC_POSITION                      0x4
#define _PWM11OFCON_PWM11OFMC_SIZE                          0x1
#define _PWM11OFCON_PWM11OFMC_LENGTH                        0x1
#define _PWM11OFCON_PWM11OFMC_MASK                          0x10
#define _PWM11OFCON_PWM11OFM_POSN                           0x5
#define _PWM11OFCON_PWM11OFM_POSITION                       0x5
#define _PWM11OFCON_PWM11OFM_SIZE                           0x2
#define _PWM11OFCON_PWM11OFM_LENGTH                         0x2
#define _PWM11OFCON_PWM11OFM_MASK                           0x60
#define _PWM11OFCON_OFS0_POSN                               0x0
#define _PWM11OFCON_OFS0_POSITION                           0x0
#define _PWM11OFCON_OFS0_SIZE                               0x1
#define _PWM11OFCON_OFS0_LENGTH                             0x1
#define _PWM11OFCON_OFS0_MASK                               0x1
#define _PWM11OFCON_OFS1_POSN                               0x1
#define _PWM11OFCON_OFS1_POSITION                           0x1
#define _PWM11OFCON_OFS1_SIZE                               0x1
#define _PWM11OFCON_OFS1_LENGTH                             0x1
#define _PWM11OFCON_OFS1_MASK                               0x2
#define _PWM11OFCON_OFM0_POSN                               0x5
#define _PWM11OFCON_OFM0_POSITION                           0x5
#define _PWM11OFCON_OFM0_SIZE                               0x1
#define _PWM11OFCON_OFM0_LENGTH                             0x1
#define _PWM11OFCON_OFM0_MASK                               0x20
#define _PWM11OFCON_OFM1_POSN                               0x6
#define _PWM11OFCON_OFM1_POSITION                           0x6
#define _PWM11OFCON_OFM1_SIZE                               0x1
#define _PWM11OFCON_OFM1_LENGTH                             0x1
#define _PWM11OFCON_OFM1_MASK                               0x40

// Register: PWM12PH
#define PWM12PH PWM12PH
extern volatile unsigned short          PWM12PH             __at(0xDC1);
#ifndef _LIB_BUILD
asm("PWM12PH equ 0DC1h");
#endif

// Register: PWM12PHL
#define PWM12PHL PWM12PHL
extern volatile unsigned char           PWM12PHL            __at(0xDC1);
#ifndef _LIB_BUILD
asm("PWM12PHL equ 0DC1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM12PHL0              :1;
        unsigned PWM12PHL1              :1;
        unsigned PWM12PHL2              :1;
        unsigned PWM12PHL3              :1;
        unsigned PWM12PHL4              :1;
        unsigned PWM12PHL5              :1;
        unsigned PWM12PHL6              :1;
        unsigned PWM12PHL7              :1;
    };
    struct {
        unsigned PWM12PHL               :8;
    };
} PWM12PHLbits_t;
