MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile MD2MODPPSbits_t MD2MODPPSbits __at(0xE26);
// bitfield macros
#define _MD2MODPPS_MD2MODPPS_POSN                           0x0
#define _MD2MODPPS_MD2MODPPS_POSITION                       0x0
#define _MD2MODPPS_MD2MODPPS_SIZE                           0x6
#define _MD2MODPPS_MD2MODPPS_LENGTH                         0x6
#define _MD2MODPPS_MD2MODPPS_MASK                           0x3F

// Register: MD3CLPPS
#define MD3CLPPS MD3CLPPS
extern volatile unsigned char           MD3CLPPS            __at(0xE27);
#ifndef _LIB_BUILD
asm("MD3CLPPS equ 0E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD3CLPPS               :6;
    };
} MD3CLPPSbits_t;
extern volatile MD3CLPPSbits_t MD3CLPPSbits __at(0xE27);
// bitfield macros
#define _MD3CLPPS_MD3CLPPS_POSN                             0x0
#define _MD3CLPPS_MD3CLPPS_POSITION                         0x0
#define _MD3CLPPS_MD3CLPPS_SIZE                             0x6
#define _MD3CLPPS_MD3CLPPS_LENGTH                           0x6
#define _MD3CLPPS_MD3CLPPS_MASK                             0x3F

// Register: MD3CHPPS
#define MD3CHPPS MD3CHPPS
extern volatile unsigned char           MD3CHPPS            __at(0xE28);
#ifndef _LIB_BUILD
asm("MD3CHPPS equ 0E28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD3CHPPS               :6;
    };
} MD3CHPPSbits_t;
extern volatile MD3CHPPSbits_t MD3CHPPSbits __at(0xE28);
// bitfield macros
#define _MD3CHPPS_MD3CHPPS_POSN                             0x0
#define _MD3CHPPS_MD3CHPPS_POSITION                         0x0
#define _MD3CHPPS_MD3CHPPS_SIZE                             0x6
#define _MD3CHPPS_MD3CHPPS_LENGTH                           0x6
#define _MD3CHPPS_MD3CHPPS_MASK                             0x3F

// Register: MD3MODPPS
#define MD3MODPPS MD3MODPPS
extern volatile unsigned char           MD3MODPPS           __at(0xE29);
#ifndef _LIB_BUILD
asm("MD3MODPPS equ 0E29h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD3MODPPS              :6;
    };
} MD3MODPPSbits_t;
extern volatile MD3MODPPSbits_t MD3MODPPSbits __at(0xE29);
// bitfield macros
#define _MD3MODPPS_MD3MODPPS_POSN                           0x0
#define _MD3MODPPS_MD3MODPPS_POSITION                       0x0
#define _MD3MODPPS_MD3MODPPS_SIZE                           0x6
#define _MD3MODPPS_MD3MODPPS_LENGTH                         0x6
#define _MD3MODPPS_MD3MODPPS_MASK                           0x3F

// Register: MD4CLPPS
#define MD4CLPPS MD4CLPPS
extern volatile unsigned char           MD4CLPPS            __at(0xE2A);
#ifndef _LIB_BUILD
asm("MD4CLPPS equ 0E2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD4CLPPS               :6;
    };
} MD4CLPPSbits_t;
extern volatile MD4CLPPSbits_t MD4CLPPSbits __at(0xE2A);
// bitfield macros
#define _MD4CLPPS_MD4CLPPS_POSN                             0x0
#define _MD4CLPPS_MD4CLPPS_POSITION                         0x0
#define _MD4CLPPS_MD4CLPPS_SIZE                             0x6
#define _MD4CLPPS_MD4CLPPS_LENGTH                           0x6
#define _MD4CLPPS_MD4CLPPS_MASK                             0x3F

// Register: MD4CHPPS
#define MD4CHPPS MD4CHPPS
extern volatile unsigned char           MD4CHPPS            __at(0xE2B);
#ifndef _LIB_BUILD
asm("MD4CHPPS equ 0E2Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD4CHPPS               :6;
    };
} MD4CHPPSbits_t;
extern volatile MD4CHPPSbits_t MD4CHPPSbits __at(0xE2B);
// bitfield macros
#define _MD4CHPPS_MD4CHPPS_POSN                             0x0
#define _MD4CHPPS_MD4CHPPS_POSITION                         0x0
#define _MD4CHPPS_MD4CHPPS_SIZE                             0x6
#define _MD4CHPPS_MD4CHPPS_LENGTH                           0x6
#define _MD4CHPPS_MD4CHPPS_MASK                             0x3F

// Register: MD4MODPPS
#define MD4MODPPS MD4MODPPS
extern volatile unsigned char           MD4MODPPS           __at(0xE2C);
#ifndef _LIB_BUILD
asm("MD4MODPPS equ 0E2Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD4MODPPS              :6;
    };
} MD4MODPPSbits_t;
extern volatile MD4MODPPSbits_t MD4MODPPSbits __at(0xE2C);
// bitfield macros
#define _MD4MODPPS_MD4MODPPS_POSN                           0x0
#define _MD4MODPPS_MD4MODPPS_POSITION                       0x0
#define _MD4MODPPS_MD4MODPPS_SIZE                           0x6
#define _MD4MODPPS_MD4MODPPS_LENGTH                         0x6
#define _MD4MODPPS_MD4MODPPS_MASK                           0x3F

// Register: PRG1RPPS
#define PRG1RPPS PRG1RPPS
extern volatile unsigned char           PRG1RPPS            __at(0xE2D);
#ifndef _LIB_BUILD
asm("PRG1RPPS equ 0E2Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG1RPPS               :6;
    };
} PRG1RPPSbits_t;
extern volatile PRG1RPPSbits_t PRG1RPPSbits __at(0xE2D);
// bitfield macros
#define _PRG1RPPS_PRG1RPPS_POSN                             0x0
#define _PRG1RPPS_PRG1RPPS_POSITION                         0x0
#define _PRG1RPPS_PRG1RPPS_SIZE                             0x6
#define _PRG1RPPS_PRG1RPPS_LENGTH                           0x6
#define _PRG1RPPS_PRG1RPPS_MASK                             0x3F

// Register: PRG1FPPS
#define PRG1FPPS PRG1FPPS
extern volatile unsigned char           PRG1FPPS            __at(0xE2E);
#ifndef _LIB_BUILD
asm("PRG1FPPS equ 0E2Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG1FPPS               :6;
    };
} PRG1FPPSbits_t;
extern volatile PRG1FPPSbits_t PRG1FPPSbits __at(0xE2E);
// bitfield macros
#define _PRG1FPPS_PRG1FPPS_POSN                             0x0
#define _PRG1FPPS_PRG1FPPS_POSITION                         0x0
#define _PRG1FPPS_PRG1FPPS_SIZE                             0x6
#define _PRG1FPPS_PRG1FPPS_LENGTH                           0x6
#define _PRG1FPPS_PRG1FPPS_MASK                             0x3F

// Register: PRG2RPPS
#define PRG2RPPS PRG2RPPS
extern volatile unsigned char           PRG2RPPS            __at(0xE2F);
#ifndef _LIB_BUILD
asm("PRG2RPPS equ 0E2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG2RPPS               :6;
    };
} PRG2RPPSbits_t;
extern volatile PRG2RPPSbits_t PRG2RPPSbits __at(0xE2F);
// bitfield macros
#define _PRG2RPPS_PRG2RPPS_POSN                             0x0
#define _PRG2RPPS_PRG2RPPS_POSITION                         0x0
#define _PRG2RPPS_PRG2RPPS_SIZE                             0x6
#define _PRG2RPPS_PRG2RPPS_LENGTH                           0x6
#define _PRG2RPPS_PRG2RPPS_MASK                             0x3F

// Register: PRG2FPPS
#define PRG2FPPS PRG2FPPS
extern volatile unsigned char           PRG2FPPS            __at(0xE30);
#ifndef _LIB_BUILD
asm("PRG2FPPS equ 0E30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG2FPPS               :6;
    };
} PRG2FPPSbits_t;
extern volatile PRG2FPPSbits_t PRG2FPPSbits __at(0xE30);
// bitfield macros
#define _PRG2FPPS_PRG2FPPS_POSN                             0x0
#define _PRG2FPPS_PRG2FPPS_POSITION                         0x0
#define _PRG2FPPS_PRG2FPPS_SIZE                             0x6
#define _PRG2FPPS_PRG2FPPS_LENGTH                           0x6
#define _PRG2FPPS_PRG2FPPS_MASK                             0x3F

// Register: PRG3RPPS
#define PRG3RPPS PRG3RPPS
extern volatile unsigned char           PRG3RPPS            __at(0xE31);
#ifndef _LIB_BUILD
asm("PRG3RPPS equ 0E31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG3RPPS               :6;
    };
} PRG3RPPSbits_t;
extern volatile PRG3RPPSbits_t PRG3RPPSbits __at(0xE31);
// bitfield macros
#define _PRG3RPPS_PRG3RPPS_POSN                             0x0
#define _PRG3RPPS_PRG3RPPS_POSITION                         0x0
#define _PRG3RPPS_PRG3RPPS_SIZE                             0x6
#define _PRG3RPPS_PRG3RPPS_LENGTH                           0x6
#define _PRG3RPPS_PRG3RPPS_MASK                             0x3F

// Register: PRG3FPPS
#define PRG3FPPS PRG3FPPS
extern volatile unsigned char           PRG3FPPS            __at(0xE32);
#ifndef _LIB_BUILD
asm("PRG3FPPS equ 0E32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG3FPPS               :6;
    };
} PRG3FPPSbits_t;
extern volatile PRG3FPPSbits_t PRG3FPPSbits __at(0xE32);
// bitfield macros
#define _PRG3FPPS_PRG3FPPS_POSN                             0x0
#define _PRG3FPPS_PRG3FPPS_POSITION                         0x0
#define _PRG3FPPS_PRG3FPPS_SIZE                             0x6
#define _PRG3FPPS_PRG3FPPS_LENGTH                           0x6
#define _PRG3FPPS_PRG3FPPS_MASK                             0x3F

// Register: PRG4RPPS
#define PRG4RPPS PRG4RPPS
extern volatile unsigned char           PRG4RPPS            __at(0xE33);
#ifndef _LIB_BUILD
asm("PRG4RPPS equ 0E33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG4RPPS               :6;
    };
} PRG4RPPSbits_t;
extern volatile PRG4RPPSbits_t PRG4RPPSbits __at(0xE33);
// bitfield macros
#define _PRG4RPPS_PRG4RPPS_POSN                             0x0
#define _PRG4RPPS_PRG4RPPS_POSITION                         0x0
#define _PRG4RPPS_PRG4RPPS_SIZE                             0x6
#define _PRG4RPPS_PRG4RPPS_LENGTH                           0x6
#define _PRG4RPPS_PRG4RPPS_MASK                             0x3F

// Register: PRG4FPPS
#define PRG4FPPS PRG4FPPS
extern volatile unsigned char           PRG4FPPS            __at(0xE34);
#ifndef _LIB_BUILD
asm("PRG4FPPS equ 0E34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG4FPPS               :6;
    };
} PRG4FPPSbits_t;
extern volatile PRG4FPPSbits_t PRG4FPPSbits __at(0xE34);
// bitfield macros
#define _PRG4FPPS_PRG4FPPS_POSN                             0x0
#define _PRG4FPPS_PRG4FPPS_POSITION                         0x0
#define _PRG4FPPS_PRG4FPPS_SIZE                             0x6
#define _PRG4FPPS_PRG4FPPS_LENGTH                           0x6
#define _PRG4FPPS_PRG4FPPS_MASK                             0x3F

