MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1777/mcu.h
extern volatile __bit                   C3PCH0              __at(0x8E8);	// @ (0x11D * 8 + 0)
#define                                 C3PCH0_bit          _BIT_ACCESS(CM3PSEL,0)
// CM3PSEL<C3PCH1>
extern volatile __bit                   C3PCH1              __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 C3PCH1_bit          _BIT_ACCESS(CM3PSEL,1)
// CM3PSEL<C3PCH2>
extern volatile __bit                   C3PCH2              __at(0x8EA);	// @ (0x11D * 8 + 2)
#define                                 C3PCH2_bit          _BIT_ACCESS(CM3PSEL,2)
// CM3PSEL<C3PCH3>
extern volatile __bit                   C3PCH3              __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 C3PCH3_bit          _BIT_ACCESS(CM3PSEL,3)
// CM3CON0<C3POL>
extern volatile __bit                   C3POL               __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 C3POL_bit           _BIT_ACCESS(CM3CON0,4)
// CM3CON0<C3SYNC>
extern volatile __bit                   C3SYNC              __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 C3SYNC_bit          _BIT_ACCESS(CM3CON0,0)
// CM3CON0<C3ZLF>
extern volatile __bit                   C3ZLF               __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 C3ZLF_bit           _BIT_ACCESS(CM3CON0,3)
// CM4CON0<C4HYS>
extern volatile __bit                   C4HYS               __at(0x4861);	// @ (0x90C * 8 + 1)
#define                                 C4HYS_bit           _BIT_ACCESS(CM4CON0,1)
// PIE2<C4IE>
extern volatile __bit                   C4IE                __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 C4IE_bit            _BIT_ACCESS(PIE2,2)
// PIR2<C4IF>
extern volatile __bit                   C4IF                __at(0x92);	// @ (0x12 * 8 + 2)
#define                                 C4IF_bit            _BIT_ACCESS(PIR2,2)
// CM4CON1<C4INTN>
extern volatile __bit                   C4INTN              __at(0x4868);	// @ (0x90D * 8 + 0)
#define                                 C4INTN_bit          _BIT_ACCESS(CM4CON1,0)
// CM4CON1<C4INTP>
extern volatile __bit                   C4INTP              __at(0x4869);	// @ (0x90D * 8 + 1)
#define                                 C4INTP_bit          _BIT_ACCESS(CM4CON1,1)
// CM4NSEL<C4NCH0>
extern volatile __bit                   C4NCH0              __at(0x4870);	// @ (0x90E * 8 + 0)
#define                                 C4NCH0_bit          _BIT_ACCESS(CM4NSEL,0)
// CM4NSEL<C4NCH1>
extern volatile __bit                   C4NCH1              __at(0x4871);	// @ (0x90E * 8 + 1)
#define                                 C4NCH1_bit          _BIT_ACCESS(CM4NSEL,1)
// CM4NSEL<C4NCH2>
extern volatile __bit                   C4NCH2              __at(0x4872);	// @ (0x90E * 8 + 2)
#define                                 C4NCH2_bit          _BIT_ACCESS(CM4NSEL,2)
// CM4NSEL<C4NCH3>
extern volatile __bit                   C4NCH3              __at(0x4873);	// @ (0x90E * 8 + 3)
#define                                 C4NCH3_bit          _BIT_ACCESS(CM4NSEL,3)
// CM4CON0<C4ON>
extern volatile __bit                   C4ON                __at(0x4867);	// @ (0x90C * 8 + 7)
#define                                 C4ON_bit            _BIT_ACCESS(CM4CON0,7)
// CM4CON0<C4OUT>
extern volatile __bit                   C4OUT               __at(0x4866);	// @ (0x90C * 8 + 6)
#define                                 C4OUT_bit           _BIT_ACCESS(CM4CON0,6)
// CM4PSEL<C4PCH0>
extern volatile __bit                   C4PCH0              __at(0x4878);	// @ (0x90F * 8 + 0)
#define                                 C4PCH0_bit          _BIT_ACCESS(CM4PSEL,0)
// CM4PSEL<C4PCH1>
extern volatile __bit                   C4PCH1              __at(0x4879);	// @ (0x90F * 8 + 1)
#define                                 C4PCH1_bit          _BIT_ACCESS(CM4PSEL,1)
// CM4PSEL<C4PCH2>
extern volatile __bit                   C4PCH2              __at(0x487A);	// @ (0x90F * 8 + 2)
#define                                 C4PCH2_bit          _BIT_ACCESS(CM4PSEL,2)
// CM4PSEL<C4PCH3>
extern volatile __bit                   C4PCH3              __at(0x487B);	// @ (0x90F * 8 + 3)
#define                                 C4PCH3_bit          _BIT_ACCESS(CM4PSEL,3)
// CM4CON0<C4POL>
extern volatile __bit                   C4POL               __at(0x4864);	// @ (0x90C * 8 + 4)
#define                                 C4POL_bit           _BIT_ACCESS(CM4CON0,4)
// CM4CON0<C4SYNC>
extern volatile __bit                   C4SYNC              __at(0x4860);	// @ (0x90C * 8 + 0)
#define                                 C4SYNC_bit          _BIT_ACCESS(CM4CON0,0)
// CM4CON0<C4ZLF>
extern volatile __bit                   C4ZLF               __at(0x4863);	// @ (0x90C * 8 + 3)
#define                                 C4ZLF_bit           _BIT_ACCESS(CM4CON0,3)
// CM5CON0<C5HYS>
extern volatile __bit                   C5HYS               __at(0x4881);	// @ (0x910 * 8 + 1)
#define                                 C5HYS_bit           _BIT_ACCESS(CM5CON0,1)
// PIE5<C5IE>
extern volatile __bit                   C5IE                __at(0x4A8);	// @ (0x95 * 8 + 0)
#define                                 C5IE_bit            _BIT_ACCESS(PIE5,0)
// PIR5<C5IF>
extern volatile __bit                   C5IF                __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 C5IF_bit            _BIT_ACCESS(PIR5,0)
// CM5CON1<C5INTN>
extern volatile __bit                   C5INTN              __at(0x4888);	// @ (0x911 * 8 + 0)
#define                                 C5INTN_bit          _BIT_ACCESS(CM5CON1,0)
// CM5CON1<C5INTP>
extern volatile __bit                   C5INTP              __at(0x4889);	// @ (0x911 * 8 + 1)
#define                                 C5INTP_bit          _BIT_ACCESS(CM5CON1,1)
// CM5NSEL<C5NCH0>
extern volatile __bit                   C5NCH0              __at(0x4890);	// @ (0x912 * 8 + 0)
#define                                 C5NCH0_bit          _BIT_ACCESS(CM5NSEL,0)
// CM5NSEL<C5NCH1>
extern volatile __bit                   C5NCH1              __at(0x4891);	// @ (0x912 * 8 + 1)
#define                                 C5NCH1_bit          _BIT_ACCESS(CM5NSEL,1)
// CM5NSEL<C5NCH2>
extern volatile __bit                   C5NCH2              __at(0x4892);	// @ (0x912 * 8 + 2)
#define                                 C5NCH2_bit          _BIT_ACCESS(CM5NSEL,2)
// CM5NSEL<C5NCH3>
extern volatile __bit                   C5NCH3              __at(0x4893);	// @ (0x912 * 8 + 3)
#define                                 C5NCH3_bit          _BIT_ACCESS(CM5NSEL,3)
// CM5CON0<C5ON>
extern volatile __bit                   C5ON                __at(0x4887);	// @ (0x910 * 8 + 7)
#define                                 C5ON_bit            _BIT_ACCESS(CM5CON0,7)
// CM5CON0<C5OUT>
extern volatile __bit                   C5OUT               __at(0x4886);	// @ (0x910 * 8 + 6)
#define                                 C5OUT_bit           _BIT_ACCESS(CM5CON0,6)
// CM5PSEL<C5PCH0>
extern volatile __bit                   C5PCH0              __at(0x4898);	// @ (0x913 * 8 + 0)
#define                                 C5PCH0_bit          _BIT_ACCESS(CM5PSEL,0)
// CM5PSEL<C5PCH1>
extern volatile __bit                   C5PCH1              __at(0x4899);	// @ (0x913 * 8 + 1)
#define                                 C5PCH1_bit          _BIT_ACCESS(CM5PSEL,1)
// CM5PSEL<C5PCH2>
extern volatile __bit                   C5PCH2              __at(0x489A);	// @ (0x913 * 8 + 2)
#define                                 C5PCH2_bit          _BIT_ACCESS(CM5PSEL,2)
// CM5PSEL<C5PCH3>
extern volatile __bit                   C5PCH3              __at(0x489B);	// @ (0x913 * 8 + 3)
#define                                 C5PCH3_bit          _BIT_ACCESS(CM5PSEL,3)
// CM5CON0<C5POL>
extern volatile __bit                   C5POL               __at(0x4884);	// @ (0x910 * 8 + 4)
#define                                 C5POL_bit           _BIT_ACCESS(CM5CON0,4)
// CM5CON0<C5SYNC>
extern volatile __bit                   C5SYNC              __at(0x4880);	// @ (0x910 * 8 + 0)
#define                                 C5SYNC_bit          _BIT_ACCESS(CM5CON0,0)
// CM5CON0<C5ZLF>
extern volatile __bit                   C5ZLF               __at(0x4883);	// @ (0x910 * 8 + 3)
#define                                 C5ZLF_bit           _BIT_ACCESS(CM5CON0,3)
// CM6CON0<C6HYS>
extern volatile __bit                   C6HYS               __at(0x48A1);	// @ (0x914 * 8 + 1)
#define                                 C6HYS_bit           _BIT_ACCESS(CM6CON0,1)
// PIE5<C6IE>
extern volatile __bit                   C6IE                __at(0x4A9);	// @ (0x95 * 8 + 1)
#define                                 C6IE_bit            _BIT_ACCESS(PIE5,1)
// PIR5<C6IF>
extern volatile __bit                   C6IF                __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 C6IF_bit            _BIT_ACCESS(PIR5,1)
// CM6CON1<C6INTN>
extern volatile __bit                   C6INTN              __at(0x48A8);	// @ (0x915 * 8 + 0)
#define                                 C6INTN_bit          _BIT_ACCESS(CM6CON1,0)
// CM6CON1<C6INTP>
extern volatile __bit                   C6INTP              __at(0x48A9);	// @ (0x915 * 8 + 1)
#define                                 C6INTP_bit          _BIT_ACCESS(CM6CON1,1)
// CM6NSEL<C6NCH0>
extern volatile __bit                   C6NCH0              __at(0x48B0);	// @ (0x916 * 8 + 0)
#define                                 C6NCH0_bit          _BIT_ACCESS(CM6NSEL,0)
// CM6NSEL<C6NCH1>
extern volatile __bit                   C6NCH1              __at(0x48B1);	// @ (0x916 * 8 + 1)
#define                                 C6NCH1_bit          _BIT_ACCESS(CM6NSEL,1)
// CM6NSEL<C6NCH2>
extern volatile __bit                   C6NCH2              __at(0x48B2);	// @ (0x916 * 8 + 2)
#define                                 C6NCH2_bit          _BIT_ACCESS(CM6NSEL,2)
// CM6NSEL<C6NCH3>
extern volatile __bit                   C6NCH3              __at(0x48B3);	// @ (0x916 * 8 + 3)
#define                                 C6NCH3_bit          _BIT_ACCESS(CM6NSEL,3)
// CM6CON0<C6ON>
extern volatile __bit                   C6ON                __at(0x48A7);	// @ (0x914 * 8 + 7)
#define                                 C6ON_bit            _BIT_ACCESS(CM6CON0,7)
// CM6CON0<C6OUT>
extern volatile __bit                   C6OUT               __at(0x48A6);	// @ (0x914 * 8 + 6)
#define                                 C6OUT_bit           _BIT_ACCESS(CM6CON0,6)
// CM6PSEL<C6PCH0>
extern volatile __bit                   C6PCH0              __at(0x48B8);	// @ (0x917 * 8 + 0)
#define                                 C6PCH0_bit          _BIT_ACCESS(CM6PSEL,0)
// CM6PSEL<C6PCH1>
extern volatile __bit                   C6PCH1              __at(0x48B9);	// @ (0x917 * 8 + 1)
#define                                 C6PCH1_bit          _BIT_ACCESS(CM6PSEL,1)
// CM6PSEL<C6PCH2>
extern volatile __bit                   C6PCH2              __at(0x48BA);	// @ (0x917 * 8 + 2)
#define                                 C6PCH2_bit          _BIT_ACCESS(CM6PSEL,2)
// CM6PSEL<C6PCH3>
extern volatile __bit                   C6PCH3              __at(0x48BB);	// @ (0x917 * 8 + 3)
#define                                 C6PCH3_bit          _BIT_ACCESS(CM6PSEL,3)
// CM6CON0<C6POL>
extern volatile __bit                   C6POL               __at(0x48A4);	// @ (0x914 * 8 + 4)
#define                                 C6POL_bit           _BIT_ACCESS(CM6CON0,4)
// CM6CON0<C6SYNC>
extern volatile __bit                   C6SYNC              __at(0x48A0);	// @ (0x914 * 8 + 0)
#define                                 C6SYNC_bit          _BIT_ACCESS(CM6CON0,0)
// CM6CON0<C6ZLF>
extern volatile __bit                   C6ZLF               __at(0x48A3);	// @ (0x914 * 8 + 3)
#define                                 C6ZLF_bit           _BIT_ACCESS(CM6CON0,3)
// CM7CON0<C7HYS>
extern volatile __bit                   C7HYS               __at(0x48C1);	// @ (0x918 * 8 + 1)
#define                                 C7HYS_bit           _BIT_ACCESS(CM7CON0,1)
// PIE5<C7IE>
extern volatile __bit                   C7IE                __at(0x4AA);	// @ (0x95 * 8 + 2)
#define                                 C7IE_bit            _BIT_ACCESS(PIE5,2)
// PIR5<C7IF>
extern volatile __bit                   C7IF                __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 C7IF_bit            _BIT_ACCESS(PIR5,2)
// CM7CON1<C7INTN>
extern volatile __bit                   C7INTN              __at(0x48C8);	// @ (0x919 * 8 + 0)
#define                                 C7INTN_bit          _BIT_ACCESS(CM7CON1,0)
// CM7CON1<C7INTP>
extern volatile __bit                   C7INTP              __at(0x48C9);	// @ (0x919 * 8 + 1)
#define                                 C7INTP_bit          _BIT_ACCESS(CM7CON1,1)
// CM7NSEL<C7NCH0>
extern volatile __bit                   C7NCH0              __at(0x48D0);	// @ (0x91A * 8 + 0)
#define                                 C7NCH0_bit          _BIT_ACCESS(CM7NSEL,0)
// CM7NSEL<C7NCH1>
extern volatile __bit                   C7NCH1              __at(0x48D1);	// @ (0x91A * 8 + 1)
#define                                 C7NCH1_bit          _BIT_ACCESS(CM7NSEL,1)
// CM7NSEL<C7NCH2>
extern volatile __bit                   C7NCH2              __at(0x48D2);	// @ (0x91A * 8 + 2)
#define                                 C7NCH2_bit          _BIT_ACCESS(CM7NSEL,2)
// CM7NSEL<C7NCH3>
extern volatile __bit                   C7NCH3              __at(0x48D3);	// @ (0x91A * 8 + 3)
#define                                 C7NCH3_bit          _BIT_ACCESS(CM7NSEL,3)
// CM7CON0<C7ON>
extern volatile __bit                   C7ON                __at(0x48C7);	// @ (0x918 * 8 + 7)
#define                                 C7ON_bit            _BIT_ACCESS(CM7CON0,7)
// CM7CON0<C7OUT>
extern volatile __bit                   C7OUT               __at(0x48C6);	// @ (0x918 * 8 + 6)
#define                                 C7OUT_bit           _BIT_ACCESS(CM7CON0,6)
// CM7PSEL<C7PCH0>
extern volatile __bit                   C7PCH0              __at(0x48D8);	// @ (0x91B * 8 + 0)
#define                                 C7PCH0_bit          _BIT_ACCESS(CM7PSEL,0)
// CM7PSEL<C7PCH1>
extern volatile __bit                   C7PCH1              __at(0x48D9);	// @ (0x91B * 8 + 1)
#define                                 C7PCH1_bit          _BIT_ACCESS(CM7PSEL,1)
// CM7PSEL<C7PCH2>
extern volatile __bit                   C7PCH2              __at(0x48DA);	// @ (0x91B * 8 + 2)
#define                                 C7PCH2_bit          _BIT_ACCESS(CM7PSEL,2)
// CM7PSEL<C7PCH3>
extern volatile __bit                   C7PCH3              __at(0x48DB);	// @ (0x91B * 8 + 3)
#define                                 C7PCH3_bit          _BIT_ACCESS(CM7PSEL,3)
// CM7CON0<C7POL>
extern volatile __bit                   C7POL               __at(0x48C4);	// @ (0x918 * 8 + 4)
#define                                 C7POL_bit           _BIT_ACCESS(CM7CON0,4)
// CM7CON0<C7SYNC>
extern volatile __bit                   C7SYNC              __at(0x48C0);	// @ (0x918 * 8 + 0)
#define                                 C7SYNC_bit          _BIT_ACCESS(CM7CON0,0)
// CCPTMRS1<C7TSEL0>
extern volatile __bit                   C7TSEL0             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 C7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<C7TSEL1>
extern volatile __bit                   C7TSEL1             __at(0x14F5);	// @ (0x29E * 8 + 5)
#define                                 C7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,5)
// CM7CON0<C7ZLF>
extern volatile __bit                   C7ZLF               __at(0x48C3);	// @ (0x918 * 8 + 3)
#define                                 C7ZLF_bit           _BIT_ACCESS(CM7CON0,3)
// CM8CON0<C8HYS>
extern volatile __bit                   C8HYS               __at(0x48E1);	// @ (0x91C * 8 + 1)
#define                                 C8HYS_bit           _BIT_ACCESS(CM8CON0,1)
// PIE5<C8IE>
extern volatile __bit                   C8IE                __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 C8IE_bit            _BIT_ACCESS(PIE5,3)
// PIR5<C8IF>
extern volatile __bit                   C8IF                __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 C8IF_bit            _BIT_ACCESS(PIR5,3)
// CM8CON1<C8INTN>
extern volatile __bit                   C8INTN              __at(0x48E8);	// @ (0x91D * 8 + 0)
#define                                 C8INTN_bit          _BIT_ACCESS(CM8CON1,0)
// CM8CON1<C8INTP>
extern volatile __bit                   C8INTP              __at(0x48E9);	// @ (0x91D * 8 + 1)
#define                                 C8INTP_bit          _BIT_ACCESS(CM8CON1,1)
// CM8NSEL<C8NCH0>
extern volatile __bit                   C8NCH0              __at(0x48F0);	// @ (0x91E * 8 + 0)
#define                                 C8NCH0_bit          _BIT_ACCESS(CM8NSEL,0)
// CM8NSEL<C8NCH1>
extern volatile __bit                   C8NCH1              __at(0x48F1);	// @ (0x91E * 8 + 1)
#define                                 C8NCH1_bit          _BIT_ACCESS(CM8NSEL,1)
// CM8NSEL<C8NCH2>
extern volatile __bit                   C8NCH2              __at(0x48F2);	// @ (0x91E * 8 + 2)
#define                                 C8NCH2_bit          _BIT_ACCESS(CM8NSEL,2)
// CM8NSEL<C8NCH3>
extern volatile __bit                   C8NCH3              __at(0x48F3);	// @ (0x91E * 8 + 3)
#define                                 C8NCH3_bit          _BIT_ACCESS(CM8NSEL,3)
// CM8CON0<C8ON>
extern volatile __bit                   C8ON                __at(0x48E7);	// @ (0x91C * 8 + 7)
#define                                 C8ON_bit            _BIT_ACCESS(CM8CON0,7)
// CM8CON0<C8OUT>
extern volatile __bit                   C8OUT               __at(0x48E6);	// @ (0x91C * 8 + 6)
#define                                 C8OUT_bit           _BIT_ACCESS(CM8CON0,6)
// CM8PSEL<C8PCH0>
extern volatile __bit                   C8PCH0              __at(0x48F8);	// @ (0x91F * 8 + 0)
#define                                 C8PCH0_bit          _BIT_ACCESS(CM8PSEL,0)
// CM8PSEL<C8PCH1>
extern volatile __bit                   C8PCH1              __at(0x48F9);	// @ (0x91F * 8 + 1)
#define                                 C8PCH1_bit          _BIT_ACCESS(CM8PSEL,1)
// CM8PSEL<C8PCH2>
extern volatile __bit                   C8PCH2              __at(0x48FA);	// @ (0x91F * 8 + 2)
#define                                 C8PCH2_bit          _BIT_ACCESS(CM8PSEL,2)
// CM8PSEL<C8PCH3>
extern volatile __bit                   C8PCH3              __at(0x48FB);	// @ (0x91F * 8 + 3)
#define                                 C8PCH3_bit          _BIT_ACCESS(CM8PSEL,3)
// CM8CON0<C8POL>
extern volatile __bit                   C8POL               __at(0x48E4);	// @ (0x91C * 8 + 4)
#define                                 C8POL_bit           _BIT_ACCESS(CM8CON0,4)
// CM8CON0<C8SYNC>
extern volatile __bit                   C8SYNC              __at(0x48E0);	// @ (0x91C * 8 + 0)
#define                                 C8SYNC_bit          _BIT_ACCESS(CM8CON0,0)
// CM8CON0<C8ZLF>
extern volatile __bit                   C8ZLF               __at(0x48E3);	// @ (0x91C * 8 + 3)
#define                                 C8ZLF_bit           _BIT_ACCESS(CM8CON0,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x14A0);	// @ (0x294 * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x14A1);	// @ (0x294 * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CAP<CCP1CTS2>
extern volatile __bit                   CCP1CTS2            __at(0x14A2);	// @ (0x294 * 8 + 2)
#define                                 CCP1CTS2_bit        _BIT_ACCESS(CCP1CAP,2)
// CCP1CAP<CCP1CTS3>
extern volatile __bit                   CCP1CTS3            __at(0x14A3);	// @ (0x294 * 8 + 3)
#define                                 CCP1CTS3_bit        _BIT_ACCESS(CCP1CAP,3)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x149F);	// @ (0x293 * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x14C0);	// @ (0x298 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x14C1);	// @ (0x298 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CAP<CCP2CTS2>
extern volatile __bit                   CCP2CTS2            __at(0x14C2);	// @ (0x298 * 8 + 2)
#define                                 CCP2CTS2_bit        _BIT_ACCESS(CCP2CAP,2)
// CCP2CAP<CCP2CTS3>
extern volatile __bit                   CCP2CTS3            __at(0x14C3);	// @ (0x298 * 8 + 3)
#define                                 CCP2CTS3_bit        _BIT_ACCESS(CCP2CAP,3)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x14BF);	// @ (0x297 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x14BC);	// @ (0x297 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x14B8);	// @ (0x297 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x14B9);	// @ (0x297 * 8 + 1)
